// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Jacovone
namespace Jacovone {
  // Skipping declaration: UpdateModeType because it is already included!
  // Forward declaring type: PathMagic
  class PathMagic;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Completed forward declares
// Type namespace: Jacovone
namespace Jacovone {
  // Forward declaring type: PathMagicAnimator
  class PathMagicAnimator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Jacovone::PathMagicAnimator);
DEFINE_IL2CPP_ARG_TYPE(::Jacovone::PathMagicAnimator*, "Jacovone", "PathMagicAnimator");
// Type namespace: Jacovone
namespace Jacovone {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: Jacovone.PathMagicAnimator
  // [TokenAttribute] Offset: FFFFFFFF
  class PathMagicAnimator : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Jacovone::PathMagicAnimator::WaypointChangedEvent
    class WaypointChangedEvent;
    // Nested type: ::Jacovone::PathMagicAnimator::UpdateModeType
    struct UpdateModeType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Jacovone.PathMagicAnimator/UpdateModeType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateModeType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateModeType
      constexpr UpdateModeType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Jacovone.PathMagicAnimator/UpdateModeType OnUpdate
      static constexpr const int OnUpdate = 0;
      // Get static field: static public Jacovone.PathMagicAnimator/UpdateModeType OnUpdate
      static ::Jacovone::PathMagicAnimator::UpdateModeType _get_OnUpdate();
      // Set static field: static public Jacovone.PathMagicAnimator/UpdateModeType OnUpdate
      static void _set_OnUpdate(::Jacovone::PathMagicAnimator::UpdateModeType value);
      // static field const value: static public Jacovone.PathMagicAnimator/UpdateModeType OnFixedUpdate
      static constexpr const int OnFixedUpdate = 1;
      // Get static field: static public Jacovone.PathMagicAnimator/UpdateModeType OnFixedUpdate
      static ::Jacovone::PathMagicAnimator::UpdateModeType _get_OnFixedUpdate();
      // Set static field: static public Jacovone.PathMagicAnimator/UpdateModeType OnFixedUpdate
      static void _set_OnFixedUpdate(::Jacovone::PathMagicAnimator::UpdateModeType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Jacovone.PathMagicAnimator/UpdateModeType
    #pragma pack(pop)
    static check_size<sizeof(PathMagicAnimator::UpdateModeType), 0 + sizeof(int)> __Jacovone_PathMagicAnimator_UpdateModeTypeSizeCheck;
    static_assert(sizeof(PathMagicAnimator::UpdateModeType) == 0x4);
    public:
    // public Jacovone.PathMagic pathMagic
    // Size: 0x8
    // Offset: 0x18
    ::Jacovone::PathMagic* pathMagic;
    // Field size check
    static_assert(sizeof(::Jacovone::PathMagic*) == 0x8);
    // public UnityEngine.Transform target
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* target;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public Jacovone.PathMagicAnimator/UpdateModeType updateMode
    // Size: 0x4
    // Offset: 0x28
    ::Jacovone::PathMagicAnimator::UpdateModeType updateMode;
    // Field size check
    static_assert(sizeof(::Jacovone::PathMagicAnimator::UpdateModeType) == 0x4);
    // public System.Boolean autoStart
    // Size: 0x1
    // Offset: 0x2C
    bool autoStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoStart and: velocityBias
    char __padding3[0x3] = {};
    // public System.Single velocityBias
    // Size: 0x4
    // Offset: 0x30
    float velocityBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single currentPos
    // Size: 0x4
    // Offset: 0x34
    float currentPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isPlaying
    // Size: 0x1
    // Offset: 0x38
    bool isPlaying;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPlaying and: globalLookAt
    char __padding6[0x7] = {};
    // public UnityEngine.Transform globalLookAt
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* globalLookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean disableOrientation
    // Size: 0x1
    // Offset: 0x48
    bool disableOrientation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean globalFollowPath
    // Size: 0x1
    // Offset: 0x49
    bool globalFollowPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: globalFollowPath and: waypointChanged
    char __padding9[0x6] = {};
    // public Jacovone.PathMagicAnimator/WaypointChangedEvent waypointChanged
    // Size: 0x8
    // Offset: 0x50
    ::Jacovone::PathMagicAnimator::WaypointChangedEvent* waypointChanged;
    // Field size check
    static_assert(sizeof(::Jacovone::PathMagicAnimator::WaypointChangedEvent*) == 0x8);
    // private System.Int32 _lastPassedWayponint
    // Size: 0x4
    // Offset: 0x58
    int lastPassedWayponint;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single _lastVelocity
    // Size: 0x4
    // Offset: 0x5C
    float lastVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public Jacovone.PathMagic pathMagic
    [[deprecated("Use field access instead!")]] ::Jacovone::PathMagic*& dyn_pathMagic();
    // Get instance field reference: public UnityEngine.Transform target
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_target();
    // Get instance field reference: public Jacovone.PathMagicAnimator/UpdateModeType updateMode
    [[deprecated("Use field access instead!")]] ::Jacovone::PathMagicAnimator::UpdateModeType& dyn_updateMode();
    // Get instance field reference: public System.Boolean autoStart
    [[deprecated("Use field access instead!")]] bool& dyn_autoStart();
    // Get instance field reference: public System.Single velocityBias
