// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Jacovone
namespace Jacovone {
  // Skipping declaration: UpdateModeType because it is already included!
  // Forward declaring type: Waypoint
  class Waypoint;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: Jacovone
namespace Jacovone {
  // Forward declaring type: PathMagic
  class PathMagic;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Jacovone::PathMagic);
DEFINE_IL2CPP_ARG_TYPE(::Jacovone::PathMagic*, "Jacovone", "PathMagic");
// Type namespace: Jacovone
namespace Jacovone {
  // Size: 0xB4
  #pragma pack(push, 1)
  // Autogenerated type: Jacovone.PathMagic
  // [TokenAttribute] Offset: FFFFFFFF
  class PathMagic : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Jacovone::PathMagic::WaypointChangedEvent
    class WaypointChangedEvent;
    // Nested type: ::Jacovone::PathMagic::UpdateModeType
    struct UpdateModeType;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Jacovone.PathMagic/UpdateModeType
    // [TokenAttribute] Offset: FFFFFFFF
    struct UpdateModeType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: UpdateModeType
      constexpr UpdateModeType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Jacovone.PathMagic/UpdateModeType OnUpdate
      static constexpr const int OnUpdate = 0;
      // Get static field: static public Jacovone.PathMagic/UpdateModeType OnUpdate
      static ::Jacovone::PathMagic::UpdateModeType _get_OnUpdate();
      // Set static field: static public Jacovone.PathMagic/UpdateModeType OnUpdate
      static void _set_OnUpdate(::Jacovone::PathMagic::UpdateModeType value);
      // static field const value: static public Jacovone.PathMagic/UpdateModeType OnFixedUpdate
      static constexpr const int OnFixedUpdate = 1;
      // Get static field: static public Jacovone.PathMagic/UpdateModeType OnFixedUpdate
      static ::Jacovone::PathMagic::UpdateModeType _get_OnFixedUpdate();
      // Set static field: static public Jacovone.PathMagic/UpdateModeType OnFixedUpdate
      static void _set_OnFixedUpdate(::Jacovone::PathMagic::UpdateModeType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Jacovone.PathMagic/UpdateModeType
    #pragma pack(pop)
    static check_size<sizeof(PathMagic::UpdateModeType), 0 + sizeof(int)> __Jacovone_PathMagic_UpdateModeTypeSizeCheck;
    static_assert(sizeof(PathMagic::UpdateModeType) == 0x4);
    public:
    // public UnityEngine.Color pathColor
    // Size: 0x10
    // Offset: 0x18
    ::UnityEngine::Color pathColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public Jacovone.Waypoint[] waypoints
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::Jacovone::Waypoint*> waypoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::Jacovone::Waypoint*>) == 0x8);
    // public UnityEngine.Transform target
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* target;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean disableOrientation
    // Size: 0x1
    // Offset: 0x38
    bool disableOrientation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableOrientation and: globalLookAt
    char __padding3[0x7] = {};
    // public UnityEngine.Transform globalLookAt
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* globalLookAt;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean globalFollowPath
    // Size: 0x1
    // Offset: 0x48
    bool globalFollowPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: globalFollowPath and: globalFollowPathBias
    char __padding5[0x3] = {};
    // public System.Single globalFollowPathBias
    // Size: 0x4
    // Offset: 0x4C
    float globalFollowPathBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Jacovone.PathMagic/UpdateModeType updateMode
    // Size: 0x4
    // Offset: 0x50
    ::Jacovone::PathMagic::UpdateModeType updateMode;
    // Field size check
    static_assert(sizeof(::Jacovone::PathMagic::UpdateModeType) == 0x4);
    // public System.Boolean loop
    // Size: 0x1
    // Offset: 0x54
    bool loop;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean autoStart
    // Size: 0x1
    // Offset: 0x55
    bool autoStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoStart and: velocityBias
    char __padding9[0x2] = {};
    // public System.Single velocityBias
    // Size: 0x4
    // Offset: 0x58
    float velocityBias;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single currentPos
    // Size: 0x4
    // Offset: 0x5C
    float currentPos;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isPlaying
    // Size: 0x1
    // Offset: 0x60
    bool isPlaying;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPlaying and: waypointChanged
    char __padding12[0x7] = {};
    // public Jacovone.PathMagic/WaypointChangedEvent waypointChanged
    // Size: 0x8
    // Offset: 0x68
    ::Jacovone::PathMagic::WaypointChangedEvent* waypointChanged;
    // Field size check
    static_assert(sizeof(::Jacovone::PathMagic::WaypointChangedEvent*) == 0x8);
    // public System.Boolean presampledPath
    // Size: 0x1
    // Offset: 0x70
    bool presampledPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: presampledPath and: samplesNum
    char __padding14[0x3] = {};
    // public System.Int32 samplesNum
    // Size: 0x4
    // Offset: 0x74
    int samplesNum;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _lastPassedWayponint
    // Size: 0x4
    // Offset: 0x78
    int lastPassedWayponint;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: lastPassedWayponint and: positionSamples
    char __padding16[0x4] = {};
    // public UnityEngine.Vector3[] positionSamples
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::Vector3> positionSamples;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // public UnityEngine.Quaternion[] rotationSamples
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::Quaternion> rotationSamples;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Quaternion>) == 0x8);
    // public System.Single[] velocitySamples
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<float> velocitySamples;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Int32[] waypointSamples
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<int> waypointSamples;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Single[] samplesDistances
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<float> samplesDistances;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // public System.Single totalDistance
    // Size: 0x4
    // Offset: 0xA8
    float totalDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean updateTransform
    // Size: 0x1
    // Offset: 0xAC
    bool updateTransform;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: updateTransform and: lastVelocity
    char __padding23[0x3] = {};
    // private System.Single _lastVelocity
    // Size: 0x4
    // Offset: 0xB0
    float lastVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Color pathColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_pathColor();
    // Get instance field reference: public Jacovone.Waypoint[] waypoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::Jacovone::Waypoint*>& dyn_waypoints();
    // Get instance field reference: public UnityEngine.Transform target
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_target();
    // Get instance field reference: public System.Boolean disableOrientation
    [[deprecated("Use field access instead!")]] bool& dyn_disableOrientation();
    // Get instance field reference: public UnityEngine.Transform globalLookAt
