// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Nitro.Void
#include "Nitro/Void.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: AttributeLookup
  class AttributeLookup;
  // Forward declaring type: Element
  class Element;
  // Forward declaring type: Window
  class Window;
  // Forward declaring type: FilePath
  class FilePath;
  // Forward declaring type: Renderman
  class Renderman;
  // Forward declaring type: UICode
  class UICode;
  // Forward declaring type: OnSizeChange
  class OnSizeChange;
  // Forward declaring type: InputEvent
  class InputEvent;
  // Forward declaring type: TitleChange
  class TitleChange;
  // Forward declaring type: DynamicFont
  class DynamicFont;
  // Forward declaring type: UIEvent
  class UIEvent;
  // Forward declaring type: DocumentElements
  class DocumentElements;
}
// Forward declaring namespace: PowerUI::Css
namespace PowerUI::Css {
  // Forward declaring type: StyleSheet
  class StyleSheet;
  // Forward declaring type: SelectorStyle
  class SelectorStyle;
}
// Forward declaring namespace: Nitro
namespace Nitro {
  // Forward declaring type: DynamicMethod`1<T>
  template<typename T>
  class DynamicMethod_1;
  // Forward declaring type: NitroDomainManager
  class NitroDomainManager;
}
// Completed forward declares
// Type namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Document
  class Document;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::Document);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::Document*, "PowerUI", "Document");
// Type namespace: PowerUI
namespace PowerUI {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.Document
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: AD1310
  class Document : public ::Il2CppObject {
    public:
    public:
    // public System.Collections.Generic.Dictionary`2<System.String,PowerUI.AttributeLookup> AttributeIndex
    // Size: 0x8
    // Offset: 0x10
    ::System::Collections::Generic::Dictionary_2<::StringW, ::PowerUI::AttributeLookup*>* AttributeIndex;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::PowerUI::AttributeLookup*>*) == 0x8);
    // public PowerUI.Element html
    // Size: 0x8
    // Offset: 0x18
    ::PowerUI::Element* html;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // public PowerUI.Element body
    // Size: 0x8
    // Offset: 0x20
    ::PowerUI::Element* body;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // public PowerUI.Window window
    // Size: 0x8
    // Offset: 0x28
    ::PowerUI::Window* window;
    // Field size check
    static_assert(sizeof(::PowerUI::Window*) == 0x8);
    // public PowerUI.FilePath location
    // Size: 0x8
    // Offset: 0x30
    ::PowerUI::FilePath* location;
    // Field size check
    static_assert(sizeof(::PowerUI::FilePath*) == 0x8);
    // public System.Boolean AotDocument
    // Size: 0x1
    // Offset: 0x38
    bool AotDocument;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AotDocument and: Renderer
    char __padding5[0x7] = {};
    // public PowerUI.Renderman Renderer
    // Size: 0x8
    // Offset: 0x40
    ::PowerUI::Renderman* Renderer;
    // Field size check
    static_assert(sizeof(::PowerUI::Renderman*) == 0x8);
    // public System.String[] CodeBuffer
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::StringW> CodeBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public PowerUI.UICode CodeInstance
    // Size: 0x8
    // Offset: 0x50
    ::PowerUI::UICode* CodeInstance;
    // Field size check
    static_assert(sizeof(::PowerUI::UICode*) == 0x8);
    // public PowerUI.Element DropdownBox
    // Size: 0x8
    // Offset: 0x58
    ::PowerUI::Element* DropdownBox;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // public System.String[] StyleBuffer
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::StringW> StyleBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.Boolean FinishedParsing
    // Size: 0x1
    // Offset: 0x68
    bool FinishedParsing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: FinishedParsing and: Style
    char __padding11[0x7] = {};
    // public PowerUI.Css.StyleSheet Style
    // Size: 0x8
    // Offset: 0x70
    ::PowerUI::Css::StyleSheet* Style;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::StyleSheet*) == 0x8);
    // private System.String CurrentTitle
    // Size: 0x8
    // Offset: 0x78
    ::StringW CurrentTitle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ScriptLocation
    // Size: 0x8
    // Offset: 0x80
    ::StringW ScriptLocation;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public PowerUI.OnSizeChange OnResized
    // Size: 0x8
    // Offset: 0x88
    ::PowerUI::OnSizeChange* OnResized;
    // Field size check
    static_assert(sizeof(::PowerUI::OnSizeChange*) == 0x8);
    // private System.String CurrentTooltip
    // Size: 0x8
    // Offset: 0x90
    ::StringW CurrentTooltip;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED04
    // private PowerUI.InputEvent KeyUp
    // Size: 0x8
    // Offset: 0x98
    ::PowerUI::InputEvent* KeyUp;
    // Field size check
    static_assert(sizeof(::PowerUI::InputEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED14
    // private PowerUI.InputEvent KeyDown
    // Size: 0x8
    // Offset: 0xA0
    ::PowerUI::InputEvent* KeyDown;
    // Field size check
    static_assert(sizeof(::PowerUI::InputEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED24
    // private PowerUI.InputEvent MouseMove
    // Size: 0x8
    // Offset: 0xA8
    ::PowerUI::InputEvent* MouseMove;
    // Field size check
    static_assert(sizeof(::PowerUI::InputEvent*) == 0x8);
    // public PowerUI.TitleChange OnTitleChange
    // Size: 0x8
    // Offset: 0xB0
    ::PowerUI::TitleChange* OnTitleChange;
    // Field size check
    static_assert(sizeof(::PowerUI::TitleChange*) == 0x8);
    // public PowerUI.TitleChange OnTooltipChange
    // Size: 0x8
    // Offset: 0xB8
    ::PowerUI::TitleChange* OnTooltipChange;
    // Field size check
    static_assert(sizeof(::PowerUI::TitleChange*) == 0x8);
    // public Nitro.DynamicMethod`1<Nitro.Void> onkeyup
    // Size: 0x8
    // Offset: 0xC0
    ::Nitro::DynamicMethod_1<::Nitro::Void>* onkeyup;
    // Field size check
    static_assert(sizeof(::Nitro::DynamicMethod_1<::Nitro::Void>*) == 0x8);
    // public Nitro.DynamicMethod`1<Nitro.Void> onresize
    // Size: 0x8
    // Offset: 0xC8
    ::Nitro::DynamicMethod_1<::Nitro::Void>* onresize;
    // Field size check
    static_assert(sizeof(::Nitro::DynamicMethod_1<::Nitro::Void>*) == 0x8);
    // public Nitro.DynamicMethod`1<Nitro.Void> onkeydown
    // Size: 0x8
    // Offset: 0xD0
    ::Nitro::DynamicMethod_1<::Nitro::Void>* onkeydown;
    // Field size check
    static_assert(sizeof(::Nitro::DynamicMethod_1<::Nitro::Void>*) == 0x8);
    // public Nitro.DynamicMethod`1<Nitro.Void> onmousemove
    // Size: 0x8
    // Offset: 0xD8
    ::Nitro::DynamicMethod_1<::Nitro::Void>* onmousemove;
    // Field size check
    static_assert(sizeof(::Nitro::DynamicMethod_1<::Nitro::Void>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,PowerUI.DynamicFont> ActiveFonts
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::Dictionary_2<::StringW, ::PowerUI::DynamicFont*>* ActiveFonts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::PowerUI::DynamicFont*>*) == 0x8);
    // private Nitro.NitroDomainManager SecurityDomain
    // Size: 0x8
    // Offset: 0xE8
    ::Nitro::NitroDomainManager* SecurityDomain;
    // Field size check
    static_assert(sizeof(::Nitro::NitroDomainManager*) == 0x8);
    public:
    // Get static field: static public PowerUI.Css.StyleSheet DefaultStyleSheet
    static ::PowerUI::Css::StyleSheet* _get_DefaultStyleSheet();
    // Set static field: static public PowerUI.Css.StyleSheet DefaultStyleSheet
    static void _set_DefaultStyleSheet(::PowerUI::Css::StyleSheet* value);
    // Get instance field reference: public System.Collections.Generic.Dictionary`2<System.String,PowerUI.AttributeLookup> AttributeIndex
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Dictionary_2<::StringW, ::PowerUI::AttributeLookup*>*& dyn_AttributeIndex();
    // Get instance field reference: public PowerUI.Element html
    [[deprecated("Use field access instead!")]] ::PowerUI::Element*& dyn_html();
    // Get instance field reference: public PowerUI.Element body
