// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Wrench.MLElement
#include "Wrench/MLElement.hpp"
// Including type: PowerUI.MouseOverState
#include "PowerUI/MouseOverState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Document
  class Document;
  // Forward declaring type: HtmlTagHandler
  class HtmlTagHandler;
  // Forward declaring type: InputTag
  class InputTag;
  // Forward declaring type: OnDomEvent
  class OnDomEvent;
  // Forward declaring type: AttributeLookup
  class AttributeLookup;
  // Forward declaring type: UIEvent
  class UIEvent;
  // Forward declaring type: UIAnimation
  class UIAnimation;
  // Forward declaring type: DynamicFont
  class DynamicFont;
  // Forward declaring type: Text3D
  class Text3D;
  // Forward declaring type: CanvasContext
  class CanvasContext;
  // Forward declaring type: FormTag
  class FormTag;
}
// Forward declaring namespace: PowerUI::Css
namespace PowerUI::Css {
  // Forward declaring type: ElementStyle
  class ElementStyle;
  // Forward declaring type: SelectorType
  struct SelectorType;
  // Forward declaring type: ComputedStyle
  class ComputedStyle;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Wrench
namespace Wrench {
  // Forward declaring type: MLLexer
  class MLLexer;
  // Forward declaring type: TagHandler
  class TagHandler;
  // Forward declaring type: MLVariableElement
  class MLVariableElement;
  // Forward declaring type: MLTextElement
  class MLTextElement;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Element
  class Element;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::Element);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::Element*, "PowerUI", "Element");
// Type namespace: PowerUI
namespace PowerUI {
  // Size: 0xF0
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.Element
  // [TokenAttribute] Offset: FFFFFFFF
  class Element : public ::Wrench::MLElement {
    public:
    public:
    // public System.Object Data
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* Data;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // public System.Boolean HScrollbar
    // Size: 0x1
    // Offset: 0x30
    bool HScrollbar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean VScrollbar
    // Size: 0x1
    // Offset: 0x31
    bool VScrollbar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: VScrollbar and: Document
    char __padding2[0x6] = {};
    // public PowerUI.Document Document
    // Size: 0x8
    // Offset: 0x38
    ::PowerUI::Document* Document;
    // Field size check
    static_assert(sizeof(::PowerUI::Document*) == 0x8);
    // public PowerUI.Element ParentNode
    // Size: 0x8
    // Offset: 0x40
    ::PowerUI::Element* ParentNode;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // public PowerUI.Css.ElementStyle Style
    // Size: 0x8
    // Offset: 0x48
    ::PowerUI::Css::ElementStyle* Style;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ElementStyle*) == 0x8);
    // public PowerUI.HtmlTagHandler Handler
    // Size: 0x8
    // Offset: 0x50
    ::PowerUI::HtmlTagHandler* Handler;
    // Field size check
    static_assert(sizeof(::PowerUI::HtmlTagHandler*) == 0x8);
    // public PowerUI.MouseOverState MousedOver
    // Size: 0x4
    // Offset: 0x58
    ::PowerUI::MouseOverState MousedOver;
    // Field size check
    static_assert(sizeof(::PowerUI::MouseOverState) == 0x4);
    // Padding between fields: MousedOver and: VerticalScrollbar
    char __padding7[0x4] = {};
    // public PowerUI.InputTag VerticalScrollbar
    // Size: 0x8
    // Offset: 0x60
    ::PowerUI::InputTag* VerticalScrollbar;
    // Field size check
    static_assert(sizeof(::PowerUI::InputTag*) == 0x8);
    // protected System.Collections.Generic.List`1<PowerUI.Element> ChildNodes
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::PowerUI::Element*>* ChildNodes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PowerUI::Element*>*) == 0x8);
    // public PowerUI.InputTag HorizontalScrollbar
    // Size: 0x8
    // Offset: 0x70
    ::PowerUI::InputTag* HorizontalScrollbar;
    // Field size check
    static_assert(sizeof(::PowerUI::InputTag*) == 0x8);
    // public System.Collections.Generic.List`1<PowerUI.Element> KidsToRender
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::PowerUI::Element*>* KidsToRender;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PowerUI::Element*>*) == 0x8);
    // public System.Boolean IsRebuildingChildren
    // Size: 0x1
    // Offset: 0x80
    bool IsRebuildingChildren;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsRebuildingChildren and: OnKeyUp
    char __padding12[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xADED34
    // private PowerUI.OnDomEvent OnKeyUp
    // Size: 0x8
    // Offset: 0x88
    ::PowerUI::OnDomEvent* OnKeyUp;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED44
    // private PowerUI.OnDomEvent OnKeyDown
    // Size: 0x8
    // Offset: 0x90
    ::PowerUI::OnDomEvent* OnKeyDown;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED54
    // private PowerUI.OnDomEvent OnMouseUp
    // Size: 0x8
    // Offset: 0x98
    ::PowerUI::OnDomEvent* OnMouseUp;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED64
    // private PowerUI.OnDomEvent OnMouseOut
    // Size: 0x8
    // Offset: 0xA0
    ::PowerUI::OnDomEvent* OnMouseOut;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED74
    // private PowerUI.OnDomEvent OnMouseDown
    // Size: 0x8
    // Offset: 0xA8
    ::PowerUI::OnDomEvent* OnMouseDown;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED84
    // private PowerUI.OnDomEvent OnMouseMove
    // Size: 0x8
    // Offset: 0xB0
    ::PowerUI::OnDomEvent* OnMouseMove;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADED94
    // private PowerUI.OnDomEvent OnMouseOver
    // Size: 0x8
    // Offset: 0xB8
    ::PowerUI::OnDomEvent* OnMouseOver;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADEDA4
    // private PowerUI.OnDomEvent OnLoadedEvent
    // Size: 0x8
    // Offset: 0xC0
    ::PowerUI::OnDomEvent* OnLoadedEvent;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADEDB4
    // private PowerUI.OnDomEvent OnFocus
    // Size: 0x8
    // Offset: 0xC8
    ::PowerUI::OnDomEvent* OnFocus;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADEDC4
    // private PowerUI.OnDomEvent OnBlur
    // Size: 0x8
    // Offset: 0xD0
    ::PowerUI::OnDomEvent* OnBlur;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADEDD4
    // private PowerUI.OnDomEvent OnClick
    // Size: 0x8
    // Offset: 0xD8
    ::PowerUI::OnDomEvent* OnClick;
    // Field size check
    static_assert(sizeof(::PowerUI::OnDomEvent*) == 0x8);
    // public PowerUI.Element VirtualAfter
    // Size: 0x8
    // Offset: 0xE0
    ::PowerUI::Element* VirtualAfter;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // public PowerUI.Element VirtualBefore
    // Size: 0x8
    // Offset: 0xE8
    ::PowerUI::Element* VirtualBefore;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    public:
    // Get instance field reference: public System.Object Data
    [[deprecated("Use field access instead!")]] ::Il2CppObject*& dyn_Data();
    // Get instance field reference: public System.Boolean HScrollbar
    [[deprecated("Use field access instead!")]] bool& dyn_HScrollbar();
    // Get instance field reference: public System.Boolean VScrollbar
    [[deprecated("Use field access instead!")]] bool& dyn_VScrollbar();
    // Get instance field reference: public PowerUI.Document Document
    [[deprecated("Use field access instead!")]] ::PowerUI::Document*& dyn_Document();
    // Get instance field reference: public PowerUI.Element ParentNode
    [[deprecated("Use field access instead!")]] ::PowerUI::Element*& dyn_ParentNode();
    // Get instance field reference: public PowerUI.Css.ElementStyle Style
