// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.FilterMode
#include "UnityEngine/FilterMode.hpp"
// Including type: PowerUI.RenderMode
#include "PowerUI/RenderMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: TransformationStack
  class TransformationStack;
  // Forward declaring type: UIBatch
  class UIBatch;
  // Forward declaring type: BoxRegion
  class BoxRegion;
  // Forward declaring type: Document
  class Document;
  // Forward declaring type: WorldUI
  class WorldUI;
  // Forward declaring type: InputMode
  struct InputMode;
  // Forward declaring type: Element
  class Element;
}
// Forward declaring namespace: PowerUI::Css
namespace PowerUI::Css {
  // Forward declaring type: ComputedStyle
  class ComputedStyle;
  // Forward declaring type: ElementStyle
  class ElementStyle;
  // Forward declaring type: DisplayableProperty
  class DisplayableProperty;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Vector3
  struct Vector3;
}
// Forward declaring namespace: Blaze
namespace Blaze {
  // Forward declaring type: TextureAtlas
  class TextureAtlas;
}
// Completed forward declares
// Type namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Renderman
  class Renderman;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::Renderman);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::Renderman*, "PowerUI", "Renderman");
// Type namespace: PowerUI
namespace PowerUI {
  // Size: 0xF4
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.Renderman
  // [TokenAttribute] Offset: FFFFFFFF
  class Renderman : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 PenX
    // Size: 0x4
    // Offset: 0x10
    int PenX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PenY
    // Size: 0x4
    // Offset: 0x14
    int PenY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 LineHeight
    // Size: 0x4
    // Offset: 0x18
    int LineHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single Depth
    // Size: 0x4
    // Offset: 0x1C
    float Depth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single MaxDepth
    // Size: 0x4
    // Offset: 0x20
    float MaxDepth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean DepthUsed
    // Size: 0x1
    // Offset: 0x24
    bool DepthUsed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DepthUsed and: Transformations
    char __padding5[0x3] = {};
    // public PowerUI.TransformationStack Transformations
    // Size: 0x8
    // Offset: 0x28
    ::PowerUI::TransformationStack* Transformations;
    // Field size check
    static_assert(sizeof(::PowerUI::TransformationStack*) == 0x8);
    // public PowerUI.Css.ComputedStyle LastOnLine
    // Size: 0x8
    // Offset: 0x30
    ::PowerUI::Css::ComputedStyle* LastOnLine;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ComputedStyle*) == 0x8);
    // public PowerUI.Css.ComputedStyle FirstOnLine
    // Size: 0x8
    // Offset: 0x38
    ::PowerUI::Css::ComputedStyle* FirstOnLine;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ComputedStyle*) == 0x8);
    // public System.Boolean GoingLeftwards
    // Size: 0x1
    // Offset: 0x40
    bool GoingLeftwards;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GoingLeftwards and: CurrentBatch
    char __padding9[0x7] = {};
    // public PowerUI.UIBatch CurrentBatch
    // Size: 0x8
    // Offset: 0x48
    ::PowerUI::UIBatch* CurrentBatch;
    // Field size check
    static_assert(sizeof(::PowerUI::UIBatch*) == 0x8);
    // public PowerUI.Css.ComputedStyle LastPacked
    // Size: 0x8
    // Offset: 0x50
    ::PowerUI::Css::ComputedStyle* LastPacked;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ComputedStyle*) == 0x8);
    // public PowerUI.Css.ComputedStyle FirstPacked
    // Size: 0x8
    // Offset: 0x58
    ::PowerUI::Css::ComputedStyle* FirstPacked;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ComputedStyle*) == 0x8);
    // public PowerUI.BoxRegion ClippingBoundary
    // Size: 0x8
    // Offset: 0x60
    ::PowerUI::BoxRegion* ClippingBoundary;
    // Field size check
    static_assert(sizeof(::PowerUI::BoxRegion*) == 0x8);
    // public System.Int32 BatchDepth
    // Size: 0x4
    // Offset: 0x68
    int BatchDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 LineStart
    // Size: 0x4
    // Offset: 0x6C
    int LineStart;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.List`1<PowerUI.Css.ComputedStyle> ActiveFloats
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::PowerUI::Css::ComputedStyle*>* ActiveFloats;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PowerUI::Css::ComputedStyle*>*) == 0x8);
    // public System.Int32 MaxX
    // Size: 0x4
    // Offset: 0x78
    int MaxX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 Baseline
    // Size: 0x4
    // Offset: 0x7C
    int Baseline;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 LargestLineWidth
    // Size: 0x4
    // Offset: 0x80
    int LargestLineWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single FontAliasingTop
    // Size: 0x4
    // Offset: 0x84
    float FontAliasingTop;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single FontAliasingBottom
    // Size: 0x4
    // Offset: 0x88
    float FontAliasingBottom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 RenderLayer
    // Size: 0x4
    // Offset: 0x8C
    int RenderLayer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean LayoutOccuring
    // Size: 0x1
    // Offset: 0x90
    bool LayoutOccuring;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LayoutOccuring and: LastBatch
    char __padding23[0x7] = {};
    // public PowerUI.UIBatch LastBatch
    // Size: 0x8
    // Offset: 0x98
    ::PowerUI::UIBatch* LastBatch;
    // Field size check
    static_assert(sizeof(::PowerUI::UIBatch*) == 0x8);
    // public PowerUI.UIBatch FirstBatch
    // Size: 0x8
    // Offset: 0xA0
    ::PowerUI::UIBatch* FirstBatch;
    // Field size check
    static_assert(sizeof(::PowerUI::UIBatch*) == 0x8);
    // public PowerUI.Document RootDocument
    // Size: 0x8
    // Offset: 0xA8
    ::PowerUI::Document* RootDocument;
    // Field size check
    static_assert(sizeof(::PowerUI::Document*) == 0x8);
    // public System.Single DepthResolution
    // Size: 0x4
    // Offset: 0xB0
    float DepthResolution;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean DoLayout
    // Size: 0x1
    // Offset: 0xB4
    bool DoLayout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DoLayout and: CustomShader
    char __padding28[0x3] = {};
    // public UnityEngine.Shader CustomShader
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Shader* CustomShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // public PowerUI.Css.ElementStyle StylesToPaint
    // Size: 0x8
    // Offset: 0xC0
    ::PowerUI::Css::ElementStyle* StylesToPaint;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ElementStyle*) == 0x8);
    // public PowerUI.Css.ElementStyle StylesToRecompute
    // Size: 0x8
    // Offset: 0xC8
    ::PowerUI::Css::ElementStyle* StylesToRecompute;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ElementStyle*) == 0x8);
    // public UnityEngine.GameObject Node
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::GameObject* Node;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean ScreenClip
    // Size: 0x1
    // Offset: 0xD8
    bool ScreenClip;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ScreenClip and: InWorldUI
    char __padding33[0x7] = {};
    // public PowerUI.WorldUI InWorldUI
    // Size: 0x8
    // Offset: 0xE0
    ::PowerUI::WorldUI* InWorldUI;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // public UnityEngine.Transform PhysicsModeCollider
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Transform* PhysicsModeCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.FilterMode ImageFilterMode
    // Size: 0x4
    // Offset: 0xF0
    ::UnityEngine::FilterMode ImageFilterMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::FilterMode) == 0x4);
    public:
    // Get static field: static private PowerUI.RenderMode UIRenderMode
    static ::PowerUI::RenderMode _get_UIRenderMode();
    // Set static field: static private PowerUI.RenderMode UIRenderMode
    static void _set_UIRenderMode(::PowerUI::RenderMode value);
    // Get instance field reference: public System.Int32 PenX
    [[deprecated("Use field access instead!")]] int& dyn_PenX();
    // Get instance field reference: public System.Int32 PenY
    [[deprecated("Use field access instead!")]] int& dyn_PenY();
    // Get instance field reference: public System.Int32 LineHeight
    [[deprecated("Use field access instead!")]] int& dyn_LineHeight();
    // Get instance field reference: public System.Single Depth
    [[deprecated("Use field access instead!")]] float& dyn_Depth();
