// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PowerUI.HtmlTagHandler
#include "PowerUI/HtmlTagHandler.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: TextPackage
  class TextPackage;
}
// Forward declaring namespace: Wrench
namespace Wrench {
  // Forward declaring type: MLLexer
  class MLLexer;
}
// Completed forward declares
// Type namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: ScriptTag
  class ScriptTag;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::ScriptTag);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::ScriptTag*, "PowerUI", "ScriptTag");
// Type namespace: PowerUI
namespace PowerUI {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.ScriptTag
  // [TokenAttribute] Offset: FFFFFFFF
  class ScriptTag : public ::PowerUI::HtmlTagHandler {
    public:
    public:
    // public System.Boolean Dump
    // Size: 0x1
    // Offset: 0x33
    bool Dump;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Dump and: Src
    char __padding0[0x4] = {};
    // public System.String Src
    // Size: 0x8
    // Offset: 0x38
    ::StringW Src;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean Loaded
    // Size: 0x1
    // Offset: 0x40
    bool Loaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Loaded and: CodeIndex
    char __padding2[0x3] = {};
    // public System.Int32 CodeIndex
    // Size: 0x4
    // Offset: 0x44
    int CodeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Boolean Dump
    [[deprecated("Use field access instead!")]] bool& dyn_Dump();
    // Get instance field reference: public System.String Src
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Src();
    // Get instance field reference: public System.Boolean Loaded
    [[deprecated("Use field access instead!")]] bool& dyn_Loaded();
    // Get instance field reference: public System.Int32 CodeIndex
    [[deprecated("Use field access instead!")]] int& dyn_CodeIndex();
    // private System.Void LoadContent()
    // Offset: 0x17724D0
    void LoadContent();
    // private System.Void OnTextReady(PowerUI.TextPackage package)
    // Offset: 0x1772614
    void OnTextReady(::PowerUI::TextPackage* package);
    // private System.Boolean AtEnd(Wrench.MLLexer lexer)
    // Offset: 0x17722B0
    bool AtEnd(::Wrench::MLLexer* lexer);
    // public override System.String[] GetTags()
    // Offset: 0x1771ED0
    // Implemented from: Wrench.TagHandler
    // Base method: System.String[] TagHandler::GetTags()
    ::ArrayW<::StringW> GetTags();
    // public override Wrench.TagHandler GetInstance()
    // Offset: 0x1771FD4
    // Implemented from: Wrench.TagHandler
    // Base method: Wrench.TagHandler TagHandler::GetInstance()
    ::Wrench::TagHandler* GetInstance();
    // public override System.Void OnParseContent(Wrench.MLLexer lexer)
    // Offset: 0x1772048
    // Implemented from: Wrench.TagHandler
    // Base method: System.Void TagHandler::OnParseContent(Wrench.MLLexer lexer)
    void OnParseContent(::Wrench::MLLexer* lexer);
    // public override System.Boolean OnAttributeChange(System.String property)
    // Offset: 0x1772398
    // Implemented from: PowerUI.HtmlTagHandler
    // Base method: System.Boolean HtmlTagHandler::OnAttributeChange(System.String property)
    bool OnAttributeChange(::StringW property);
    // public override System.Void OnTagLoaded()
    // Offset: 0x1772754
    // Implemented from: Wrench.TagHandler
    // Base method: System.Void TagHandler::OnTagLoaded()
    void OnTagLoaded();
    // public System.Void .ctor()
    // Offset: 0x1772038
    // Implemented from: PowerUI.HtmlTagHandler
    // Base method: System.Void HtmlTagHandler::.ctor()
    // Base method: System.Void TagHandler::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ScriptTag* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::PowerUI::ScriptTag::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ScriptTag*, creationType>()));
    }
  }; // PowerUI.ScriptTag
  #pragma pack(pop)
  static check_size<sizeof(ScriptTag), 68 + sizeof(int)> __PowerUI_ScriptTagSizeCheck;
  static_assert(sizeof(ScriptTag) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: PowerUI::ScriptTag::LoadContent
// Il2CppName: LoadContent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (PowerUI::ScriptTag::*)()>(&PowerUI::ScriptTag::LoadContent)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "LoadContent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::OnTextReady
// Il2CppName: OnTextReady
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (PowerUI::ScriptTag::*)(::PowerUI::TextPackage*)>(&PowerUI::ScriptTag::OnTextReady)> {
  static const MethodInfo* get() {
    static auto* package = &::il2cpp_utils::GetClassFromName("PowerUI", "TextPackage")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "OnTextReady", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{package});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::AtEnd
// Il2CppName: AtEnd
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (PowerUI::ScriptTag::*)(::Wrench::MLLexer*)>(&PowerUI::ScriptTag::AtEnd)> {
  static const MethodInfo* get() {
    static auto* lexer = &::il2cpp_utils::GetClassFromName("Wrench", "MLLexer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "AtEnd", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{lexer});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::GetTags
// Il2CppName: GetTags
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::ArrayW<::StringW> (PowerUI::ScriptTag::*)()>(&PowerUI::ScriptTag::GetTags)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "GetTags", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::GetInstance
// Il2CppName: GetInstance
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Wrench::TagHandler* (PowerUI::ScriptTag::*)()>(&PowerUI::ScriptTag::GetInstance)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "GetInstance", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::OnParseContent
// Il2CppName: OnParseContent
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (PowerUI::ScriptTag::*)(::Wrench::MLLexer*)>(&PowerUI::ScriptTag::OnParseContent)> {
  static const MethodInfo* get() {
    static auto* lexer = &::il2cpp_utils::GetClassFromName("Wrench", "MLLexer")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "OnParseContent", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{lexer});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::OnAttributeChange
// Il2CppName: OnAttributeChange
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (PowerUI::ScriptTag::*)(::StringW)>(&PowerUI::ScriptTag::OnAttributeChange)> {
  static const MethodInfo* get() {
    static auto* property = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "OnAttributeChange", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{property});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::OnTagLoaded
// Il2CppName: OnTagLoaded
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (PowerUI::ScriptTag::*)()>(&PowerUI::ScriptTag::OnTagLoaded)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(PowerUI::ScriptTag*), "OnTagLoaded", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: PowerUI::ScriptTag::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
