// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Document
  class Document;
  // Forward declaring type: Renderman
  class Renderman;
  // Forward declaring type: WorldUIExpiryEvent
  class WorldUIExpiryEvent;
  // Forward declaring type: RenderMode
  struct RenderMode;
  // Forward declaring type: InputMode
  struct InputMode;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: FilterMode
  struct FilterMode;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: WorldUI
  class WorldUI;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::WorldUI);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::WorldUI*, "PowerUI", "WorldUI");
// Type namespace: PowerUI
namespace PowerUI {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.WorldUI
  // [TokenAttribute] Offset: FFFFFFFF
  class WorldUI : public ::Il2CppObject {
    public:
    public:
    // public System.Boolean Flat
    // Size: 0x1
    // Offset: 0x10
    bool Flat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Flat and: Ratio
    char __padding0[0x3] = {};
    // public System.Single Ratio
    // Size: 0x4
    // Offset: 0x14
    float Ratio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 pixelWidth
    // Size: 0x4
    // Offset: 0x18
    int pixelWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 pixelHeight
    // Size: 0x4
    // Offset: 0x1C
    int pixelHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public PowerUI.Document document
    // Size: 0x8
    // Offset: 0x20
    ::PowerUI::Document* document;
    // Field size check
    static_assert(sizeof(::PowerUI::Document*) == 0x8);
    // public UnityEngine.Transform transform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* transform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject gameObject
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* gameObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String Name
    // Size: 0x8
    // Offset: 0x38
    ::StringW Name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean Expires
    // Size: 0x1
    // Offset: 0x40
    bool Expires;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Expires and: ExpiresIn
    char __padding8[0x3] = {};
    // public System.Single ExpiresIn
    // Size: 0x4
    // Offset: 0x44
    float ExpiresIn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public PowerUI.WorldUI UIAfter
    // Size: 0x8
    // Offset: 0x48
    ::PowerUI::WorldUI* UIAfter;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // public PowerUI.WorldUI UIBefore
    // Size: 0x8
    // Offset: 0x50
    ::PowerUI::WorldUI* UIBefore;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // public System.Single PixelHeightF
    // Size: 0x4
    // Offset: 0x58
    float PixelHeightF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: PixelHeightF and: Renderer
    char __padding12[0x4] = {};
    // public PowerUI.Renderman Renderer
    // Size: 0x8
    // Offset: 0x60
    ::PowerUI::Renderman* Renderer;
    // Field size check
    static_assert(sizeof(::PowerUI::Renderman*) == 0x8);
    // public UnityEngine.Camera CameraToFace
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Camera* CameraToFace;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private System.Boolean IsPixelPerfect
    // Size: 0x1
    // Offset: 0x70
    bool IsPixelPerfect;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AlwaysFaceCamera
    // Size: 0x1
    // Offset: 0x71
    bool AlwaysFaceCamera;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AlwaysFaceCamera and: OnExpire
    char __padding16[0x6] = {};
    // public PowerUI.WorldUIExpiryEvent OnExpire
    // Size: 0x8
    // Offset: 0x78
    ::PowerUI::WorldUIExpiryEvent* OnExpire;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUIExpiryEvent*) == 0x8);
    // private System.Single ScreenSpaceProportion
    // Size: 0x4
    // Offset: 0x80
    float ScreenSpaceProportion;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 WorldScreenOrigin
    // Size: 0x8
    // Offset: 0x84
    ::UnityEngine::Vector2 WorldScreenOrigin;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public UnityEngine.Vector2 OriginLocation
    // Size: 0x8
    // Offset: 0x8C
    ::UnityEngine::Vector2 OriginLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // [ObsoleteAttribute] Offset: 0xADEE6C
    // public System.Int32 AtlasSize
    // Size: 0x4
    // Offset: 0x94
    int AtlasSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get static field: static public System.Collections.Generic.Dictionary`2<UnityEngine.Transform,PowerUI.WorldUI> PhysicsLookup
    static ::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::PowerUI::WorldUI*>* _get_PhysicsLookup();
    // Set static field: static public System.Collections.Generic.Dictionary`2<UnityEngine.Transform,PowerUI.WorldUI> PhysicsLookup
    static void _set_PhysicsLookup(::System::Collections::Generic::Dictionary_2<::UnityEngine::Transform*, ::PowerUI::WorldUI*>* value);
    // Get static field: static public System.Boolean LiveUpdatablesAvailable
    static bool _get_LiveUpdatablesAvailable();
    // Set static field: static public System.Boolean LiveUpdatablesAvailable
    static void _set_LiveUpdatablesAvailable(bool value);
    // Get instance field reference: public System.Boolean Flat
