// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: NavMeshGraph
  class NavMeshGraph;
  // Forward declaring type: GridGraph
  class GridGraph;
  // Forward declaring type: PointGraph
  class PointGraph;
  // Forward declaring type: NavGraph
  class NavGraph;
  // Forward declaring type: GraphNode
  class GraphNode;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Type
  class Type;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: TextAsset
  class TextAsset;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AstarPath
  class AstarPath;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: SerializeSettings
  class SerializeSettings;
  // Forward declaring type: AstarSerializer
  class AstarSerializer;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerable
  class IEnumerable;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: AstarData
  class AstarData;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::AstarData);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::AstarData*, "Pathfinding", "AstarData");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.AstarData
  // [TokenAttribute] Offset: FFFFFFFF
  class AstarData : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::AstarData::$$c__DisplayClass43_0
    class $$c__DisplayClass43_0;
    // Nested type: ::Pathfinding::AstarData::$FindGraphsOfType$d__54
    class $FindGraphsOfType$d__54;
    // Nested type: ::Pathfinding::AstarData::$GetUpdateableGraphs$d__55
    class $GetUpdateableGraphs$d__55;
    // Nested type: ::Pathfinding::AstarData::$GetRaycastableGraphs$d__56
    class $GetRaycastableGraphs$d__56;
    public:
    // [CompilerGeneratedAttribute] Offset: 0xAE59B0
    // private Pathfinding.NavMeshGraph <navmesh>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::Pathfinding::NavMeshGraph* navmesh;
    // Field size check
    static_assert(sizeof(::Pathfinding::NavMeshGraph*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE59C0
    // private Pathfinding.GridGraph <gridGraph>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::GridGraph* gridGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::GridGraph*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE59D0
    // private Pathfinding.PointGraph <pointGraph>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::PointGraph* pointGraph;
    // Field size check
    static_assert(sizeof(::Pathfinding::PointGraph*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE59E0
    // private System.Type[] <graphTypes>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::System::Type*> graphTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Type*>) == 0x8);
    // public Pathfinding.NavGraph[] graphs
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::Pathfinding::NavGraph*> graphs;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::NavGraph*>) == 0x8);
    // private System.String dataString
    // Size: 0x8
    // Offset: 0x38
    ::StringW dataString;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xAE5A00
    // private System.Byte[] upgradeData
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<uint8_t> upgradeData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public System.Byte[] data_backup
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<uint8_t> data_backup;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public UnityEngine.TextAsset file_cachedStartup
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::TextAsset* file_cachedStartup;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public System.Byte[] data_cachedStartup
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<uint8_t> data_cachedStartup;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // public System.Boolean cacheStartup
    // Size: 0x1
    // Offset: 0x60
    bool cacheStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private Pathfinding.NavMeshGraph <navmesh>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::NavMeshGraph*& dyn_$navmesh$k__BackingField();
    // Get instance field reference: private Pathfinding.GridGraph <gridGraph>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::GridGraph*& dyn_$gridGraph$k__BackingField();
    // Get instance field reference: private Pathfinding.PointGraph <pointGraph>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::PointGraph*& dyn_$pointGraph$k__BackingField();
    // Get instance field reference: private System.Type[] <graphTypes>k__BackingField
    [[deprecated("Use field access instead!")]] ::ArrayW<::System::Type*>& dyn_$graphTypes$k__BackingField();
