// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.NavGraph
#include "Pathfinding/NavGraph.hpp"
// Including type: Pathfinding.IUpdatableGraph
#include "Pathfinding/IUpdatableGraph.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: Pathfinding.NumNeighbours
#include "Pathfinding/NumNeighbours.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GraphCollision
  class GraphCollision;
  // Forward declaring type: GridNode
  class GridNode;
  // Forward declaring type: Int3
  struct Int3;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: GraphUpdateShape
  class GraphUpdateShape;
  // Forward declaring type: GraphUpdateThreading
  struct GraphUpdateThreading;
  // Forward declaring type: GraphUpdateObject
  class GraphUpdateObject;
  // Forward declaring type: GraphNodeDelegateCancelable
  class GraphNodeDelegateCancelable;
  // Forward declaring type: NNInfo
  struct NNInfo;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: OnScanStatus
  class OnScanStatus;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Quaternion
  struct Quaternion;
  // Forward declaring type: Bounds
  struct Bounds;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AstarPath
  class AstarPath;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphSerializationContext
  class GraphSerializationContext;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GridGraph
  class GridGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::GridGraph);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::GridGraph*, "Pathfinding", "GridGraph");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x1B8
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.GridGraph
  // [TokenAttribute] Offset: FFFFFFFF
  // [JsonOptInAttribute] Offset: FFFFFFFF
  class GridGraph : public ::Pathfinding::NavGraph/*, public ::Pathfinding::IUpdatableGraph*/ {
    public:
    public:
    // public System.Int32 width
    // Size: 0x4
    // Offset: 0xC4
    int width;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 depth
    // Size: 0x4
    // Offset: 0xC8
    int depth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single aspectRatio
    // Size: 0x4
    // Offset: 0xCC
    float aspectRatio;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single isometricAngle
    // Size: 0x4
    // Offset: 0xD0
    float isometricAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean uniformEdgeCosts
    // Size: 0x1
    // Offset: 0xD4
    bool uniformEdgeCosts;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: uniformEdgeCosts and: rotation
    char __padding4[0x3] = {};
    // public UnityEngine.Vector3 rotation
    // Size: 0xC
    // Offset: 0xD8
    ::UnityEngine::Vector3 rotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 center
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 center;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector2 unclampedSize
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Vector2 unclampedSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Single nodeSize
    // Size: 0x4
    // Offset: 0xF8
    float nodeSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: nodeSize and: collision
    char __padding8[0x4] = {};
    // public Pathfinding.GraphCollision collision
    // Size: 0x8
    // Offset: 0x100
    ::Pathfinding::GraphCollision* collision;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphCollision*) == 0x8);
    // public System.Single maxClimb
    // Size: 0x4
    // Offset: 0x108
    float maxClimb;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 maxClimbAxis
    // Size: 0x4
    // Offset: 0x10C
    int maxClimbAxis;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single maxSlope
    // Size: 0x4
    // Offset: 0x110
    float maxSlope;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 erodeIterations
    // Size: 0x4
    // Offset: 0x114
    int erodeIterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean erosionUseTags
    // Size: 0x1
    // Offset: 0x118
    bool erosionUseTags;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: erosionUseTags and: erosionFirstTag
    char __padding14[0x3] = {};
    // public System.Int32 erosionFirstTag
    // Size: 0x4
    // Offset: 0x11C
    int erosionFirstTag;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean autoLinkGrids
    // Size: 0x1
    // Offset: 0x120
    bool autoLinkGrids;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoLinkGrids and: autoLinkDistLimit
    char __padding16[0x3] = {};
    // public System.Single autoLinkDistLimit
    // Size: 0x4
    // Offset: 0x124
    float autoLinkDistLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.NumNeighbours neighbours
    // Size: 0x4
    // Offset: 0x128
    ::Pathfinding::NumNeighbours neighbours;
    // Field size check
    static_assert(sizeof(::Pathfinding::NumNeighbours) == 0x4);
    // public System.Boolean cutCorners
    // Size: 0x1
    // Offset: 0x12C
    bool cutCorners;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cutCorners and: penaltyPositionOffset
    char __padding19[0x3] = {};
    // public System.Single penaltyPositionOffset
    // Size: 0x4
    // Offset: 0x130
    float penaltyPositionOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean penaltyPosition
    // Size: 0x1
    // Offset: 0x134
    bool penaltyPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: penaltyPosition and: penaltyPositionFactor
    char __padding21[0x3] = {};
    // public System.Single penaltyPositionFactor
    // Size: 0x4
    // Offset: 0x138
    float penaltyPositionFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean penaltyAngle
    // Size: 0x1
    // Offset: 0x13C
    bool penaltyAngle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: penaltyAngle and: penaltyAngleFactor
    char __padding23[0x3] = {};
    // public System.Single penaltyAngleFactor
    // Size: 0x4
    // Offset: 0x140
    float penaltyAngleFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single penaltyAnglePower
    // Size: 0x4
    // Offset: 0x144
    float penaltyAnglePower;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE5DB4
    // private UnityEngine.Vector2 <size>k__BackingField
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Vector2 size;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public readonly System.Int32[] neighbourOffsets
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<int> neighbourOffsets;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public readonly System.UInt32[] neighbourCosts
    // Size: 0x8
    // Offset: 0x158
    ::ArrayW<uint> neighbourCosts;
    // Field size check
    static_assert(sizeof(::ArrayW<uint>) == 0x8);
    // public readonly System.Int32[] neighbourXOffsets
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<int> neighbourXOffsets;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public readonly System.Int32[] neighbourZOffsets
    // Size: 0x8
    // Offset: 0x168
    ::ArrayW<int> neighbourZOffsets;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5DC4
    // private UnityEngine.Matrix4x4 <boundsMatrix>k__BackingField
    // Size: 0x40
    // Offset: 0x170
    ::UnityEngine::Matrix4x4 boundsMatrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // public Pathfinding.GridNode[] nodes
    // Size: 0x8
    // Offset: 0x1B0
    ::ArrayW<::Pathfinding::GridNode*> nodes;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::GridNode*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::Pathfinding::IUpdatableGraph
    operator ::Pathfinding::IUpdatableGraph() noexcept {
      return *reinterpret_cast<::Pathfinding::IUpdatableGraph*>(this);
    }
    // Get static field: static readonly System.Int32[] hexagonNeighbourIndices
    static ::ArrayW<int> _get_hexagonNeighbourIndices();
    // Set static field: static readonly System.Int32[] hexagonNeighbourIndices
    static void _set_hexagonNeighbourIndices(::ArrayW<int> value);
    // static field const value: static public System.Int32 getNearestForceOverlap
    static constexpr const int getNearestForceOverlap = 2;
    // Get static field: static public System.Int32 getNearestForceOverlap
    static int _get_getNearestForceOverlap();
