// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.NavMeshGraph
#include "Pathfinding/NavMeshGraph.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: NNConstraint
  class NNConstraint;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::NavMeshGraph::$$c__DisplayClass29_0);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::NavMeshGraph::$$c__DisplayClass29_0*, "Pathfinding", "NavMeshGraph/<>c__DisplayClass29_0");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x54
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.NavMeshGraph/<>c__DisplayClass29_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: AD834C
  class NavMeshGraph::$$c__DisplayClass29_0 : public ::Il2CppObject {
    public:
    public:
    // public System.Boolean accurateNearestNode
    // Size: 0x1
    // Offset: 0x10
    bool accurateNearestNode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: accurateNearestNode and: position
    char __padding0[0x3] = {};
    // public UnityEngine.Vector3 position
    // Size: 0xC
    // Offset: 0x14
    ::UnityEngine::Vector3 position;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public Pathfinding.Int3 pos
    // Size: 0xC
    // Offset: 0x20
    ::Pathfinding::Int3 pos;
    // Field size check
    static_assert(sizeof(::Pathfinding::Int3) == 0xC);
    // Padding between fields: pos and: minNode
    char __padding2[0x4] = {};
    // public Pathfinding.GraphNode minNode
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::GraphNode* minNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphNode*) == 0x8);
    // public System.Single minDist
    // Size: 0x4
    // Offset: 0x38
    float minDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxDistSqr
    // Size: 0x4
    // Offset: 0x3C
    float maxDistSqr;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.NNConstraint constraint
    // Size: 0x8
    // Offset: 0x40
    ::Pathfinding::NNConstraint* constraint;
    // Field size check
    static_assert(sizeof(::Pathfinding::NNConstraint*) == 0x8);
    // public Pathfinding.GraphNode minConstNode
    // Size: 0x8
    // Offset: 0x48
    ::Pathfinding::GraphNode* minConstNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphNode*) == 0x8);
    // public System.Single minConstDist
    // Size: 0x4
    // Offset: 0x50
    float minConstDist;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public System.Boolean accurateNearestNode
    [[deprecated("Use field access instead!")]] bool& dyn_accurateNearestNode();
    // Get instance field reference: public UnityEngine.Vector3 position
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_position();
    // Get instance field reference: public Pathfinding.Int3 pos
    [[deprecated("Use field access instead!")]] ::Pathfinding::Int3& dyn_pos();
    // Get instance field reference: public Pathfinding.GraphNode minNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::GraphNode*& dyn_minNode();
    // Get instance field reference: public System.Single minDist
    [[deprecated("Use field access instead!")]] float& dyn_minDist();
    // Get instance field reference: public System.Single maxDistSqr
    [[deprecated("Use field access instead!")]] float& dyn_maxDistSqr();
    // Get instance field reference: public Pathfinding.NNConstraint constraint
    [[deprecated("Use field access instead!")]] ::Pathfinding::NNConstraint*& dyn_constraint();
    // Get instance field reference: public Pathfinding.GraphNode minConstNode
    [[deprecated("Use field access instead!")]] ::Pathfinding::GraphNode*& dyn_minConstNode();
    // Get instance field reference: public System.Single minConstDist
    [[deprecated("Use field access instead!")]] float& dyn_minConstDist();
    // public System.Void .ctor()
    // Offset: 0x169F084
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NavMeshGraph::$$c__DisplayClass29_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::NavMeshGraph::$$c__DisplayClass29_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NavMeshGraph::$$c__DisplayClass29_0*, creationType>()));
    }
    // System.Boolean <GetNearestForceBoth>b__0(Pathfinding.GraphNode _node)
    // Offset: 0x169F08C
    bool $GetNearestForceBoth$b__0(::Pathfinding::GraphNode* _node);
  }; // Pathfinding.NavMeshGraph/<>c__DisplayClass29_0
  #pragma pack(pop)
  static check_size<sizeof(NavMeshGraph::$$c__DisplayClass29_0), 80 + sizeof(float)> __Pathfinding_NavMeshGraph_$$c__DisplayClass29_0SizeCheck;
  static_assert(sizeof(NavMeshGraph::$$c__DisplayClass29_0) == 0x54);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::NavMeshGraph::$$c__DisplayClass29_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: Pathfinding::NavMeshGraph::$$c__DisplayClass29_0::$GetNearestForceBoth$b__0
// Il2CppName: <GetNearestForceBoth>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Pathfinding::NavMeshGraph::$$c__DisplayClass29_0::*)(::Pathfinding::GraphNode*)>(&Pathfinding::NavMeshGraph::$$c__DisplayClass29_0::$GetNearestForceBoth$b__0)> {
  static const MethodInfo* get() {
    static auto* _node = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::NavMeshGraph::$$c__DisplayClass29_0*), "<GetNearestForceBoth>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{_node});
  }
};
