// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.ObjImporter
#include "Pathfinding/ObjImporter.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::ObjImporter::meshStruct, "Pathfinding", "ObjImporter/meshStruct");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x58
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Pathfinding.ObjImporter/meshStruct
  // [TokenAttribute] Offset: FFFFFFFF
  struct ObjImporter::meshStruct/*, public ::System::ValueType*/ {
    public:
    public:
    // public UnityEngine.Vector3[] vertices
    // Size: 0x8
    // Offset: 0x0
    ::ArrayW<::UnityEngine::Vector3> vertices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // public UnityEngine.Vector3[] normals
    // Size: 0x8
    // Offset: 0x8
    ::ArrayW<::UnityEngine::Vector3> normals;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // public UnityEngine.Vector2[] uv
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::Vector2> uv;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // public UnityEngine.Vector2[] uv1
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::Vector2> uv1;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // public UnityEngine.Vector2[] uv2
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::Vector2> uv2;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // public System.Int32[] triangles
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<int> triangles;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] faceVerts
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<int> faceVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32[] faceUVs
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int> faceUVs;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public UnityEngine.Vector3[] faceData
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Vector3> faceData;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // public System.String name
    // Size: 0x8
    // Offset: 0x48
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String fileName
    // Size: 0x8
    // Offset: 0x50
    ::StringW fileName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating value type constructor for type: meshStruct
    constexpr meshStruct(::ArrayW<::UnityEngine::Vector3> vertices_ = ::ArrayW<::UnityEngine::Vector3>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::Vector3> normals_ = ::ArrayW<::UnityEngine::Vector3>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::Vector2> uv_ = ::ArrayW<::UnityEngine::Vector2>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::Vector2> uv1_ = ::ArrayW<::UnityEngine::Vector2>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::Vector2> uv2_ = ::ArrayW<::UnityEngine::Vector2>(static_cast<void*>(nullptr)), ::ArrayW<int> triangles_ = ::ArrayW<int>(static_cast<void*>(nullptr)), ::ArrayW<int> faceVerts_ = ::ArrayW<int>(static_cast<void*>(nullptr)), ::ArrayW<int> faceUVs_ = ::ArrayW<int>(static_cast<void*>(nullptr)), ::ArrayW<::UnityEngine::Vector3> faceData_ = ::ArrayW<::UnityEngine::Vector3>(static_cast<void*>(nullptr)), ::StringW name_ = {}, ::StringW fileName_ = {}) noexcept : vertices{vertices_}, normals{normals_}, uv{uv_}, uv1{uv1_}, uv2{uv2_}, triangles{triangles_}, faceVerts{faceVerts_}, faceUVs{faceUVs_}, faceData{faceData_}, name{name_}, fileName{fileName_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: public UnityEngine.Vector3[] vertices
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector3>& dyn_vertices();
    // Get instance field reference: public UnityEngine.Vector3[] normals
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector3>& dyn_normals();
    // Get instance field reference: public UnityEngine.Vector2[] uv
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector2>& dyn_uv();
    // Get instance field reference: public UnityEngine.Vector2[] uv1
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector2>& dyn_uv1();
    // Get instance field reference: public UnityEngine.Vector2[] uv2
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector2>& dyn_uv2();
    // Get instance field reference: public System.Int32[] triangles
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_triangles();
    // Get instance field reference: public System.Int32[] faceVerts
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_faceVerts();
    // Get instance field reference: public System.Int32[] faceUVs
    [[deprecated("Use field access instead!")]] ::ArrayW<int>& dyn_faceUVs();
    // Get instance field reference: public UnityEngine.Vector3[] faceData
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector3>& dyn_faceData();
    // Get instance field reference: public System.String name
    [[deprecated("Use field access instead!")]] ::StringW& dyn_name();
    // Get instance field reference: public System.String fileName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_fileName();
  }; // Pathfinding.ObjImporter/meshStruct
  #pragma pack(pop)
  static check_size<sizeof(ObjImporter::meshStruct), 80 + sizeof(::StringW)> __Pathfinding_ObjImporter_meshStructSizeCheck;
  static_assert(sizeof(ObjImporter::meshStruct) == 0x58);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
