// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.PathState
#include "Pathfinding/PathState.hpp"
// Including type: Pathfinding.PathCompleteState
#include "Pathfinding/PathCompleteState.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: Pathfinding.Heuristic
#include "Pathfinding/Heuristic.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: PathHandler
  class PathHandler;
  // Forward declaring type: OnPathDelegate
  class OnPathDelegate;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: PathNode
  class PathNode;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: PathLog
  struct PathLog;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: Path
  class Path;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Path);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Path*, "Pathfinding", "Path");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0xD9
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Path
  // [TokenAttribute] Offset: FFFFFFFF
  class Path : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::Path::$WaitForPath$d__53
    class $WaitForPath$d__53;
    public:
    // [CompilerGeneratedAttribute] Offset: 0xAE5BA4
    // private Pathfinding.PathHandler <pathHandler>k__BackingField
    // Size: 0x8
    // Offset: 0x10
    ::Pathfinding::PathHandler* pathHandler;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathHandler*) == 0x8);
    // public Pathfinding.OnPathDelegate callback
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::OnPathDelegate* callback;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // public Pathfinding.OnPathDelegate immediateCallback
    // Size: 0x8
    // Offset: 0x20
    ::Pathfinding::OnPathDelegate* immediateCallback;
    // Field size check
    static_assert(sizeof(::Pathfinding::OnPathDelegate*) == 0x8);
    // private Pathfinding.PathState state
    // Size: 0x4
    // Offset: 0x28
    ::Pathfinding::PathState state;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathState) == 0x4);
    // Padding between fields: state and: stateLock
    char __padding3[0x4] = {};
    // private System.Object stateLock
    // Size: 0x8
    // Offset: 0x30
    ::Il2CppObject* stateLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private Pathfinding.PathCompleteState pathCompleteState
    // Size: 0x4
    // Offset: 0x38
    ::Pathfinding::PathCompleteState pathCompleteState;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathCompleteState) == 0x4);
    // Padding between fields: pathCompleteState and: errorLog
    char __padding5[0x4] = {};
    // private System.String _errorLog
    // Size: 0x8
    // Offset: 0x40
    ::StringW errorLog;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Collections.Generic.List`1<Pathfinding.GraphNode> path
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>* path;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pathfinding::GraphNode*>*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> vectorPath
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* vectorPath;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // protected System.Single maxFrameTime
    // Size: 0x4
    // Offset: 0x58
    float maxFrameTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: maxFrameTime and: currentR
    char __padding9[0x4] = {};
    // protected Pathfinding.PathNode currentR
    // Size: 0x8
    // Offset: 0x60
    ::Pathfinding::PathNode* currentR;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathNode*) == 0x8);
    // public System.Single duration
    // Size: 0x4
    // Offset: 0x68
    float duration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 searchIterations
    // Size: 0x4
    // Offset: 0x6C
    int searchIterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 searchedNodes
    // Size: 0x4
    // Offset: 0x70
    int searchedNodes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: searchedNodes and: callTime
    char __padding13[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE5BB4
    // private System.DateTime <callTime>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::System::DateTime callTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // System.Boolean pooled
    // Size: 0x1
    // Offset: 0x80
    bool pooled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean hasBeenReset
    // Size: 0x1
    // Offset: 0x81
    bool hasBeenReset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasBeenReset and: nnConstraint
    char __padding16[0x6] = {};
    // public Pathfinding.NNConstraint nnConstraint
    // Size: 0x8
    // Offset: 0x88
    ::Pathfinding::NNConstraint* nnConstraint;
    // Field size check
    static_assert(sizeof(::Pathfinding::NNConstraint*) == 0x8);
    // Pathfinding.Path next
    // Size: 0x8
    // Offset: 0x90
    ::Pathfinding::Path* next;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // public Pathfinding.Heuristic heuristic
    // Size: 0x4
    // Offset: 0x98
    ::Pathfinding::Heuristic heuristic;
    // Field size check
    static_assert(sizeof(::Pathfinding::Heuristic) == 0x4);
    // public System.Single heuristicScale
    // Size: 0x4
    // Offset: 0x9C
    float heuristicScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE5BC4
    // private System.UInt16 <pathID>k__BackingField
    // Size: 0x2
    // Offset: 0xA0
    uint16_t pathID;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: pathID and: hTargetNode
    char __padding21[0x6] = {};
    // protected Pathfinding.GraphNode hTargetNode
    // Size: 0x8
    // Offset: 0xA8
    ::Pathfinding::GraphNode* hTargetNode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphNode*) == 0x8);
    // protected Pathfinding.Int3 hTarget
    // Size: 0xC
    // Offset: 0xB0
    ::Pathfinding::Int3 hTarget;
    // Field size check
    static_assert(sizeof(::Pathfinding::Int3) == 0xC);
    // public System.Int32 enabledTags
    // Size: 0x4
    // Offset: 0xBC
    int enabledTags;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32[] internalTagPenalties
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<int> internalTagPenalties;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // protected System.Int32[] manualTagPenalties
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<int> manualTagPenalties;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<System.Object> claimed
    // Size: 0x8
    // Offset: 0xD0
    ::System::Collections::Generic::List_1<::Il2CppObject*>* claimed;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Il2CppObject*>*) == 0x8);
    // private System.Boolean releasedNotSilent
    // Size: 0x1
    // Offset: 0xD8
    bool releasedNotSilent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private readonly System.Int32[] ZeroTagPenalties
    static ::ArrayW<int> _get_ZeroTagPenalties();
    // Set static field: static private readonly System.Int32[] ZeroTagPenalties
    static void _set_ZeroTagPenalties(::ArrayW<int> value);
    // Get instance field reference: private Pathfinding.PathHandler <pathHandler>k__BackingField
    [[deprecated("Use field access instead!")]] ::Pathfinding::PathHandler*& dyn_$pathHandler$k__BackingField();
    // Get instance field reference: public Pathfinding.OnPathDelegate callback
    [[deprecated("Use field access instead!")]] ::Pathfinding::OnPathDelegate*& dyn_callback();
    // Get instance field reference: public Pathfinding.OnPathDelegate immediateCallback
    [[deprecated("Use field access instead!")]] ::Pathfinding::OnPathDelegate*& dyn_immediateCallback();
