// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Pathfinding.NavGraph
#include "Pathfinding/NavGraph.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: Pathfinding.Int3
#include "Pathfinding/Int3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: PointNode
  class PointNode;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: GraphNodeDelegateCancelable
  class GraphNodeDelegateCancelable;
  // Forward declaring type: NNInfo
  struct NNInfo;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: OnScanStatus
  class OnScanStatus;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Matrix4x4 because it is already included!
}
// Forward declaring namespace: Pathfinding::Serialization
namespace Pathfinding::Serialization {
  // Forward declaring type: GraphSerializationContext
  class GraphSerializationContext;
}
// Completed forward declares
// Type namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: PointGraph
  class PointGraph;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::PointGraph);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::PointGraph*, "Pathfinding", "PointGraph");
// Type namespace: Pathfinding
namespace Pathfinding {
  // Size: 0x104
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.PointGraph
  // [TokenAttribute] Offset: FFFFFFFF
  // [JsonOptInAttribute] Offset: FFFFFFFF
  class PointGraph : public ::Pathfinding::NavGraph {
    public:
    // Writing base type padding for base size: 0xC4 to desired offset: 0xC8
    char ___base_padding[0x4] = {};
    // Nested type: ::Pathfinding::PointGraph::GetNearestHelper
    struct GetNearestHelper;
    public:
    // public UnityEngine.Transform root
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Transform* root;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.String searchTag
    // Size: 0x8
    // Offset: 0xD0
    ::StringW searchTag;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single maxDistance
    // Size: 0x4
    // Offset: 0xD8
    float maxDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 limits
    // Size: 0xC
    // Offset: 0xDC
    ::UnityEngine::Vector3 limits;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean raycast
    // Size: 0x1
    // Offset: 0xE8
    bool raycast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean use2DPhysics
    // Size: 0x1
    // Offset: 0xE9
    bool use2DPhysics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean thickRaycast
    // Size: 0x1
    // Offset: 0xEA
    bool thickRaycast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: thickRaycast and: thickRaycastRadius
    char __padding6[0x1] = {};
    // public System.Single thickRaycastRadius
    // Size: 0x4
    // Offset: 0xEC
    float thickRaycastRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean recursive
    // Size: 0x1
    // Offset: 0xF0
    bool recursive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: recursive and: mask
    char __padding8[0x3] = {};
    // public UnityEngine.LayerMask mask
    // Size: 0x4
    // Offset: 0xF4
    ::UnityEngine::LayerMask mask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public Pathfinding.PointNode[] nodes
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::Pathfinding::PointNode*> nodes;
    // Field size check
    static_assert(sizeof(::ArrayW<::Pathfinding::PointNode*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5EC4
    // private System.Int32 <nodeCount>k__BackingField
    // Size: 0x4
    // Offset: 0x100
    int nodeCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.Transform root
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_root();
    // Get instance field reference: public System.String searchTag
    [[deprecated("Use field access instead!")]] ::StringW& dyn_searchTag();
    // Get instance field reference: public System.Single maxDistance
    [[deprecated("Use field access instead!")]] float& dyn_maxDistance();
    // Get instance field reference: public UnityEngine.Vector3 limits
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_limits();
    // Get instance field reference: public System.Boolean raycast
    [[deprecated("Use field access instead!")]] bool& dyn_raycast();
    // Get instance field reference: public System.Boolean use2DPhysics
    [[deprecated("Use field access instead!")]] bool& dyn_use2DPhysics();
    // Get instance field reference: public System.Boolean thickRaycast
    [[deprecated("Use field access instead!")]] bool& dyn_thickRaycast();
    // Get instance field reference: public System.Single thickRaycastRadius
    [[deprecated("Use field access instead!")]] float& dyn_thickRaycastRadius();
    // Get instance field reference: public System.Boolean recursive
    [[deprecated("Use field access instead!")]] bool& dyn_recursive();
    // Get instance field reference: public UnityEngine.LayerMask mask
    [[deprecated("Use field access instead!")]] ::UnityEngine::LayerMask& dyn_mask();
    // Get instance field reference: public Pathfinding.PointNode[] nodes
    [[deprecated("Use field access instead!")]] ::ArrayW<::Pathfinding::PointNode*>& dyn_nodes();
    // Get instance field reference: private System.Int32 <nodeCount>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$nodeCount$k__BackingField();
    // public System.Int32 get_nodeCount()
    // Offset: 0x16AF5BC
    int get_nodeCount();
    // private System.Void set_nodeCount(System.Int32 value)
    // Offset: 0x16AF5C4
    void set_nodeCount(int value);
    // public Pathfinding.PointNode AddNode(Pathfinding.Int3 position)
    // Offset: 0x16A0A9C
    ::Pathfinding::PointNode* AddNode(::Pathfinding::Int3 position);
    // public T AddNode(T node, Pathfinding.Int3 position)
    // Offset: 0xFFFFFFFFFFFFFFFF
    template<class T>
    T AddNode(T node, ::Pathfinding::Int3 position) {
      static_assert(std::is_convertible_v<T, ::Pathfinding::PointNode*>);
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::PointGraph::AddNode");
      static auto* ___internal__method = THROW_UNLESS((::il2cpp_utils::FindMethod(this, "AddNode", std::vector<Il2CppClass*>{::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<T>::get()}, ::std::vector<const Il2CppType*>{::il2cpp_utils::ExtractType(node), ::il2cpp_utils::ExtractType(position)})));
      static auto* ___generic__method = THROW_UNLESS(::il2cpp_utils::MakeGenericMethod(___internal__method, std::vector<Il2CppClass*>{::il2cpp_utils::il2cpp_type_check::il2cpp_no_arg_class<T>::get()}));
      return ::il2cpp_utils::RunMethodRethrow<T, false>(this, ___generic__method, node, position);
    }
    // static protected System.Int32 CountChildren(UnityEngine.Transform tr)
    // Offset: 0x16AF9D8
    static int CountChildren(::UnityEngine::Transform* tr);
    // protected System.Void AddChildren(ref System.Int32 c, UnityEngine.Transform tr)
    // Offset: 0x16AFC8C
    void AddChildren(ByRef<int> c, ::UnityEngine::Transform* tr);
    // public System.Void RebuildNodeLookup()
    // Offset: 0x16B0108
    void RebuildNodeLookup();
    // private System.Void AddToLookup(Pathfinding.PointNode node)
    // Offset: 0x16B010C
    void AddToLookup(::Pathfinding::PointNode* node);
    // public System.Boolean IsValidConnection(Pathfinding.GraphNode a, Pathfinding.GraphNode b, out System.Single dist)
    // Offset: 0x16B0D28
    bool IsValidConnection(::Pathfinding::GraphNode* a, ::Pathfinding::GraphNode* b, ByRef<float> dist);
    // public override System.Int32 CountNodes()
    // Offset: 0x16AF5CC
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Int32 NavGraph::CountNodes()
    int CountNodes();
    // public override System.Void GetNodes(Pathfinding.GraphNodeDelegateCancelable del)
    // Offset: 0x16AF5D4
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::GetNodes(Pathfinding.GraphNodeDelegateCancelable del)
    void GetNodes(::Pathfinding::GraphNodeDelegateCancelable* del);
    // public override Pathfinding.NNInfo GetNearest(UnityEngine.Vector3 position, Pathfinding.NNConstraint constraint, Pathfinding.GraphNode hint)
    // Offset: 0x16AF688
    // Implemented from: Pathfinding.NavGraph
    // Base method: Pathfinding.NNInfo NavGraph::GetNearest(UnityEngine.Vector3 position, Pathfinding.NNConstraint constraint, Pathfinding.GraphNode hint)
    ::Pathfinding::NNInfo GetNearest(::UnityEngine::Vector3 position, ::Pathfinding::NNConstraint* constraint, ::Pathfinding::GraphNode* hint);
    // public override Pathfinding.NNInfo GetNearestForce(UnityEngine.Vector3 position, Pathfinding.NNConstraint constraint)
    // Offset: 0x16AF694
    // Implemented from: Pathfinding.NavGraph
    // Base method: Pathfinding.NNInfo NavGraph::GetNearestForce(UnityEngine.Vector3 position, Pathfinding.NNConstraint constraint)
    ::Pathfinding::NNInfo GetNearestForce(::UnityEngine::Vector3 position, ::Pathfinding::NNConstraint* constraint);
    // public override System.Void ScanInternal(Pathfinding.OnScanStatus statusCallback)
    // Offset: 0x16B0110
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::ScanInternal(Pathfinding.OnScanStatus statusCallback)
    void ScanInternal(::Pathfinding::OnScanStatus* statusCallback);
    // public override System.Void PostDeserialization()
    // Offset: 0x16B1630
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::PostDeserialization()
    void PostDeserialization();
    // public override System.Void RelocateNodes(UnityEngine.Matrix4x4 oldMatrix, UnityEngine.Matrix4x4 newMatrix)
    // Offset: 0x16B1634
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::RelocateNodes(UnityEngine.Matrix4x4 oldMatrix, UnityEngine.Matrix4x4 newMatrix)
    void RelocateNodes(::UnityEngine::Matrix4x4 oldMatrix, ::UnityEngine::Matrix4x4 newMatrix);
    // public override System.Void DeserializeSettingsCompatibility(Pathfinding.Serialization.GraphSerializationContext ctx)
    // Offset: 0x16B169C
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::DeserializeSettingsCompatibility(Pathfinding.Serialization.GraphSerializationContext ctx)
    void DeserializeSettingsCompatibility(::Pathfinding::Serialization::GraphSerializationContext* ctx);
    // public override System.Void SerializeExtraInfo(Pathfinding.Serialization.GraphSerializationContext ctx)
    // Offset: 0x16B1CDC
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::SerializeExtraInfo(Pathfinding.Serialization.GraphSerializationContext ctx)
    void SerializeExtraInfo(::Pathfinding::Serialization::GraphSerializationContext* ctx);
    // public override System.Void DeserializeExtraInfo(Pathfinding.Serialization.GraphSerializationContext ctx)
    // Offset: 0x16B1E70
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::DeserializeExtraInfo(Pathfinding.Serialization.GraphSerializationContext ctx)
    void DeserializeExtraInfo(::Pathfinding::Serialization::GraphSerializationContext* ctx);
    // public System.Void .ctor()
    // Offset: 0x16A37A4
    // Implemented from: Pathfinding.NavGraph
    // Base method: System.Void NavGraph::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PointGraph* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Pathfinding::PointGraph::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PointGraph*, creationType>()));
    }
  }; // Pathfinding.PointGraph
  #pragma pack(pop)
  static check_size<sizeof(PointGraph), 256 + sizeof(int)> __Pathfinding_PointGraphSizeCheck;
  static_assert(sizeof(PointGraph) == 0x104);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Pathfinding::PointGraph::get_nodeCount
// Il2CppName: get_nodeCount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Pathfinding::PointGraph::*)()>(&Pathfinding::PointGraph::get_nodeCount)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "get_nodeCount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::set_nodeCount
// Il2CppName: set_nodeCount
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(int)>(&Pathfinding::PointGraph::set_nodeCount)> {
  static const MethodInfo* get() {
    static auto* value = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "set_nodeCount", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{value});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::AddNode
// Il2CppName: AddNode
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Pathfinding::PointNode* (Pathfinding::PointGraph::*)(::Pathfinding::Int3)>(&Pathfinding::PointGraph::AddNode)> {
  static const MethodInfo* get() {
    static auto* position = &::il2cpp_utils::GetClassFromName("Pathfinding", "Int3")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "AddNode", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{position});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::AddNode
// Il2CppName: AddNode
// Cannot write MetadataGetter for generic methods!
// Writing MetadataGetter for method: Pathfinding::PointGraph::CountChildren
// Il2CppName: CountChildren
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (*)(::UnityEngine::Transform*)>(&Pathfinding::PointGraph::CountChildren)> {
  static const MethodInfo* get() {
    static auto* tr = &::il2cpp_utils::GetClassFromName("UnityEngine", "Transform")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "CountChildren", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{tr});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::AddChildren
// Il2CppName: AddChildren
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(ByRef<int>, ::UnityEngine::Transform*)>(&Pathfinding::PointGraph::AddChildren)> {
  static const MethodInfo* get() {
    static auto* c = &::il2cpp_utils::GetClassFromName("System", "Int32")->this_arg;
    static auto* tr = &::il2cpp_utils::GetClassFromName("UnityEngine", "Transform")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "AddChildren", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{c, tr});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::RebuildNodeLookup
// Il2CppName: RebuildNodeLookup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)()>(&Pathfinding::PointGraph::RebuildNodeLookup)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "RebuildNodeLookup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::AddToLookup
// Il2CppName: AddToLookup
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::Pathfinding::PointNode*)>(&Pathfinding::PointGraph::AddToLookup)> {
  static const MethodInfo* get() {
    static auto* node = &::il2cpp_utils::GetClassFromName("Pathfinding", "PointNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "AddToLookup", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{node});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::IsValidConnection
// Il2CppName: IsValidConnection
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<bool (Pathfinding::PointGraph::*)(::Pathfinding::GraphNode*, ::Pathfinding::GraphNode*, ByRef<float>)>(&Pathfinding::PointGraph::IsValidConnection)> {
  static const MethodInfo* get() {
    static auto* a = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    static auto* b = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    static auto* dist = &::il2cpp_utils::GetClassFromName("System", "Single")->this_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "IsValidConnection", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{a, b, dist});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::CountNodes
// Il2CppName: CountNodes
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (Pathfinding::PointGraph::*)()>(&Pathfinding::PointGraph::CountNodes)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "CountNodes", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::GetNodes
// Il2CppName: GetNodes
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::Pathfinding::GraphNodeDelegateCancelable*)>(&Pathfinding::PointGraph::GetNodes)> {
  static const MethodInfo* get() {
    static auto* del = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNodeDelegateCancelable")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "GetNodes", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{del});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::GetNearest
// Il2CppName: GetNearest
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Pathfinding::NNInfo (Pathfinding::PointGraph::*)(::UnityEngine::Vector3, ::Pathfinding::NNConstraint*, ::Pathfinding::GraphNode*)>(&Pathfinding::PointGraph::GetNearest)> {
  static const MethodInfo* get() {
    static auto* position = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* constraint = &::il2cpp_utils::GetClassFromName("Pathfinding", "NNConstraint")->byval_arg;
    static auto* hint = &::il2cpp_utils::GetClassFromName("Pathfinding", "GraphNode")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "GetNearest", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{position, constraint, hint});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::GetNearestForce
// Il2CppName: GetNearestForce
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::Pathfinding::NNInfo (Pathfinding::PointGraph::*)(::UnityEngine::Vector3, ::Pathfinding::NNConstraint*)>(&Pathfinding::PointGraph::GetNearestForce)> {
  static const MethodInfo* get() {
    static auto* position = &::il2cpp_utils::GetClassFromName("UnityEngine", "Vector3")->byval_arg;
    static auto* constraint = &::il2cpp_utils::GetClassFromName("Pathfinding", "NNConstraint")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "GetNearestForce", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{position, constraint});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::ScanInternal
// Il2CppName: ScanInternal
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::Pathfinding::OnScanStatus*)>(&Pathfinding::PointGraph::ScanInternal)> {
  static const MethodInfo* get() {
    static auto* statusCallback = &::il2cpp_utils::GetClassFromName("Pathfinding", "OnScanStatus")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "ScanInternal", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{statusCallback});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::PostDeserialization
// Il2CppName: PostDeserialization
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)()>(&Pathfinding::PointGraph::PostDeserialization)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "PostDeserialization", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::RelocateNodes
// Il2CppName: RelocateNodes
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::UnityEngine::Matrix4x4, ::UnityEngine::Matrix4x4)>(&Pathfinding::PointGraph::RelocateNodes)> {
  static const MethodInfo* get() {
    static auto* oldMatrix = &::il2cpp_utils::GetClassFromName("UnityEngine", "Matrix4x4")->byval_arg;
    static auto* newMatrix = &::il2cpp_utils::GetClassFromName("UnityEngine", "Matrix4x4")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "RelocateNodes", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{oldMatrix, newMatrix});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::DeserializeSettingsCompatibility
// Il2CppName: DeserializeSettingsCompatibility
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::Pathfinding::Serialization::GraphSerializationContext*)>(&Pathfinding::PointGraph::DeserializeSettingsCompatibility)> {
  static const MethodInfo* get() {
    static auto* ctx = &::il2cpp_utils::GetClassFromName("Pathfinding.Serialization", "GraphSerializationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "DeserializeSettingsCompatibility", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ctx});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::SerializeExtraInfo
// Il2CppName: SerializeExtraInfo
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::Pathfinding::Serialization::GraphSerializationContext*)>(&Pathfinding::PointGraph::SerializeExtraInfo)> {
  static const MethodInfo* get() {
    static auto* ctx = &::il2cpp_utils::GetClassFromName("Pathfinding.Serialization", "GraphSerializationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "SerializeExtraInfo", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ctx});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::DeserializeExtraInfo
// Il2CppName: DeserializeExtraInfo
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Pathfinding::PointGraph::*)(::Pathfinding::Serialization::GraphSerializationContext*)>(&Pathfinding::PointGraph::DeserializeExtraInfo)> {
  static const MethodInfo* get() {
    static auto* ctx = &::il2cpp_utils::GetClassFromName("Pathfinding.Serialization", "GraphSerializationContext")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(Pathfinding::PointGraph*), "DeserializeExtraInfo", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ctx});
  }
};
// Writing MetadataGetter for method: Pathfinding::PointGraph::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
