// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LitJson
namespace LitJson {
  // Forward declaring type: WriterContext
  class WriterContext;
  // Forward declaring type: Condition
  struct Condition;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextWriter
  class TextWriter;
}
// Forward declaring namespace: System::Globalization
namespace System::Globalization {
  // Forward declaring type: NumberFormatInfo
  class NumberFormatInfo;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Decimal
  struct Decimal;
}
// Completed forward declares
// Type namespace: LitJson
namespace LitJson {
  // Forward declaring type: JsonWriter
  class JsonWriter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::LitJson::JsonWriter);
DEFINE_IL2CPP_ARG_TYPE(::LitJson::JsonWriter*, "LitJson", "JsonWriter");
// Type namespace: LitJson
namespace LitJson {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: LitJson.JsonWriter
  // [TokenAttribute] Offset: FFFFFFFF
  class JsonWriter : public ::Il2CppObject {
    public:
    public:
    // private LitJson.WriterContext context
    // Size: 0x8
    // Offset: 0x10
    ::LitJson::WriterContext* context;
    // Field size check
    static_assert(sizeof(::LitJson::WriterContext*) == 0x8);
    // private System.Collections.Generic.Stack`1<LitJson.WriterContext> ctxStack
    // Size: 0x8
    // Offset: 0x18
    ::System::Collections::Generic::Stack_1<::LitJson::WriterContext*>* ctxStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<::LitJson::WriterContext*>*) == 0x8);
    // private System.Boolean hasReachedEnd
    // Size: 0x1
    // Offset: 0x20
    bool hasReachedEnd;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasReachedEnd and: hexSeq
    char __padding2[0x7] = {};
    // private System.Char[] hexSeq
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::Il2CppChar> hexSeq;
    // Field size check
    static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
    // private System.Int32 indentation
    // Size: 0x4
    // Offset: 0x30
    int indentation;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 indentValue
    // Size: 0x4
    // Offset: 0x34
    int indentValue;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Text.StringBuilder stringBuilder
    // Size: 0x8
    // Offset: 0x38
    ::System::Text::StringBuilder* stringBuilder;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADCE98
    // private System.Boolean <PrettyPrint>k__BackingField
    // Size: 0x1
    // Offset: 0x40
    bool PrettyPrint;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xADCEA8
    // private System.Boolean <Validate>k__BackingField
    // Size: 0x1
    // Offset: 0x41
    bool Validate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xADCEB8
    // private System.Boolean <TypeHinting>k__BackingField
    // Size: 0x1
    // Offset: 0x42
    bool TypeHinting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: TypeHinting and: HintTypeName
    char __padding9[0x5] = {};
    // [CompilerGeneratedAttribute] Offset: 0xADCEC8
    // private System.String <HintTypeName>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW HintTypeName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADCED8
    // private System.String <HintValueName>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::StringW HintValueName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADCEE8
    // private System.IO.TextWriter <TextWriter>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::System::IO::TextWriter* TextWriter;
    // Field size check
    static_assert(sizeof(::System::IO::TextWriter*) == 0x8);
    public:
    // Get static field: static private readonly System.Globalization.NumberFormatInfo numberFormat
    static ::System::Globalization::NumberFormatInfo* _get_numberFormat();
    // Set static field: static private readonly System.Globalization.NumberFormatInfo numberFormat
    static void _set_numberFormat(::System::Globalization::NumberFormatInfo* value);
    // Get instance field reference: private LitJson.WriterContext context
    [[deprecated("Use field access instead!")]] ::LitJson::WriterContext*& dyn_context();
    // Get instance field reference: private System.Collections.Generic.Stack`1<LitJson.WriterContext> ctxStack
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::Stack_1<::LitJson::WriterContext*>*& dyn_ctxStack();
