// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: LitJson
namespace LitJson {
  // Forward declaring type: FsmContext
  class FsmContext;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextReader
  class TextReader;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: StringBuilder
  class StringBuilder;
}
// Completed forward declares
// Type namespace: LitJson
namespace LitJson {
  // Forward declaring type: Lexer
  class Lexer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::LitJson::Lexer);
DEFINE_IL2CPP_ARG_TYPE(::LitJson::Lexer*, "LitJson", "Lexer");
// Type namespace: LitJson
namespace LitJson {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: LitJson.Lexer
  // [TokenAttribute] Offset: FFFFFFFF
  class Lexer : public ::Il2CppObject {
    public:
    // Nested type: ::LitJson::Lexer::StateHandler
    class StateHandler;
    public:
    // private System.Int32 inputBuffer
    // Size: 0x4
    // Offset: 0x10
    int inputBuffer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 inputChar
    // Size: 0x4
    // Offset: 0x14
    int inputChar;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 state
    // Size: 0x4
    // Offset: 0x18
    int state;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 unichar
    // Size: 0x4
    // Offset: 0x1C
    int unichar;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private LitJson.FsmContext context
    // Size: 0x8
    // Offset: 0x20
    ::LitJson::FsmContext* context;
    // Field size check
    static_assert(sizeof(::LitJson::FsmContext*) == 0x8);
    // private System.IO.TextReader reader
    // Size: 0x8
    // Offset: 0x28
    ::System::IO::TextReader* reader;
    // Field size check
    static_assert(sizeof(::System::IO::TextReader*) == 0x8);
    // private System.Text.StringBuilder stringBuffer
    // Size: 0x8
    // Offset: 0x30
    ::System::Text::StringBuilder* stringBuffer;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADCEF8
    // private System.Boolean <AllowComments>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool AllowComments;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xADCF08
    // private System.Boolean <AllowSingleQuotedStrings>k__BackingField
    // Size: 0x1
    // Offset: 0x39
    bool AllowSingleQuotedStrings;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xADCF18
    // private System.Boolean <EndOfInput>k__BackingField
    // Size: 0x1
    // Offset: 0x3A
    bool EndOfInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EndOfInput and: Token
    char __padding9[0x1] = {};
    // [CompilerGeneratedAttribute] Offset: 0xADCF28
    // private System.Int32 <Token>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    int Token;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xADCF38
    // private System.String <StringValue>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::StringW StringValue;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Get static field: static private System.Int32[] returnTable
    static ::ArrayW<int> _get_returnTable();
    // Set static field: static private System.Int32[] returnTable
    static void _set_returnTable(::ArrayW<int> value);
    // Get static field: static private LitJson.Lexer/StateHandler[] handlerTable
    static ::ArrayW<::LitJson::Lexer::StateHandler*> _get_handlerTable();
    // Set static field: static private LitJson.Lexer/StateHandler[] handlerTable
    static void _set_handlerTable(::ArrayW<::LitJson::Lexer::StateHandler*> value);
    // Get instance field reference: private System.Int32 inputBuffer
    [[deprecated("Use field access instead!")]] int& dyn_inputBuffer();
    // Get instance field reference: private System.Int32 inputChar
    [[deprecated("Use field access instead!")]] int& dyn_inputChar();
