// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Xml.XmlReader
#include "System/Xml/XmlReader.hpp"
// Including type: System.Xml.IXmlLineInfo
#include "System/Xml/IXmlLineInfo.hpp"
// Including type: System.Xml.IXmlNamespaceResolver
#include "System/Xml/IXmlNamespaceResolver.hpp"
// Including type: System.Xml.XmlCharType
#include "System/Xml/XmlCharType.hpp"
// Including type: System.Xml.WhitespaceHandling
#include "System/Xml/WhitespaceHandling.hpp"
// Including type: System.Xml.DtdProcessing
#include "System/Xml/DtdProcessing.hpp"
// Including type: System.Xml.EntityHandling
#include "System/Xml/EntityHandling.hpp"
// Including type: System.Xml.XmlNodeType
#include "System/Xml/XmlNodeType.hpp"
// Including type: System.Xml.LineInfo
#include "System/Xml/LineInfo.hpp"
// Including type: System.Xml.ReadState
#include "System/Xml/ReadState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes

namespace System::Threading::Tasks {
  // Forward declaring type: Task`1<TResult>
  template<typename TResult>
  class Task_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Tuple`4<T1, T2, T3, T4>
  template<typename T1, typename T2, typename T3, typename T4>
  class Tuple_4;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: TextReader
  class TextReader;
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Xml::Schema
namespace System::Xml::Schema {
  // Forward declaring type: XmlSeverityType
  struct XmlSeverityType;
  // Forward declaring type: XmlSchemaException
  class XmlSchemaException;
}
// Completed forward declares
// Type namespace: System.Xml
namespace System::Xml {
  // Forward declaring type: XmlTextReaderImpl
  class XmlTextReaderImpl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Xml::XmlTextReaderImpl);
DEFINE_IL2CPP_ARG_TYPE(::System::Xml::XmlTextReaderImpl*, "System.Xml", "XmlTextReaderImpl");
// Type namespace: System.Xml
namespace System::Xml {
  // Size: 0x228
  #pragma pack(push, 1)
  // Autogenerated type: System.Xml.XmlTextReaderImpl
  // [TokenAttribute] Offset: FFFFFFFF
  class XmlTextReaderImpl : public ::System::Xml::XmlReader/*, public ::System::Xml::IXmlLineInfo, public ::System::Xml::IXmlNamespaceResolver*/ {
    public:
    // Nested type: ::System::Xml::XmlTextReaderImpl::ParsingFunction
    struct ParsingFunction;
    // Nested type: ::System::Xml::XmlTextReaderImpl::ParsingMode
    struct ParsingMode;
    // Nested type: ::System::Xml::XmlTextReaderImpl::EntityType
    struct EntityType;
    // Nested type: ::System::Xml::XmlTextReaderImpl::EntityExpandType
    struct EntityExpandType;
    // Nested type: ::System::Xml::XmlTextReaderImpl::IncrementalReadState
    struct IncrementalReadState;
    // Nested type: ::System::Xml::XmlTextReaderImpl::LaterInitParam
    class LaterInitParam;
    // Nested type: ::System::Xml::XmlTextReaderImpl::InitInputType
    struct InitInputType;
    // Nested type: ::System::Xml::XmlTextReaderImpl::ParsingState
    struct ParsingState;
    // Nested type: ::System::Xml::XmlTextReaderImpl::XmlContext
    class XmlContext;
    // Nested type: ::System::Xml::XmlTextReaderImpl::DtdParserProxy
    class DtdParserProxy;
    // Nested type: ::System::Xml::XmlTextReaderImpl::NodeData
    class NodeData;
    // Nested type: ::System::Xml::XmlTextReaderImpl::DtdDefaultAttributeInfoToNodeDataComparer
    class DtdDefaultAttributeInfoToNodeDataComparer;
    // Nested type: ::System::Xml::XmlTextReaderImpl::OnDefaultAttributeUseDelegate
    class OnDefaultAttributeUseDelegate;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextReaderImpl/ParsingFunction
    // [TokenAttribute] Offset: FFFFFFFF
    struct ParsingFunction/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ParsingFunction
      constexpr ParsingFunction(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction ElementContent
      static constexpr const int ElementContent = 0;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ElementContent
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_ElementContent();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ElementContent
      static void _set_ElementContent(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction NoData
      static constexpr const int NoData = 1;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction NoData
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_NoData();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction NoData
      static void _set_NoData(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction OpenUrl
      static constexpr const int OpenUrl = 2;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction OpenUrl
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_OpenUrl();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction OpenUrl
      static void _set_OpenUrl(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction SwitchToInteractive
      static constexpr const int SwitchToInteractive = 3;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction SwitchToInteractive
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_SwitchToInteractive();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction SwitchToInteractive
      static void _set_SwitchToInteractive(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction SwitchToInteractiveXmlDecl
      static constexpr const int SwitchToInteractiveXmlDecl = 4;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction SwitchToInteractiveXmlDecl
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_SwitchToInteractiveXmlDecl();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction SwitchToInteractiveXmlDecl
      static void _set_SwitchToInteractiveXmlDecl(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction DocumentContent
      static constexpr const int DocumentContent = 5;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction DocumentContent
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_DocumentContent();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction DocumentContent
      static void _set_DocumentContent(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction MoveToElementContent
      static constexpr const int MoveToElementContent = 6;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction MoveToElementContent
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_MoveToElementContent();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction MoveToElementContent
      static void _set_MoveToElementContent(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction PopElementContext
      static constexpr const int PopElementContext = 7;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction PopElementContext
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_PopElementContext();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction PopElementContext
      static void _set_PopElementContext(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction PopEmptyElementContext
      static constexpr const int PopEmptyElementContext = 8;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction PopEmptyElementContext
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_PopEmptyElementContext();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction PopEmptyElementContext
      static void _set_PopEmptyElementContext(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction ResetAttributesRootLevel
      static constexpr const int ResetAttributesRootLevel = 9;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ResetAttributesRootLevel
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_ResetAttributesRootLevel();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ResetAttributesRootLevel
      static void _set_ResetAttributesRootLevel(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction Error
      static constexpr const int Error = 10;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction Error
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_Error();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction Error
      static void _set_Error(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction Eof
      static constexpr const int Eof = 11;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction Eof
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_Eof();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction Eof
      static void _set_Eof(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction ReaderClosed
      static constexpr const int ReaderClosed = 12;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ReaderClosed
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_ReaderClosed();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ReaderClosed
      static void _set_ReaderClosed(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction EntityReference
      static constexpr const int EntityReference = 13;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction EntityReference
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_EntityReference();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction EntityReference
      static void _set_EntityReference(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction InIncrementalRead
      static constexpr const int InIncrementalRead = 14;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InIncrementalRead
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_InIncrementalRead();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InIncrementalRead
      static void _set_InIncrementalRead(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction FragmentAttribute
      static constexpr const int FragmentAttribute = 15;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction FragmentAttribute
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_FragmentAttribute();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction FragmentAttribute
      static void _set_FragmentAttribute(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction ReportEndEntity
      static constexpr const int ReportEndEntity = 16;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ReportEndEntity
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_ReportEndEntity();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction ReportEndEntity
      static void _set_ReportEndEntity(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction AfterResolveEntityInContent
      static constexpr const int AfterResolveEntityInContent = 17;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction AfterResolveEntityInContent
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_AfterResolveEntityInContent();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction AfterResolveEntityInContent
      static void _set_AfterResolveEntityInContent(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction AfterResolveEmptyEntityInContent
      static constexpr const int AfterResolveEmptyEntityInContent = 18;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction AfterResolveEmptyEntityInContent
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_AfterResolveEmptyEntityInContent();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction AfterResolveEmptyEntityInContent
      static void _set_AfterResolveEmptyEntityInContent(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction XmlDeclarationFragment
      static constexpr const int XmlDeclarationFragment = 19;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction XmlDeclarationFragment
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_XmlDeclarationFragment();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction XmlDeclarationFragment
      static void _set_XmlDeclarationFragment(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction GoToEof
      static constexpr const int GoToEof = 20;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction GoToEof
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_GoToEof();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction GoToEof
      static void _set_GoToEof(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction PartialTextValue
      static constexpr const int PartialTextValue = 21;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction PartialTextValue
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_PartialTextValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction PartialTextValue
      static void _set_PartialTextValue(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadAttributeValue
      static constexpr const int InReadAttributeValue = 22;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadAttributeValue
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_InReadAttributeValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadAttributeValue
      static void _set_InReadAttributeValue(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadValueChunk
      static constexpr const int InReadValueChunk = 23;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadValueChunk
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_InReadValueChunk();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadValueChunk
      static void _set_InReadValueChunk(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadContentAsBinary
      static constexpr const int InReadContentAsBinary = 24;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadContentAsBinary
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_InReadContentAsBinary();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadContentAsBinary
      static void _set_InReadContentAsBinary(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadElementContentAsBinary
      static constexpr const int InReadElementContentAsBinary = 25;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadElementContentAsBinary
      static ::System::Xml::XmlTextReaderImpl::ParsingFunction _get_InReadElementContentAsBinary();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingFunction InReadElementContentAsBinary
      static void _set_InReadElementContentAsBinary(::System::Xml::XmlTextReaderImpl::ParsingFunction value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Xml.XmlTextReaderImpl/ParsingFunction
    #pragma pack(pop)
    static check_size<sizeof(XmlTextReaderImpl::ParsingFunction), 0 + sizeof(int)> __System_Xml_XmlTextReaderImpl_ParsingFunctionSizeCheck;
    static_assert(sizeof(XmlTextReaderImpl::ParsingFunction) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextReaderImpl/ParsingMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct ParsingMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ParsingMode
      constexpr ParsingMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingMode Full
      static constexpr const int Full = 0;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingMode Full
      static ::System::Xml::XmlTextReaderImpl::ParsingMode _get_Full();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingMode Full
      static void _set_Full(::System::Xml::XmlTextReaderImpl::ParsingMode value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingMode SkipNode
      static constexpr const int SkipNode = 1;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingMode SkipNode
      static ::System::Xml::XmlTextReaderImpl::ParsingMode _get_SkipNode();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingMode SkipNode
      static void _set_SkipNode(::System::Xml::XmlTextReaderImpl::ParsingMode value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/ParsingMode SkipContent
      static constexpr const int SkipContent = 2;
      // Get static field: static public System.Xml.XmlTextReaderImpl/ParsingMode SkipContent
      static ::System::Xml::XmlTextReaderImpl::ParsingMode _get_SkipContent();
      // Set static field: static public System.Xml.XmlTextReaderImpl/ParsingMode SkipContent
      static void _set_SkipContent(::System::Xml::XmlTextReaderImpl::ParsingMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Xml.XmlTextReaderImpl/ParsingMode
    #pragma pack(pop)
    static check_size<sizeof(XmlTextReaderImpl::ParsingMode), 0 + sizeof(int)> __System_Xml_XmlTextReaderImpl_ParsingModeSizeCheck;
    static_assert(sizeof(XmlTextReaderImpl::ParsingMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: System.Xml.XmlTextReaderImpl/IncrementalReadState
    // [TokenAttribute] Offset: FFFFFFFF
    struct IncrementalReadState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: IncrementalReadState
      constexpr IncrementalReadState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Text
      static constexpr const int Text = 0;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Text
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_Text();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Text
      static void _set_Text(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState StartTag
      static constexpr const int StartTag = 1;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState StartTag
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_StartTag();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState StartTag
      static void _set_StartTag(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState PI
      static constexpr const int PI = 2;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState PI
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_PI();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState PI
      static void _set_PI(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState CDATA
      static constexpr const int CDATA = 3;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState CDATA
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_CDATA();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState CDATA
      static void _set_CDATA(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Comment
      static constexpr const int Comment = 4;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Comment
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_Comment();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Comment
      static void _set_Comment(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Attributes
      static constexpr const int Attributes = 5;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Attributes
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_Attributes();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState Attributes
      static void _set_Attributes(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState AttributeValue
      static constexpr const int AttributeValue = 6;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState AttributeValue
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_AttributeValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState AttributeValue
      static void _set_AttributeValue(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadData
      static constexpr const int ReadData = 7;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadData
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_ReadData();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadData
      static void _set_ReadData(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState EndElement
      static constexpr const int EndElement = 8;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState EndElement
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_EndElement();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState EndElement
      static void _set_EndElement(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState End
      static constexpr const int End = 9;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState End
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_End();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState End
      static void _set_End(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadValueChunk_OnCachedValue
      static constexpr const int ReadValueChunk_OnCachedValue = 10;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadValueChunk_OnCachedValue
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_ReadValueChunk_OnCachedValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadValueChunk_OnCachedValue
      static void _set_ReadValueChunk_OnCachedValue(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadValueChunk_OnPartialValue
      static constexpr const int ReadValueChunk_OnPartialValue = 11;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadValueChunk_OnPartialValue
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_ReadValueChunk_OnPartialValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadValueChunk_OnPartialValue
      static void _set_ReadValueChunk_OnPartialValue(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_OnCachedValue
      static constexpr const int ReadContentAsBinary_OnCachedValue = 12;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_OnCachedValue
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_ReadContentAsBinary_OnCachedValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_OnCachedValue
      static void _set_ReadContentAsBinary_OnCachedValue(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_OnPartialValue
      static constexpr const int ReadContentAsBinary_OnPartialValue = 13;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_OnPartialValue
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_ReadContentAsBinary_OnPartialValue();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_OnPartialValue
      static void _set_ReadContentAsBinary_OnPartialValue(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // static field const value: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_End
      static constexpr const int ReadContentAsBinary_End = 14;
      // Get static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_End
      static ::System::Xml::XmlTextReaderImpl::IncrementalReadState _get_ReadContentAsBinary_End();
      // Set static field: static public System.Xml.XmlTextReaderImpl/IncrementalReadState ReadContentAsBinary_End
      static void _set_ReadContentAsBinary_End(::System::Xml::XmlTextReaderImpl::IncrementalReadState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // System.Xml.XmlTextReaderImpl/IncrementalReadState
    #pragma pack(pop)
    static check_size<sizeof(XmlTextReaderImpl::IncrementalReadState), 0 + sizeof(int)> __System_Xml_XmlTextReaderImpl_IncrementalReadStateSizeCheck;
    static_assert(sizeof(XmlTextReaderImpl::IncrementalReadState) == 0x4);
    // Size: 0x76
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: System.Xml.XmlTextReaderImpl/ParsingState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ParsingState/*, public ::System::ValueType*/ {
      public:
      public:
      // System.Char[] chars
      // Size: 0x8
      // Offset: 0x0
      ::ArrayW<::Il2CppChar> chars;
      // Field size check
      static_assert(sizeof(::ArrayW<::Il2CppChar>) == 0x8);
      // System.Int32 charPos
      // Size: 0x4
      // Offset: 0x8
      int charPos;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 charsUsed
      // Size: 0x4
      // Offset: 0xC
      int charsUsed;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Text.Encoding encoding
      // Size: 0x8
      // Offset: 0x10
      ::System::Text::Encoding* encoding;
      // Field size check
      static_assert(sizeof(::System::Text::Encoding*) == 0x8);
      // System.Boolean appendMode
      // Size: 0x1
      // Offset: 0x18
      bool appendMode;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: appendMode and: stream
      char __padding4[0x7] = {};
      // System.IO.Stream stream
      // Size: 0x8
      // Offset: 0x20
      ::System::IO::Stream* stream;
      // Field size check
      static_assert(sizeof(::System::IO::Stream*) == 0x8);
      // System.Text.Decoder decoder
      // Size: 0x8
      // Offset: 0x28
      ::System::Text::Decoder* decoder;
      // Field size check
      static_assert(sizeof(::System::Text::Decoder*) == 0x8);
      // System.Byte[] bytes
      // Size: 0x8
      // Offset: 0x30
      ::ArrayW<uint8_t> bytes;
      // Field size check
      static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
      // System.Int32 bytePos
      // Size: 0x4
      // Offset: 0x38
      int bytePos;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 bytesUsed
      // Size: 0x4
      // Offset: 0x3C
      int bytesUsed;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.IO.TextReader textReader
      // Size: 0x8
      // Offset: 0x40
      ::System::IO::TextReader* textReader;
      // Field size check
      static_assert(sizeof(::System::IO::TextReader*) == 0x8);
      // System.Int32 lineNo
      // Size: 0x4
      // Offset: 0x48
      int lineNo;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Int32 lineStartPos
      // Size: 0x4
      // Offset: 0x4C
      int lineStartPos;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.String baseUriStr
      // Size: 0x8
      // Offset: 0x50
      ::StringW baseUriStr;
      // Field size check
      static_assert(sizeof(::StringW) == 0x8);
      // System.Uri baseUri
      // Size: 0x8
      // Offset: 0x58
      ::System::Uri* baseUri;
      // Field size check
      static_assert(sizeof(::System::Uri*) == 0x8);
      // System.Boolean isEof
      // Size: 0x1
      // Offset: 0x60
      bool isEof;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Boolean isStreamEof
      // Size: 0x1
      // Offset: 0x61
      bool isStreamEof;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // Padding between fields: isStreamEof and: entity
      char __padding16[0x6] = {};
      // System.Xml.IDtdEntityInfo entity
      // Size: 0x8
      // Offset: 0x68
      ::System::Xml::IDtdEntityInfo* entity;
      // Field size check
      static_assert(sizeof(::System::Xml::IDtdEntityInfo*) == 0x8);
      // System.Int32 entityId
      // Size: 0x4
      // Offset: 0x70
      int entityId;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // System.Boolean eolNormalized
      // Size: 0x1
      // Offset: 0x74
      bool eolNormalized;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      // System.Boolean entityResolvedManually
      // Size: 0x1
      // Offset: 0x75
      bool entityResolvedManually;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: ParsingState
      constexpr ParsingState(::ArrayW<::Il2CppChar> chars_ = ::ArrayW<::Il2CppChar>(static_cast<void*>(nullptr)), int charPos_ = {}, int charsUsed_ = {}, ::System::Text::Encoding* encoding_ = {}, bool appendMode_ = {}, ::System::IO::Stream* stream_ = {}, ::System::Text::Decoder* decoder_ = {}, ::ArrayW<uint8_t> bytes_ = ::ArrayW<uint8_t>(static_cast<void*>(nullptr)), int bytePos_ = {}, int bytesUsed_ = {}, ::System::IO::TextReader* textReader_ = {}, int lineNo_ = {}, int lineStartPos_ = {}, ::StringW baseUriStr_ = {}, ::System::Uri* baseUri_ = {}, bool isEof_ = {}, bool isStreamEof_ = {}, ::System::Xml::IDtdEntityInfo* entity_ = {}, int entityId_ = {}, bool eolNormalized_ = {}, bool entityResolvedManually_ = {}) noexcept : chars{chars_}, charPos{charPos_}, charsUsed{charsUsed_}, encoding{encoding_}, appendMode{appendMode_}, stream{stream_}, decoder{decoder_}, bytes{bytes_}, bytePos{bytePos_}, bytesUsed{bytesUsed_}, textReader{textReader_}, lineNo{lineNo_}, lineStartPos{lineStartPos_}, baseUriStr{baseUriStr_}, baseUri{baseUri_}, isEof{isEof_}, isStreamEof{isStreamEof_}, entity{entity_}, entityId{entityId_}, eolNormalized{eolNormalized_}, entityResolvedManually{entityResolvedManually_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: System.Char[] chars
      [[deprecated("Use field access instead!")]] ::ArrayW<::Il2CppChar>& dyn_chars();
      // Get instance field reference: System.Int32 charPos
      [[deprecated("Use field access instead!")]] int& dyn_charPos();
      // Get instance field reference: System.Int32 charsUsed
      [[deprecated("Use field access instead!")]] int& dyn_charsUsed();
      // Get instance field reference: System.Text.Encoding encoding
      [[deprecated("Use field access instead!")]] ::System::Text::Encoding*& dyn_encoding();
      // Get instance field reference: System.Boolean appendMode
      [[deprecated("Use field access instead!")]] bool& dyn_appendMode();
      // Get instance field reference: System.IO.Stream stream
      [[deprecated("Use field access instead!")]] ::System::IO::Stream*& dyn_stream();
      // Get instance field reference: System.Text.Decoder decoder
      [[deprecated("Use field access instead!")]] ::System::Text::Decoder*& dyn_decoder();
      // Get instance field reference: System.Byte[] bytes
      [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn_bytes();
      // Get instance field reference: System.Int32 bytePos
      [[deprecated("Use field access instead!")]] int& dyn_bytePos();
      // Get instance field reference: System.Int32 bytesUsed
      [[deprecated("Use field access instead!")]] int& dyn_bytesUsed();
      // Get instance field reference: System.IO.TextReader textReader
      [[deprecated("Use field access instead!")]] ::System::IO::TextReader*& dyn_textReader();
      // Get instance field reference: System.Int32 lineNo
      [[deprecated("Use field access instead!")]] int& dyn_lineNo();
      // Get instance field reference: System.Int32 lineStartPos
      [[deprecated("Use field access instead!")]] int& dyn_lineStartPos();
      // Get instance field reference: System.String baseUriStr
      [[deprecated("Use field access instead!")]] ::StringW& dyn_baseUriStr();
      // Get instance field reference: System.Uri baseUri
      [[deprecated("Use field access instead!")]] ::System::Uri*& dyn_baseUri();
      // Get instance field reference: System.Boolean isEof
      [[deprecated("Use field access instead!")]] bool& dyn_isEof();
      // Get instance field reference: System.Boolean isStreamEof
      [[deprecated("Use field access instead!")]] bool& dyn_isStreamEof();
      // Get instance field reference: System.Xml.IDtdEntityInfo entity
      [[deprecated("Use field access instead!")]] ::System::Xml::IDtdEntityInfo*& dyn_entity();
      // Get instance field reference: System.Int32 entityId
      [[deprecated("Use field access instead!")]] int& dyn_entityId();
      // Get instance field reference: System.Boolean eolNormalized
      [[deprecated("Use field access instead!")]] bool& dyn_eolNormalized();
      // Get instance field reference: System.Boolean entityResolvedManually
      [[deprecated("Use field access instead!")]] bool& dyn_entityResolvedManually();
      // System.Void Clear()
      // Offset: 0xBD26A8
      void Clear();
      // System.Void Close(System.Boolean closeInput)
      // Offset: 0xBD26B0
      void Close(bool closeInput);
      // System.Int32 get_LineNo()
      // Offset: 0xBD26BC
      int get_LineNo();
      // System.Int32 get_LinePos()
      // Offset: 0xBD26C4
      int get_LinePos();
    }; // System.Xml.XmlTextReaderImpl/ParsingState
    #pragma pack(pop)
    static check_size<sizeof(XmlTextReaderImpl::ParsingState), 117 + sizeof(bool)> __System_Xml_XmlTextReaderImpl_ParsingStateSizeCheck;
    static_assert(sizeof(XmlTextReaderImpl::ParsingState) == 0x76);
    public:
    // private System.Xml.XmlTextReaderImpl/LaterInitParam laterInitParam
    // Size: 0x8
    // Offset: 0x10
    ::System::Xml::XmlTextReaderImpl::LaterInitParam* laterInitParam;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::LaterInitParam*) == 0x8);
    // private System.Xml.XmlCharType xmlCharType
    // Size: 0x8
    // Offset: 0x18
    ::System::Xml::XmlCharType xmlCharType;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlCharType) == 0x8);
    // private System.Xml.XmlTextReaderImpl/ParsingState ps
    // Size: 0x76
    // Offset: 0x20
    ::System::Xml::XmlTextReaderImpl::ParsingState ps;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::ParsingState) == 0x76);
    // Padding between fields: ps and: parsingFunction
    char __padding2[0x2] = {};
    // private System.Xml.XmlTextReaderImpl/ParsingFunction parsingFunction
    // Size: 0x4
    // Offset: 0x98
    ::System::Xml::XmlTextReaderImpl::ParsingFunction parsingFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::ParsingFunction) == 0x4);
    // private System.Xml.XmlTextReaderImpl/ParsingFunction nextParsingFunction
    // Size: 0x4
    // Offset: 0x9C
    ::System::Xml::XmlTextReaderImpl::ParsingFunction nextParsingFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::ParsingFunction) == 0x4);
    // private System.Xml.XmlTextReaderImpl/ParsingFunction nextNextParsingFunction
    // Size: 0x4
    // Offset: 0xA0
    ::System::Xml::XmlTextReaderImpl::ParsingFunction nextNextParsingFunction;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::ParsingFunction) == 0x4);
    // Padding between fields: nextNextParsingFunction and: nodes
    char __padding5[0x4] = {};
    // private System.Xml.XmlTextReaderImpl/NodeData[] nodes
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::System::Xml::XmlTextReaderImpl::NodeData*> nodes;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlTextReaderImpl::NodeData*>) == 0x8);
    // private System.Xml.XmlTextReaderImpl/NodeData curNode
    // Size: 0x8
    // Offset: 0xB0
    ::System::Xml::XmlTextReaderImpl::NodeData* curNode;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::NodeData*) == 0x8);
    // private System.Int32 index
    // Size: 0x4
    // Offset: 0xB8
    int index;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 curAttrIndex
    // Size: 0x4
    // Offset: 0xBC
    int curAttrIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 attrCount
    // Size: 0x4
    // Offset: 0xC0
    int attrCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 attrHashtable
    // Size: 0x4
    // Offset: 0xC4
    int attrHashtable;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 attrDuplWalkCount
    // Size: 0x4
    // Offset: 0xC8
    int attrDuplWalkCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean attrNeedNamespaceLookup
    // Size: 0x1
    // Offset: 0xCC
    bool attrNeedNamespaceLookup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean fullAttrCleanup
    // Size: 0x1
    // Offset: 0xCD
    bool fullAttrCleanup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fullAttrCleanup and: attrDuplSortingArray
    char __padding14[0x2] = {};
    // private System.Xml.XmlTextReaderImpl/NodeData[] attrDuplSortingArray
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::System::Xml::XmlTextReaderImpl::NodeData*> attrDuplSortingArray;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlTextReaderImpl::NodeData*>) == 0x8);
    // private System.Xml.XmlNameTable nameTable
    // Size: 0x8
    // Offset: 0xD8
    ::System::Xml::XmlNameTable* nameTable;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNameTable*) == 0x8);
    // private System.Xml.XmlResolver xmlResolver
    // Size: 0x8
    // Offset: 0xE0
    ::System::Xml::XmlResolver* xmlResolver;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlResolver*) == 0x8);
    // private System.String url
    // Size: 0x8
    // Offset: 0xE8
    ::StringW url;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean normalize
    // Size: 0x1
    // Offset: 0xF0
    bool normalize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean supportNamespaces
    // Size: 0x1
    // Offset: 0xF1
    bool supportNamespaces;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: supportNamespaces and: whitespaceHandling
    char __padding20[0x2] = {};
    // private System.Xml.WhitespaceHandling whitespaceHandling
    // Size: 0x4
    // Offset: 0xF4
    ::System::Xml::WhitespaceHandling whitespaceHandling;
    // Field size check
    static_assert(sizeof(::System::Xml::WhitespaceHandling) == 0x4);
    // private System.Xml.DtdProcessing dtdProcessing
    // Size: 0x4
    // Offset: 0xF8
    ::System::Xml::DtdProcessing dtdProcessing;
    // Field size check
    static_assert(sizeof(::System::Xml::DtdProcessing) == 0x4);
    // private System.Xml.EntityHandling entityHandling
    // Size: 0x4
    // Offset: 0xFC
    ::System::Xml::EntityHandling entityHandling;
    // Field size check
    static_assert(sizeof(::System::Xml::EntityHandling) == 0x4);
    // private System.Boolean ignorePIs
    // Size: 0x1
    // Offset: 0x100
    bool ignorePIs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ignoreComments
    // Size: 0x1
    // Offset: 0x101
    bool ignoreComments;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean checkCharacters
    // Size: 0x1
    // Offset: 0x102
    bool checkCharacters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean closeInput
    // Size: 0x1
    // Offset: 0x103
    bool closeInput;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: closeInput and: maxCharactersInDocument
    char __padding27[0x4] = {};
    // private System.Int64 maxCharactersInDocument
    // Size: 0x8
    // Offset: 0x108
    int64_t maxCharactersInDocument;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 maxCharactersFromEntities
    // Size: 0x8
    // Offset: 0x110
    int64_t maxCharactersFromEntities;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean v1Compat
    // Size: 0x1
    // Offset: 0x118
    bool v1Compat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: v1Compat and: namespaceManager
    char __padding30[0x7] = {};
    // private System.Xml.XmlNamespaceManager namespaceManager
    // Size: 0x8
    // Offset: 0x120
    ::System::Xml::XmlNamespaceManager* namespaceManager;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNamespaceManager*) == 0x8);
    // private System.String lastPrefix
    // Size: 0x8
    // Offset: 0x128
    ::StringW lastPrefix;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Xml.XmlTextReaderImpl/XmlContext xmlContext
    // Size: 0x8
    // Offset: 0x130
    ::System::Xml::XmlTextReaderImpl::XmlContext* xmlContext;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::XmlContext*) == 0x8);
    // private System.Xml.XmlTextReaderImpl/ParsingState[] parsingStatesStack
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::System::Xml::XmlTextReaderImpl::ParsingState> parsingStatesStack;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Xml::XmlTextReaderImpl::ParsingState>) == 0x8);
    // private System.Int32 parsingStatesStackTop
    // Size: 0x4
    // Offset: 0x140
    int parsingStatesStackTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: parsingStatesStackTop and: reportedBaseUri
    char __padding35[0x4] = {};
    // private System.String reportedBaseUri
    // Size: 0x8
    // Offset: 0x148
    ::StringW reportedBaseUri;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Text.Encoding reportedEncoding
    // Size: 0x8
    // Offset: 0x150
    ::System::Text::Encoding* reportedEncoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // private System.Xml.IDtdInfo dtdInfo
    // Size: 0x8
    // Offset: 0x158
    ::System::Xml::IDtdInfo* dtdInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::IDtdInfo*) == 0x8);
    // private System.Xml.XmlNodeType fragmentType
    // Size: 0x4
    // Offset: 0x160
    ::System::Xml::XmlNodeType fragmentType;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlNodeType) == 0x4);
    // Padding between fields: fragmentType and: fragmentParserContext
    char __padding39[0x4] = {};
    // private System.Xml.XmlParserContext fragmentParserContext
    // Size: 0x8
    // Offset: 0x168
    ::System::Xml::XmlParserContext* fragmentParserContext;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlParserContext*) == 0x8);
    // private System.Xml.IncrementalReadDecoder incReadDecoder
    // Size: 0x8
    // Offset: 0x170
    ::System::Xml::IncrementalReadDecoder* incReadDecoder;
    // Field size check
    static_assert(sizeof(::System::Xml::IncrementalReadDecoder*) == 0x8);
    // private System.Xml.XmlTextReaderImpl/IncrementalReadState incReadState
    // Size: 0x4
    // Offset: 0x178
    ::System::Xml::XmlTextReaderImpl::IncrementalReadState incReadState;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::IncrementalReadState) == 0x4);
    // private System.Xml.LineInfo incReadLineInfo
    // Size: 0x8
    // Offset: 0x17C
    ::System::Xml::LineInfo incReadLineInfo;
    // Field size check
    static_assert(sizeof(::System::Xml::LineInfo) == 0x8);
    // private System.Int32 incReadDepth
    // Size: 0x4
    // Offset: 0x184
    int incReadDepth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 incReadLeftStartPos
    // Size: 0x4
    // Offset: 0x188
    int incReadLeftStartPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 incReadLeftEndPos
    // Size: 0x4
    // Offset: 0x18C
    int incReadLeftEndPos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 attributeValueBaseEntityId
    // Size: 0x4
    // Offset: 0x190
    int attributeValueBaseEntityId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean emptyEntityInAttributeResolved
    // Size: 0x1
    // Offset: 0x194
    bool emptyEntityInAttributeResolved;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: emptyEntityInAttributeResolved and: validationEventHandling
    char __padding48[0x3] = {};
    // private System.Xml.IValidationEventHandling validationEventHandling
    // Size: 0x8
    // Offset: 0x198
    ::System::Xml::IValidationEventHandling* validationEventHandling;
    // Field size check
    static_assert(sizeof(::System::Xml::IValidationEventHandling*) == 0x8);
    // private System.Xml.XmlTextReaderImpl/OnDefaultAttributeUseDelegate onDefaultAttributeUse
    // Size: 0x8
    // Offset: 0x1A0
    ::System::Xml::XmlTextReaderImpl::OnDefaultAttributeUseDelegate* onDefaultAttributeUse;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::OnDefaultAttributeUseDelegate*) == 0x8);
    // private System.Boolean validatingReaderCompatFlag
    // Size: 0x1
    // Offset: 0x1A8
    bool validatingReaderCompatFlag;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean addDefaultAttributesAndNormalize
    // Size: 0x1
    // Offset: 0x1A9
    bool addDefaultAttributesAndNormalize;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: addDefaultAttributesAndNormalize and: stringBuilder
    char __padding52[0x6] = {};
    // private System.Text.StringBuilder stringBuilder
    // Size: 0x8
    // Offset: 0x1B0
    ::System::Text::StringBuilder* stringBuilder;
    // Field size check
    static_assert(sizeof(::System::Text::StringBuilder*) == 0x8);
    // private System.Boolean rootElementParsed
    // Size: 0x1
    // Offset: 0x1B8
    bool rootElementParsed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean standalone
    // Size: 0x1
    // Offset: 0x1B9
    bool standalone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: standalone and: nextEntityId
    char __padding55[0x2] = {};
    // private System.Int32 nextEntityId
    // Size: 0x4
    // Offset: 0x1BC
    int nextEntityId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Xml.XmlTextReaderImpl/ParsingMode parsingMode
    // Size: 0x4
    // Offset: 0x1C0
    ::System::Xml::XmlTextReaderImpl::ParsingMode parsingMode;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlTextReaderImpl::ParsingMode) == 0x4);
    // private System.Xml.ReadState readState
    // Size: 0x4
    // Offset: 0x1C4
    ::System::Xml::ReadState readState;
    // Field size check
    static_assert(sizeof(::System::Xml::ReadState) == 0x4);
    // private System.Xml.IDtdEntityInfo lastEntity
    // Size: 0x8
    // Offset: 0x1C8
    ::System::Xml::IDtdEntityInfo* lastEntity;
    // Field size check
    static_assert(sizeof(::System::Xml::IDtdEntityInfo*) == 0x8);
    // private System.Boolean afterResetState
    // Size: 0x1
    // Offset: 0x1D0
    bool afterResetState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: afterResetState and: documentStartBytePos
    char __padding60[0x3] = {};
    // private System.Int32 documentStartBytePos
    // Size: 0x4
    // Offset: 0x1D4
    int documentStartBytePos;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 readValueOffset
    // Size: 0x4
    // Offset: 0x1D8
    int readValueOffset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: readValueOffset and: charactersInDocument
    char __padding62[0x4] = {};
    // private System.Int64 charactersInDocument
    // Size: 0x8
    // Offset: 0x1E0
    int64_t charactersInDocument;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 charactersFromEntities
    // Size: 0x8
    // Offset: 0x1E8
    int64_t charactersFromEntities;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Xml.IDtdEntityInfo,System.Xml.IDtdEntityInfo> currentEntities
    // Size: 0x8
    // Offset: 0x1F0
    ::System::Collections::Generic::Dictionary_2<::System::Xml::IDtdEntityInfo*, ::System::Xml::IDtdEntityInfo*>* currentEntities;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::System::Xml::IDtdEntityInfo*, ::System::Xml::IDtdEntityInfo*>*) == 0x8);
    // private System.Boolean disableUndeclaredEntityCheck
    // Size: 0x1
    // Offset: 0x1F8
    bool disableUndeclaredEntityCheck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableUndeclaredEntityCheck and: outerReader
    char __padding66[0x7] = {};
    // private System.Xml.XmlReader outerReader
    // Size: 0x8
    // Offset: 0x200
    ::System::Xml::XmlReader* outerReader;
    // Field size check
    static_assert(sizeof(::System::Xml::XmlReader*) == 0x8);
    // private System.Boolean xmlResolverIsSet
    // Size: 0x1
    // Offset: 0x208
    bool xmlResolverIsSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: xmlResolverIsSet and: Xml
    char __padding68[0x7] = {};
    // private System.String Xml
    // Size: 0x8
    // Offset: 0x210
    ::StringW Xml;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String XmlNs
    // Size: 0x8
    // Offset: 0x218
    ::StringW XmlNs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Threading.Tasks.Task`1<System.Tuple`4<System.Int32,System.Int32,System.Int32,System.Boolean>> parseText_dummyTask
    // Size: 0x8
    // Offset: 0x220
    ::System::Threading::Tasks::Task_1<::System::Tuple_4<int, int, int, bool>*>* parseText_dummyTask;
    // Field size check
    static_assert(sizeof(::System::Threading::Tasks::Task_1<::System::Tuple_4<int, int, int, bool>*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::Xml::IXmlLineInfo
    operator ::System::Xml::IXmlLineInfo() noexcept {
      return *reinterpret_cast<::System::Xml::IXmlLineInfo*>(this);
    }
    // Creating interface conversion operator: operator ::System::Xml::IXmlNamespaceResolver
    operator ::System::Xml::IXmlNamespaceResolver() noexcept {
