// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ActionOpenWardrobe
  class ActionOpenWardrobe;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ActionOpenWardrobe);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ActionOpenWardrobe*, "MagicalActual", "ActionOpenWardrobe");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x5D
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ActionOpenWardrobe
  // [TokenAttribute] Offset: FFFFFFFF
  class ActionOpenWardrobe : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::ActionOpenWardrobe::$InvokeWardrobeOpened$d__15
    class $InvokeWardrobeOpened$d__15;
    // Nested type: ::MagicalActual::ActionOpenWardrobe::$InvokeWardrobeClosed$d__16
    class $InvokeWardrobeClosed$d__16;
    public:
    // public UnityEngine.Transform leftDoor
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* leftDoor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightDoor
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* rightDoor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform leftHinge
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* leftHinge;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform rightHinge
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* rightHinge;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Events.UnityEvent OnWardrobeOpened
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Events::UnityEvent* OnWardrobeOpened;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent OnWardrobeClosed
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Events::UnityEvent* OnWardrobeClosed;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // private MagicalActual.Grabber CLHMLLOPNJM
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::Grabber* CLHMLLOPNJM;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private PhysicsInteractable NENLBJKDCFP
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::PhysicsInteractable* NENLBJKDCFP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private System.Single DKFENFBLLCP
    // Size: 0x4
    // Offset: 0x58
    float DKFENFBLLCP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean JPAJDCHLNIN
    // Size: 0x1
    // Offset: 0x5C
    bool JPAJDCHLNIN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Transform leftDoor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_leftDoor();
    // Get instance field reference: public UnityEngine.Transform rightDoor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_rightDoor();
    // Get instance field reference: public UnityEngine.Transform leftHinge
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_leftHinge();
    // Get instance field reference: public UnityEngine.Transform rightHinge
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_rightHinge();
