// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: AirshipBoss2
  class AirshipBoss2;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::AirshipBoss2);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::AirshipBoss2*, "MagicalActual", "AirshipBoss2");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.AirshipBoss2
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD2B7C
  class AirshipBoss2 : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x1A0B9E0
    void KBDGAPMJGLG();
    // public System.Void JOGPGAPOBBK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0BA38
    void JOGPGAPOBBK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0BA40
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KMPPLBBIMGJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0BA48
    void KMPPLBBIMGJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void GHHAMAIIFFG()
    // Offset: 0x1A0BA50
    void GHHAMAIIFFG();
    // public System.Void KIBDAOLFNJM()
    // Offset: 0x1A0BC74
    void KIBDAOLFNJM();
    // public System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0BE98
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void DBOKLBMPMJO()
    // Offset: 0x1A0BEA0
    void DBOKLBMPMJO();
    // public System.Void NEMKNLGDEAK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0C0C4
    void NEMKNLGDEAK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0C0CC
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GHLPBOJJHNG()
    // Offset: 0x1A0C0D4
    void GHLPBOJJHNG();
    // private System.Void LAHJCBEJCMJ()
    // Offset: 0x1A0C12C
    void LAHJCBEJCMJ();
    // public System.Void ALKHPPEDLNC()
    // Offset: 0x1A0C184
    void ALKHPPEDLNC();
    // public System.Void HMCPNNAOPLG()
    // Offset: 0x1A0C3A4
    void HMCPNNAOPLG();
    // public System.Void OIFODAPCBMD(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0C5C8
    void OIFODAPCBMD(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GPFBGGFPINB()
    // Offset: 0x1A0C5D0
    void GPFBGGFPINB();
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x1A0C628
    void AHPDCIGFMJI();
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0C680
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JMPBEJDKDGJ()
    // Offset: 0x1A0C688
    void JMPBEJDKDGJ();
    // public System.Void OGALJHFFLHP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0C8AC
    void OGALJHFFLHP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BDEDGNGMHMN()
    // Offset: 0x1A0C8B4
    void BDEDGNGMHMN();
    // private System.Void APMNGLNBFNP()
    // Offset: 0x1A0C90C
    void APMNGLNBFNP();
    // private System.Void NNDKJCJFIAK()
    // Offset: 0x1A0C964
    void NNDKJCJFIAK();
    // public System.Void DPFCHCEODPP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0C9BC
    void DPFCHCEODPP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void DKILGFBCKHD()
    // Offset: 0x1A0C9C4
    void DKILGFBCKHD();
    // public System.Void Slash()
    // Offset: 0x1A0CBE8
    void Slash();
    // private System.Void IDOCJGNLNFL()
    // Offset: 0x1A0CE00
    void IDOCJGNLNFL();
    // private System.Void Start()
    // Offset: 0x1A0CE58
    void Start();
    // private System.Void FBONHOOJHBG()
    // Offset: 0x1A0CEB0
    void FBONHOOJHBG();
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0CF08
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EIHONBBKDNH(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0CF10
    void EIHONBBKDNH(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void DKDBFFDLADP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0CF18
    void DKDBFFDLADP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HJADIOCKECN()
    // Offset: 0x1A0CF20
    void HJADIOCKECN();
    // public System.Void MKAECMFKIEN()
    // Offset: 0x1A0D144
    void MKAECMFKIEN();
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0D368
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KGNNMOBOEFG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0D370
    void KGNNMOBOEFG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EBKMGINMPPJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0D378
    void EBKMGINMPPJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void .ctor()
    // Offset: 0x1A0D380
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AirshipBoss2* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::AirshipBoss2::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AirshipBoss2*, creationType>()));
    }
    // public System.Void FNMKMDHHFDG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0D3D8
    void FNMKMDHHFDG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void PBEMGGBBDCK()
    // Offset: 0x1A0D3E0
    void PBEMGGBBDCK();
    // private System.Void GKIOLADOCOK()
    // Offset: 0x1A0D438
    void GKIOLADOCOK();
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x1A0D490
    void LPLGKBGLPOK();
    // public System.Void HMKJKOKPOBP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0D4E8
    void HMKJKOKPOBP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JCOFJKJMOAA()
    // Offset: 0x1A0D4F0
    void JCOFJKJMOAA();
  }; // MagicalActual.AirshipBoss2
  #pragma pack(pop)
  static check_size<sizeof(AirshipBoss2), 48 + sizeof(::MagicalActual::NetEntity*)> __MagicalActual_AirshipBoss2SizeCheck;
  static_assert(sizeof(AirshipBoss2) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::AirshipBoss2::KBDGAPMJGLG
// Il2CppName: KBDGAPMJGLG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::AirshipBoss2::*)()>(&MagicalActual::AirshipBoss2::KBDGAPMJGLG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::AirshipBoss2*), "KBDGAPMJGLG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::AirshipBoss2::JOGPGAPOBBK
// Il2CppName: JOGPGAPOBBK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::AirshipBoss2::*)(::MagicalActual::NetEntity*)>(&MagicalActual::AirshipBoss2::JOGPGAPOBBK)> {
  static const MethodInfo* get() {
