// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: AirshipBoss1
  class AirshipBoss1;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::AirshipBoss1);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::AirshipBoss1*, "MagicalActual", "AirshipBoss1");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x42
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.AirshipBoss1
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD2B18
  class AirshipBoss1 : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject BlastBeam
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* BlastBeam;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean BAKECNCGMGK
    // Size: 0x1
    // Offset: 0x40
    bool BAKECNCGMGK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean JGJMFMOMKGC
    // Size: 0x1
    // Offset: 0x41
    bool JGJMFMOMKGC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: public UnityEngine.GameObject BlastBeam
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_BlastBeam();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean BAKECNCGMGK
    [[deprecated("Use field access instead!")]] bool& dyn_BAKECNCGMGK();
    // Get instance field reference: private System.Boolean JGJMFMOMKGC
    [[deprecated("Use field access instead!")]] bool& dyn_JGJMFMOMKGC();
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x1A08648
    void LPLGKBGLPOK();
    // private System.Void CILLLGMPJLL(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A086A0
    void CILLLGMPJLL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void NDIOGMHPDBA(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A08774
    void NDIOGMHPDBA(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void EMLNDEDHAAA(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A088A4
    void EMLNDEDHAAA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A08978
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void CBONELJOGDI(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A08A90
    void CBONELJOGDI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void AKGFEENGKJD()
    // Offset: 0x1A08B64
    void AKGFEENGKJD();
    // public System.Void JOGPGAPOBBK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A08BBC
    void JOGPGAPOBBK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BMJNBLJPOCF(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A08CD4
    void BMJNBLJPOCF(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void IPIFMKAGODD()
    // Offset: 0x1A08E04
    void IPIFMKAGODD();
    // private System.Void NDIPBNMHABE(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A08E5C
    void NDIPBNMHABE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void Start()
    // Offset: 0x1A08F8C
    void Start();
    // public System.Void JMPBEJDKDGJ()
    // Offset: 0x1A08FE4
    void JMPBEJDKDGJ();
    // private System.Void BIAJGOGJGNC(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09208
    void BIAJGOGJGNC(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void .ctor()
    // Offset: 0x1A09338
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AirshipBoss1* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::AirshipBoss1::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AirshipBoss1*, creationType>()));
    }
    // private System.Void HPLMDBLBIGA(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09390
    void HPLMDBLBIGA(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void ELPKOLBFKKH(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09464
    void ELPKOLBFKKH(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void MDHBNHLHENF(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09538
    void MDHBNHLHENF(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void CEPPICBNJOI()
    // Offset: 0x1A0960C
    void CEPPICBNJOI();
    // private System.Void NHADFEMILCC()
    // Offset: 0x1A09830
    void NHADFEMILCC();
    // private System.Void KPMPBDPHIJO(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09888
    void KPMPBDPHIJO(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void MMGEIKLBBOH()
    // Offset: 0x1A099B8
    void MMGEIKLBBOH();
    // private System.Void HKINNMLBMMG()
    // Offset: 0x1A09BDC
    void HKINNMLBMMG();
    // private System.Void HDECGNCPMOL(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09C34
    void HDECGNCPMOL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void JCAOFFAOBEL(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09D64
    void JCAOFFAOBEL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void CKDOIDHFJDD(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A09E94
    void CKDOIDHFJDD(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JFKKFKNHPFI()
    // Offset: 0x1A09FC4
    void JFKKFKNHPFI();
    // public System.Void MKAECMFKIEN()
    // Offset: 0x1A0A1E4
    void MKAECMFKIEN();
    // private System.Void JNHNEBOHOIB()
    // Offset: 0x1A0A408
    void JNHNEBOHOIB();
    // private System.Void JCILGILFANJ(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A0A460
    void JCILGILFANJ(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void FNMKMDHHFDG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0A590
    void FNMKMDHHFDG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void CCOODLILKJD()
    // Offset: 0x1A0A6A8
    void CCOODLILKJD();
    // public System.Void BGDHCACNDCK()
    // Offset: 0x1A0A8C8
    void BGDHCACNDCK();
    // public System.Void DBOKLBMPMJO()
    // Offset: 0x1A0AAE8
    void DBOKLBMPMJO();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0AD0C
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void ECHEDMMOOAN(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A0AE24
    void ECHEDMMOOAN(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void CIGIPMPLKGF()
    // Offset: 0x1A0AEF8
    void CIGIPMPLKGF();
    // public System.Void GHHAMAIIFFG()
    // Offset: 0x1A0B11C
    void GHHAMAIIFFG();
    // public System.Void AMBHFINDKPK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0B340
    void AMBHFINDKPK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void Slash()
    // Offset: 0x1A0B458
    void Slash();
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A0B670
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x1A0B788
    void FGIFGGNGKPK();
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x1A0B7E0
    void EPCHNEGNKNF();
    // private System.Void KKHNPLBMOCO(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A0B838
    void KKHNPLBMOCO(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void ELGMEGGIOCL(System.Object OMLPNCLFFMJ)
    // Offset: 0x1A0B90C
    void ELGMEGGIOCL(::Il2CppObject* OMLPNCLFFMJ);
  }; // MagicalActual.AirshipBoss1
  #pragma pack(pop)
  static check_size<sizeof(AirshipBoss1), 65 + sizeof(bool)> __MagicalActual_AirshipBoss1SizeCheck;
  static_assert(sizeof(AirshipBoss1) == 0x42);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::AirshipBoss1::LPLGKBGLPOK
// Il2CppName: LPLGKBGLPOK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::AirshipBoss1::*)()>(&MagicalActual::AirshipBoss1::LPLGKBGLPOK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::AirshipBoss1*), "LPLGKBGLPOK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::AirshipBoss1::CILLLGMPJLL
// Il2CppName: CILLLGMPJLL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::AirshipBoss1::*)(::Il2CppObject*)>(&MagicalActual::AirshipBoss1::CILLLGMPJLL)> {
  static const MethodInfo* get() {
    static auto* OMLPNCLFFMJ = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
