// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: AlchemyStationEmptyBottle
  class AlchemyStationEmptyBottle;
  // Forward declaring type: GenericChest
  class GenericChest;
  // Forward declaring type: ItemContainer
  class ItemContainer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Material
  class Material;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: AlchemyStation
  class AlchemyStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::AlchemyStation);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::AlchemyStation*, "MagicalActual", "AlchemyStation");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x109
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.AlchemyStation
  // [TokenAttribute] Offset: FFFFFFFF
  class AlchemyStation : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::AlchemyStation::$$c__DisplayClass31_0
    class $$c__DisplayClass31_0;
    // Nested type: ::MagicalActual::AlchemyStation::$$c
    class $$c;
    public:
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.GameObject ingredientPrefab
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* ingredientPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject[] ingredientSlots
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::GameObject*> ingredientSlots;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject emptySlot
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* emptySlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject emptyBottlePrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* emptyBottlePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.AlchemyStationEmptyBottle PMBCJCKFLAK
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::AlchemyStationEmptyBottle* PMBCJCKFLAK;
    // Field size check
    static_assert(sizeof(::MagicalActual::AlchemyStationEmptyBottle*) == 0x8);
    // public MagicalActual.GenericChest myChest
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::GenericChest* myChest;
    // Field size check
    static_assert(sizeof(::MagicalActual::GenericChest*) == 0x8);
    // private ExtUI.InventoryItemInstance[] CNCDEHCLCGP
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::ExtUI::InventoryItemInstance*> CNCDEHCLCGP;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.Vector3 IGOEOPNBIGI
    // Size: 0xC
    // Offset: 0x60
    ::UnityEngine::Vector3 IGOEOPNBIGI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: IGOEOPNBIGI and: LNABACFKNBA
    char __padding9[0x4] = {};
    // private MagicalActual.ItemContainer LNABACFKNBA
    // Size: 0x8
    // Offset: 0x70
    ::MagicalActual::ItemContainer* LNABACFKNBA;
    // Field size check
    static_assert(sizeof(::MagicalActual::ItemContainer*) == 0x8);
    // public UnityEngine.GameObject myPotLiquid
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* myPotLiquid;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Material GPBDOGLEDBK
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Material* GPBDOGLEDBK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.GameObject ingredientAddedVfx
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* ingredientAddedVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject heatIncreasedVfx
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* heatIncreasedVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject FadeUpTextPrefab
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* FadeUpTextPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Color ONHIKLAKLLO
    // Size: 0x10
    // Offset: 0xA0
    ::UnityEngine::Color ONHIKLAKLLO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color OPODONGHBHF
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Color OPODONGHBHF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color ADKOIAPEMNO
    // Size: 0x10
    // Offset: 0xC0
    ::UnityEngine::Color ADKOIAPEMNO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color GICNIKNKKLK
    // Size: 0x10
    // Offset: 0xD0
    ::UnityEngine::Color GICNIKNKKLK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color MBKDBELPIMB
    // Size: 0x10
    // Offset: 0xE0
    ::UnityEngine::Color MBKDBELPIMB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.GameObject vfxCraftSuccess
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::GameObject* vfxCraftSuccess;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean BCMGLAKDLKM
    // Size: 0x1
    // Offset: 0xF8
    bool BCMGLAKDLKM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BCMGLAKDLKM and: OrbusNetComponent
    char __padding22[0x7] = {};
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x100
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Byte ECNCNIHJMPL
    // Size: 0x1
    // Offset: 0x108
    uint8_t ECNCNIHJMPL;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public UnityEngine.GameObject ingredientPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_ingredientPrefab();
    // Get instance field reference: public UnityEngine.GameObject[] ingredientSlots
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_ingredientSlots();
    // Get instance field reference: public UnityEngine.GameObject emptySlot
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_emptySlot();
