// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: AmbientLightChange
  class AmbientLightChange;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::AmbientLightChange);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::AmbientLightChange*, "MagicalActual", "AmbientLightChange");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.AmbientLightChange
  // [TokenAttribute] Offset: FFFFFFFF
  class AmbientLightChange : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [ColorUsageAttribute] Offset: 0xAE5260
    // private UnityEngine.Color ambientLight
    // Size: 0x10
    // Offset: 0x18
    ::UnityEngine::Color ambientLight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single lerpTime
    // Size: 0x4
    // Offset: 0x28
    float lerpTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean disableOverworldDirectionLight
    // Size: 0x1
    // Offset: 0x2C
    bool disableOverworldDirectionLight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableOverworldDirectionLight and: IJBOKNNNKDM
    char __padding2[0x3] = {};
    // private System.Single IJBOKNNNKDM
    // Size: 0x4
    // Offset: 0x30
    float IJBOKNNNKDM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ABCNGPJLGFO
    // Size: 0x4
    // Offset: 0x34
    float ABCNGPJLGFO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OEKGIJLKGJO
    // Size: 0x4
    // Offset: 0x38
    float OEKGIJLKGJO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BNCEKCOLLIB
    // Size: 0x4
    // Offset: 0x3C
    float BNCEKCOLLIB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color KPFMIMKCEFM
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Color KPFMIMKCEFM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color KFLMKMPFLMB
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Color KFLMKMPFLMB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean OHFIPEGMGHA
    // Size: 0x1
    // Offset: 0x60
    bool OHFIPEGMGHA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean JIODMGKMDNL
    // Size: 0x1
    // Offset: 0x61
    bool JIODMGKMDNL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IEAINLLJHOD
    // Size: 0x1
    // Offset: 0x62
    bool IEAINLLJHOD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IEAINLLJHOD and: OKKAKDLGJKE
    char __padding11[0x1] = {};
    // private System.Single OKKAKDLGJKE
    // Size: 0x4
    // Offset: 0x64
    float OKKAKDLGJKE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String BHHGMPLHEDC
    // Size: 0x8
    // Offset: 0x68
    ::StringW BHHGMPLHEDC;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Collider BBOMOHLELBB
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Collider* BBOMOHLELBB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Color ambientLight
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_ambientLight();
    // Get instance field reference: private System.Single lerpTime
    [[deprecated("Use field access instead!")]] float& dyn_lerpTime();
    // Get instance field reference: private System.Boolean disableOverworldDirectionLight
    [[deprecated("Use field access instead!")]] bool& dyn_disableOverworldDirectionLight();
    // Get instance field reference: private System.Single IJBOKNNNKDM
    [[deprecated("Use field access instead!")]] float& dyn_IJBOKNNNKDM();
    // Get instance field reference: private System.Single ABCNGPJLGFO
