// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: AncientGuardianPillar
  class AncientGuardianPillar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::AncientGuardianPillar);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::AncientGuardianPillar*, "MagicalActual", "AncientGuardianPillar");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.AncientGuardianPillar
  // [TokenAttribute] Offset: FFFFFFFF
  class AncientGuardianPillar : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Int32 OJKDMMCAKLH
    // Size: 0x4
    // Offset: 0x28
    int OJKDMMCAKLH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: OJKDMMCAKLH and: PillarRenderer
    char __padding2[0x4] = {};
    // private UnityEngine.Renderer PillarRenderer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Renderer* PillarRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // private UnityEngine.Color[] PillarColors
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Color> PillarColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Int32 OJKDMMCAKLH
    [[deprecated("Use field access instead!")]] int& dyn_OJKDMMCAKLH();
    // Get instance field reference: private UnityEngine.Renderer PillarRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Renderer*& dyn_PillarRenderer();
    // Get instance field reference: private UnityEngine.Color[] PillarColors
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Color>& dyn_PillarColors();
    // private System.Void PNHFNDALJFD(System.Int32 DILIPIOBIJI)
    // Offset: 0x10AD99C
    void PNHFNDALJFD(int DILIPIOBIJI);
    // private System.Void IMFHAIGPGLB(System.Int32 DILIPIOBIJI)
    // Offset: 0x10ADB10
    void IMFHAIGPGLB(int DILIPIOBIJI);
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x10ADC84
    void KBDGAPMJGLG();
    // private System.Void NCBPNBCLMEK(System.Object OMLPNCLFFMJ)
    // Offset: 0x10ADC88
    void NCBPNBCLMEK(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void NHADFEMILCC()
    // Offset: 0x10ADE68
    void NHADFEMILCC();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10ADE6C
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AKGFEENGKJD()
    // Offset: 0x10ADF20
    void AKGFEENGKJD();
    // private System.Void COJFJIMFEBA(System.Object OMLPNCLFFMJ)
    // Offset: 0x10ADF24
    void COJFJIMFEBA(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FDDJFLPDGGI(System.Int32 DILIPIOBIJI)
    // Offset: 0x10AE104
    void FDDJFLPDGGI(int DILIPIOBIJI);
    // private System.Void EFHKLJOIDPP(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AE278
    void EFHKLJOIDPP(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x10AE458
    void EPCHNEGNKNF();
    // public System.Void AGKHMBHBNFM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10AE45C
    void AGKHMBHBNFM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JOCIAJOCGNM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10AE510
    void JOCIAJOCGNM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void .ctor()
    // Offset: 0x10AE5C4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AncientGuardianPillar* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::AncientGuardianPillar::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AncientGuardianPillar*, creationType>()));
    }
    // public System.Void KGNNMOBOEFG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10AE61C
    void KGNNMOBOEFG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void HKLCBAMMNAH(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AE6D0
    void HKLCBAMMNAH(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void BGGAAEANGPB(System.Int32 DILIPIOBIJI)
    // Offset: 0x10AE2E4
    void BGGAAEANGPB(int DILIPIOBIJI);
    // private System.Void HMMEKLJLHLK(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AE8B0
    void HMMEKLJLHLK(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10AE91C
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GHLPBOJJHNG()
    // Offset: 0x10AE9D0
    void GHLPBOJJHNG();
    // private System.Void MKNFEMPNILC(System.Int32 DILIPIOBIJI)
    // Offset: 0x10ADF90
    void MKNFEMPNILC(int DILIPIOBIJI);
    // private System.Void GHFMKNIAPDF(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AE9D4
    void GHFMKNIAPDF(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void AEBAMIGEFGN(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AEBB4
    void AEBAMIGEFGN(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void BLBKOOGJNBB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10AEC20
    void BLBKOOGJNBB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void OIPLBADJHFI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x10AECD4
    void OIPLBADJHFI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void Start()
    // Offset: 0x10AED88
    void Start();
    // private System.Void KNAMOILBIJI(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AED8C
    void KNAMOILBIJI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void LPNIEGJAHHM(System.Int32 DILIPIOBIJI)
    // Offset: 0x10ADCF4
    void LPNIEGJAHHM(int DILIPIOBIJI);
    // private System.Void NIDINKFMFIJ(System.Int32 DILIPIOBIJI)
    // Offset: 0x10AEDF8
    void NIDINKFMFIJ(int DILIPIOBIJI);
    // private System.Void ODMKIBNBDIH(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AEF6C
    void ODMKIBNBDIH(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void IDLOFFGDFFC(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AEFD8
    void IDLOFFGDFFC(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void ILONIHDFOEB(System.Int32 DILIPIOBIJI)
    // Offset: 0x10AE73C
    void ILONIHDFOEB(int DILIPIOBIJI);
    // private System.Void KCEONPCFEBC(System.Int32 DILIPIOBIJI)
    // Offset: 0x10AEA40
    void KCEONPCFEBC(int DILIPIOBIJI);
    // private System.Void GPFBGGFPINB()
    // Offset: 0x10AF044
    void GPFBGGFPINB();
    // private System.Void NEDFCIDMJBB()
    // Offset: 0x10AF048
    void NEDFCIDMJBB();
    // private System.Void PAGBFLDHAGF(System.Object OMLPNCLFFMJ)
    // Offset: 0x10AF04C
    void PAGBFLDHAGF(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void APIMIOELFAJ()
    // Offset: 0x10AF0B8
    void APIMIOELFAJ();
  }; // MagicalActual.AncientGuardianPillar
  #pragma pack(pop)
  static check_size<sizeof(AncientGuardianPillar), 56 + sizeof(::ArrayW<::UnityEngine::Color>)> __MagicalActual_AncientGuardianPillarSizeCheck;
  static_assert(sizeof(AncientGuardianPillar) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::AncientGuardianPillar::PNHFNDALJFD
// Il2CppName: PNHFNDALJFD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::AncientGuardianPillar::*)(int)>(&MagicalActual::AncientGuardianPillar::PNHFNDALJFD)> {
  static const MethodInfo* get() {
    static auto* DILIPIOBIJI = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::AncientGuardianPillar*), "PNHFNDALJFD", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{DILIPIOBIJI});
  }
};
// Writing MetadataGetter for method: MagicalActual::AncientGuardianPillar::IMFHAIGPGLB
// Il2CppName: IMFHAIGPGLB
template<>
