// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MagicalActual.Archer
#include "MagicalActual/Archer.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Archer::$$c__DisplayClass163_0);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Archer::$$c__DisplayClass163_0*, "MagicalActual", "Archer/<>c__DisplayClass163_0");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Archer/<>c__DisplayClass163_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: AD2C64
  class Archer::$$c__DisplayClass163_0 : public ::Il2CppObject {
    public:
    public:
    // public System.Single LOOFLPBMPBM
    // Size: 0x4
    // Offset: 0x10
    float LOOFLPBMPBM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 PDCEKIHOJLA
    // Size: 0xC
    // Offset: 0x14
    ::UnityEngine::Vector3 PDCEKIHOJLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 IMNKMKBFLNO
    // Size: 0xC
    // Offset: 0x20
    ::UnityEngine::Vector3 IMNKMKBFLNO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 KFBLMECEHEH
    // Size: 0xC
    // Offset: 0x2C
    ::UnityEngine::Vector3 KFBLMECEHEH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public MagicalActual.Archer CGMCLOBOBCB
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::Archer* CGMCLOBOBCB;
    // Field size check
    static_assert(sizeof(::MagicalActual::Archer*) == 0x8);
    public:
    // Get instance field reference: public System.Single LOOFLPBMPBM
    [[deprecated("Use field access instead!")]] float& dyn_LOOFLPBMPBM();
    // Get instance field reference: public UnityEngine.Vector3 PDCEKIHOJLA
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_PDCEKIHOJLA();
    // Get instance field reference: public UnityEngine.Vector3 IMNKMKBFLNO
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_IMNKMKBFLNO();
    // Get instance field reference: public UnityEngine.Vector3 KFBLMECEHEH
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_KFBLMECEHEH();
    // Get instance field reference: public MagicalActual.Archer CGMCLOBOBCB
    [[deprecated("Use field access instead!")]] ::MagicalActual::Archer*& dyn_CGMCLOBOBCB();
    // System.Void OCLNFNHCIEK(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1986044
    void OCLNFNHCIEK(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LLICPOILNBK(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x19862D8
    void LLICPOILNBK(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JNCNGJDAJJL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1986580
    void JNCNGJDAJJL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void NKMPMCHINOL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1986828
    void NKMPMCHINOL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void FDCPEMLDKKO(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1986AF0
    void FDCPEMLDKKO(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BEEIHHNNDAG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1986DA4
    void BEEIHHNNDAG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LDMACJPEKIK(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198703C
    void LDMACJPEKIK(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JMCFOLDMOBO(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x19872D4
    void JMCFOLDMOBO(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void FCEGGIEGEDL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198759C
    void FCEGGIEGEDL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void PKJOAMHDKOE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1987850
    void PKJOAMHDKOE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void DMHDAACPKBL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1987B04
    void DMHDAACPKBL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void AOFJKGFHGJG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1987DB8
    void AOFJKGFHGJG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JLFCDAJFNLD(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198804C
    void JLFCDAJFNLD(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BLBKDPMGDCH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x19882F8
    void BLBKDPMGDCH(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BGICHOEOEOK(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x19885AC
    void BGICHOEOEOK(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MPHMBJBBNED(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1988840
    void MPHMBJBBNED(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void IHLOONAAOAE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1988AF4
    void IHLOONAAOAE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void FKIJGDECBNL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1988DBC
    void FKIJGDECBNL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void NEOAOGBLOIL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1989054
    void NEOAOGBLOIL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void CMLCNEOLCPI(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x19892FC
    void CMLCNEOLCPI(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void PHBJMJNLBDP(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x19895B0
    void PHBJMJNLBDP(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void INLJFNILIMI(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1989858
    void INLJFNILIMI(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LOIFNMIEPDO(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1989B00
    void LOIFNMIEPDO(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JLMLGKELEII(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1989DA8
    void JLMLGKELEII(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void DAEBHKKJDJP(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198A05C
    void DAEBHKKJDJP(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void IBPPOLDDGOG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198A304
    void IBPPOLDDGOG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BJLBPGIMMPN(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198A5CC
    void BJLBPGIMMPN(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void EHNIPJMNLKF(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198A894
    void EHNIPJMNLKF(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MIHEFAKPKIG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198AB5C
    void MIHEFAKPKIG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // public System.Void .ctor()
    // Offset: 0x198ADF0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Archer::$$c__DisplayClass163_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::Archer::$$c__DisplayClass163_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Archer::$$c__DisplayClass163_0*, creationType>()));
    }
    // System.Void KNIJIGBLEJE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198ADF8
    void KNIJIGBLEJE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void NIMICJLMFGD(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198B090
    void NIMICJLMFGD(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LLPEAOJFNNC(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198B358
    void LLPEAOJFNNC(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void AFIHCGNMMNP(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198B620
    void AFIHCGNMMNP(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void ICEHEFLLKJJ(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198B8B8
    void ICEHEFLLKJJ(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void GCOJBJGMOGA(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198BB64
    void GCOJBJGMOGA(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BJKOCEINBHJ(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x198BE2C
    void BJKOCEINBHJ(::System::IO::BinaryWriter* FFJEENIEPJH);
  }; // MagicalActual.Archer/<>c__DisplayClass163_0
  #pragma pack(pop)
  static check_size<sizeof(Archer::$$c__DisplayClass163_0), 56 + sizeof(::MagicalActual::Archer*)> __MagicalActual_Archer_$$c__DisplayClass163_0SizeCheck;
  static_assert(sizeof(Archer::$$c__DisplayClass163_0) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::Archer::$$c__DisplayClass163_0::OCLNFNHCIEK
// Il2CppName: OCLNFNHCIEK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::Archer::$$c__DisplayClass163_0::*)(::System::IO::BinaryWriter*)>(&MagicalActual::Archer::$$c__DisplayClass163_0::OCLNFNHCIEK)> {
  static const MethodInfo* get() {
    static auto* FFJEENIEPJH = &::il2cpp_utils::GetClassFromName("System.IO", "BinaryWriter")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::Archer::$$c__DisplayClass163_0*), "OCLNFNHCIEK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{FFJEENIEPJH});
  }
};
// Writing MetadataGetter for method: MagicalActual::Archer::$$c__DisplayClass163_0::LLICPOILNBK
// Il2CppName: LLICPOILNBK
template<>
