// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: Archer
  class Archer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: BoxCollider
  class BoxCollider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ArcherCriticalSpot
  class ArcherCriticalSpot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ArcherCriticalSpot);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ArcherCriticalSpot*, "MagicalActual", "ArcherCriticalSpot");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA9
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ArcherCriticalSpot
  // [TokenAttribute] Offset: FFFFFFFF
  class ArcherCriticalSpot : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single GEBMCFKLLOB
    // Size: 0x4
    // Offset: 0x18
    float GEBMCFKLLOB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 NKEFHEBFINL
    // Size: 0xC
    // Offset: 0x1C
    ::UnityEngine::Vector3 NKEFHEBFINL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public MagicalActual.Monster myMonster
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::Monster* myMonster;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public MagicalActual.Archer myArcher
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::Archer* myArcher;
    // Field size check
    static_assert(sizeof(::MagicalActual::Archer*) == 0x8);
    // public System.Byte id
    // Size: 0x1
    // Offset: 0x38
    uint8_t id;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: id and: sphere
    char __padding4[0x7] = {};
    // private UnityEngine.Transform sphere
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* sphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform KKOJLMPDGBN
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* KKOJLMPDGBN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform JJDMDLCCPDD
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* JJDMDLCCPDD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.BoxCollider GCIPNKCIPNG
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::BoxCollider* GCIPNKCIPNG;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Single CCDGMNCNOBB
    // Size: 0x4
    // Offset: 0x68
    float CCDGMNCNOBB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: CCDGMNCNOBB and: ICLBPOMENOJ
    char __padding10[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt ICLBPOMENOJ
    // Size: 0x19
    // Offset: 0x70
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt ICLBPOMENOJ;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: ICLBPOMENOJ and: KLEKBEANPFB
    char __padding11[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt KLEKBEANPFB
    // Size: 0x19
    // Offset: 0x90
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt KLEKBEANPFB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single GEBMCFKLLOB
    [[deprecated("Use field access instead!")]] float& dyn_GEBMCFKLLOB();
    // Get instance field reference: private UnityEngine.Vector3 NKEFHEBFINL
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_NKEFHEBFINL();
    // Get instance field reference: public MagicalActual.Monster myMonster
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_myMonster();
    // Get instance field reference: public MagicalActual.Archer myArcher
    [[deprecated("Use field access instead!")]] ::MagicalActual::Archer*& dyn_myArcher();
