// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: ObjectHighlighter
  class ObjectHighlighter;
  // Forward declaring type: ArcherCriticalSpot
  class ArcherCriticalSpot;
  // Skipping declaration: arrowAbilities because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: VectorLine
  class VectorLine;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Archer
  class Archer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Archer);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Archer*, "MagicalActual", "Archer");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x3D0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Archer
  // [TokenAttribute] Offset: FFFFFFFF
  class Archer : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Archer::useAxis
    struct useAxis;
    // Nested type: ::MagicalActual::Archer::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::Archer::orbusIncomingMethodIdx
    struct orbusIncomingMethodIdx;
    // Nested type: ::MagicalActual::Archer::arrowAbilities
    struct arrowAbilities;
    // Nested type: ::MagicalActual::Archer::$$c__DisplayClass159_0
    class $$c__DisplayClass159_0;
    // Nested type: ::MagicalActual::Archer::$$c__DisplayClass161_0
    class $$c__DisplayClass161_0;
    // Nested type: ::MagicalActual::Archer::$$c__DisplayClass163_0
    class $$c__DisplayClass163_0;
    // Nested type: ::MagicalActual::Archer::$$c
    class $$c;
    // Nested type: ::MagicalActual::Archer::$$c__DisplayClass168_0
    class $$c__DisplayClass168_0;
    // Nested type: ::MagicalActual::Archer::$$c__DisplayClass181_0
    class $$c__DisplayClass181_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.Archer/useAxis
    // [TokenAttribute] Offset: FFFFFFFF
    struct useAxis/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: useAxis
      constexpr useAxis(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.Archer/useAxis EHPNBDGDGLH
      static constexpr const int EHPNBDGDGLH = 1;
      // Get static field: static public MagicalActual.Archer/useAxis EHPNBDGDGLH
      static ::MagicalActual::Archer::useAxis _get_EHPNBDGDGLH();
      // Set static field: static public MagicalActual.Archer/useAxis EHPNBDGDGLH
      static void _set_EHPNBDGDGLH(::MagicalActual::Archer::useAxis value);
      // static field const value: static public MagicalActual.Archer/useAxis HAPAOAMLEJG
      static constexpr const int HAPAOAMLEJG = 2;
      // Get static field: static public MagicalActual.Archer/useAxis HAPAOAMLEJG
      static ::MagicalActual::Archer::useAxis _get_HAPAOAMLEJG();
      // Set static field: static public MagicalActual.Archer/useAxis HAPAOAMLEJG
      static void _set_HAPAOAMLEJG(::MagicalActual::Archer::useAxis value);
      // static field const value: static public MagicalActual.Archer/useAxis FIJOGKJIGNJ
      static constexpr const int FIJOGKJIGNJ = 3;
      // Get static field: static public MagicalActual.Archer/useAxis FIJOGKJIGNJ
      static ::MagicalActual::Archer::useAxis _get_FIJOGKJIGNJ();
      // Set static field: static public MagicalActual.Archer/useAxis FIJOGKJIGNJ
      static void _set_FIJOGKJIGNJ(::MagicalActual::Archer::useAxis value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.Archer/useAxis
    #pragma pack(pop)
    static check_size<sizeof(Archer::useAxis), 0 + sizeof(int)> __MagicalActual_Archer_useAxisSizeCheck;
    static_assert(sizeof(Archer::useAxis) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.Archer/arrowAbilities
    // [TokenAttribute] Offset: FFFFFFFF
    struct arrowAbilities/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: arrowAbilities
      constexpr arrowAbilities(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.Archer/arrowAbilities NDEIOLIGOEC
      static constexpr const int NDEIOLIGOEC = 0;
      // Get static field: static public MagicalActual.Archer/arrowAbilities NDEIOLIGOEC
      static ::MagicalActual::Archer::arrowAbilities _get_NDEIOLIGOEC();
      // Set static field: static public MagicalActual.Archer/arrowAbilities NDEIOLIGOEC
      static void _set_NDEIOLIGOEC(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities IHOCJOINOMJ
      static constexpr const int IHOCJOINOMJ = 1;
      // Get static field: static public MagicalActual.Archer/arrowAbilities IHOCJOINOMJ
      static ::MagicalActual::Archer::arrowAbilities _get_IHOCJOINOMJ();
      // Set static field: static public MagicalActual.Archer/arrowAbilities IHOCJOINOMJ
      static void _set_IHOCJOINOMJ(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities MLDFAPAJIHP
      static constexpr const int MLDFAPAJIHP = 2;
      // Get static field: static public MagicalActual.Archer/arrowAbilities MLDFAPAJIHP
      static ::MagicalActual::Archer::arrowAbilities _get_MLDFAPAJIHP();
      // Set static field: static public MagicalActual.Archer/arrowAbilities MLDFAPAJIHP
      static void _set_MLDFAPAJIHP(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities AFCIMMJEABN
      static constexpr const int AFCIMMJEABN = 3;
      // Get static field: static public MagicalActual.Archer/arrowAbilities AFCIMMJEABN
      static ::MagicalActual::Archer::arrowAbilities _get_AFCIMMJEABN();
      // Set static field: static public MagicalActual.Archer/arrowAbilities AFCIMMJEABN
      static void _set_AFCIMMJEABN(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities OKAIFABKNNM
      static constexpr const int OKAIFABKNNM = 4;
      // Get static field: static public MagicalActual.Archer/arrowAbilities OKAIFABKNNM
      static ::MagicalActual::Archer::arrowAbilities _get_OKAIFABKNNM();
      // Set static field: static public MagicalActual.Archer/arrowAbilities OKAIFABKNNM
      static void _set_OKAIFABKNNM(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities LIEGBFEPFFF
      static constexpr const int LIEGBFEPFFF = 5;
      // Get static field: static public MagicalActual.Archer/arrowAbilities LIEGBFEPFFF
      static ::MagicalActual::Archer::arrowAbilities _get_LIEGBFEPFFF();
      // Set static field: static public MagicalActual.Archer/arrowAbilities LIEGBFEPFFF
      static void _set_LIEGBFEPFFF(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities NHANOGNDJPF
      static constexpr const int NHANOGNDJPF = 6;
      // Get static field: static public MagicalActual.Archer/arrowAbilities NHANOGNDJPF
      static ::MagicalActual::Archer::arrowAbilities _get_NHANOGNDJPF();
      // Set static field: static public MagicalActual.Archer/arrowAbilities NHANOGNDJPF
      static void _set_NHANOGNDJPF(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities IKBKJFDFPLI
      static constexpr const int IKBKJFDFPLI = 7;
      // Get static field: static public MagicalActual.Archer/arrowAbilities IKBKJFDFPLI
      static ::MagicalActual::Archer::arrowAbilities _get_IKBKJFDFPLI();
      // Set static field: static public MagicalActual.Archer/arrowAbilities IKBKJFDFPLI
      static void _set_IKBKJFDFPLI(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities BMCKFIMMIPA
      static constexpr const int BMCKFIMMIPA = 8;
      // Get static field: static public MagicalActual.Archer/arrowAbilities BMCKFIMMIPA
      static ::MagicalActual::Archer::arrowAbilities _get_BMCKFIMMIPA();
      // Set static field: static public MagicalActual.Archer/arrowAbilities BMCKFIMMIPA
      static void _set_BMCKFIMMIPA(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities OIBFJLLJDKJ
      static constexpr const int OIBFJLLJDKJ = 9;
      // Get static field: static public MagicalActual.Archer/arrowAbilities OIBFJLLJDKJ
      static ::MagicalActual::Archer::arrowAbilities _get_OIBFJLLJDKJ();
      // Set static field: static public MagicalActual.Archer/arrowAbilities OIBFJLLJDKJ
      static void _set_OIBFJLLJDKJ(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities NBJGAAHAJAE
      static constexpr const int NBJGAAHAJAE = 10;
      // Get static field: static public MagicalActual.Archer/arrowAbilities NBJGAAHAJAE
      static ::MagicalActual::Archer::arrowAbilities _get_NBJGAAHAJAE();
      // Set static field: static public MagicalActual.Archer/arrowAbilities NBJGAAHAJAE
      static void _set_NBJGAAHAJAE(::MagicalActual::Archer::arrowAbilities value);
      // static field const value: static public MagicalActual.Archer/arrowAbilities ECHHLACDICH
      static constexpr const int ECHHLACDICH = 99;
      // Get static field: static public MagicalActual.Archer/arrowAbilities ECHHLACDICH
      static ::MagicalActual::Archer::arrowAbilities _get_ECHHLACDICH();
      // Set static field: static public MagicalActual.Archer/arrowAbilities ECHHLACDICH
      static void _set_ECHHLACDICH(::MagicalActual::Archer::arrowAbilities value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.Archer/arrowAbilities
    #pragma pack(pop)
    static check_size<sizeof(Archer::arrowAbilities), 0 + sizeof(int)> __MagicalActual_Archer_arrowAbilitiesSizeCheck;
    static_assert(sizeof(Archer::arrowAbilities) == 0x4);
    public:
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x18
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean CBOHFPEBBLA
    // Size: 0x1
    // Offset: 0x19
    bool CBOHFPEBBLA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CBOHFPEBBLA and: HCFELEODBLD
    char __padding1[0x6] = {};
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // public UnityEngine.GameObject controllerArrow
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* controllerArrow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject DDNGGFCDOPM
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* DDNGGFCDOPM;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject AGODOPIILHA
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* AGODOPIILHA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bow
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* bow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject ALOAALEHOBB
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* ALOAALEHOBB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject POPBFNPBDOI
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* POPBFNPBDOI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject handlePoint
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* handlePoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject flyingArrowPrefab
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* flyingArrowPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject flyingArrowLongTailPrefab
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* flyingArrowLongTailPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxBlood
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* vfxBlood;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxCritHit
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* vfxCritHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxRain
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* vfxRain;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxTrapExplosion
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* vfxTrapExplosion;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject[] vfxArrowTipVfx
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::UnityEngine::GameObject*> vfxArrowTipVfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.Transform DFGKDJFNDHC
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Transform* DFGKDJFNDHC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single BKIIHPLHGHI
    // Size: 0x4
    // Offset: 0xB0
    float BKIIHPLHGHI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 CNBGPJGNDHG
    // Size: 0xC
    // Offset: 0xB4
    ::UnityEngine::Vector3 CNBGPJGNDHG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 LBKEFFOMMDK
    // Size: 0xC
    // Offset: 0xC0
    ::UnityEngine::Vector3 LBKEFFOMMDK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single KCPPHLJOPGN
    // Size: 0x4
    // Offset: 0xCC
    float KCPPHLJOPGN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KGNMCBDDHBO
    // Size: 0x4
    // Offset: 0xD0
    float KGNMCBDDHBO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JDJIEFKEIFJ
    // Size: 0x4
    // Offset: 0xD4
    float JDJIEFKEIFJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Vectrosity.VectorLine KNNLNNHNMNE
    // Size: 0x8
    // Offset: 0xD8
    ::Vectrosity::VectorLine* KNNLNNHNMNE;
    // Field size check
    static_assert(sizeof(::Vectrosity::VectorLine*) == 0x8);
    // private System.Single FKKACPMOGKP
    // Size: 0x4
    // Offset: 0xE0
    float FKKACPMOGKP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DEKAKKMLCFG
    // Size: 0x4
    // Offset: 0xE4
    float DEKAKKMLCFG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean DMCGIAPABOA
    // Size: 0x1
    // Offset: 0xE8
    bool DMCGIAPABOA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean NNDIPBGCGFH
    // Size: 0x1
    // Offset: 0xE9
    bool NNDIPBGCGFH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NNDIPBGCGFH and: abil1_icon
    char __padding30[0x6] = {};
    // public UnityEngine.UI.Image abil1_icon
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::UI::Image* abil1_icon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single CJBIGLODBOF
    // Size: 0x4
    // Offset: 0xF8
    float CJBIGLODBOF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FKCFHOHJILE
    // Size: 0x4
    // Offset: 0xFC
    float FKCFHOHJILE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean GBHKONENNFO
    // Size: 0x1
    // Offset: 0x100
    bool GBHKONENNFO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GEOLNFIKBFI
    // Size: 0x1
    // Offset: 0x101
    bool GEOLNFIKBFI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GEOLNFIKBFI and: abil2_icon
    char __padding35[0x6] = {};
    // public UnityEngine.UI.Image abil2_icon
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UI::Image* abil2_icon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single IKPGOLILJAE
    // Size: 0x4
    // Offset: 0x110
    float IKPGOLILJAE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EJAHAGPCLEH
    // Size: 0x4
    // Offset: 0x114
    float EJAHAGPCLEH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean NCBPNNPCBGJ
    // Size: 0x1
    // Offset: 0x118
    bool NCBPNNPCBGJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GKIIALHBFME
    // Size: 0x1
    // Offset: 0x119
    bool GKIIALHBFME;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GKIIALHBFME and: abil3_icon
    char __padding40[0x6] = {};
    // public UnityEngine.UI.Image abil3_icon
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::UI::Image* abil3_icon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single MKDJFEPDHIB
    // Size: 0x4
    // Offset: 0x128
    float MKDJFEPDHIB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single AOJHNCKJJKH
    // Size: 0x4
    // Offset: 0x12C
    float AOJHNCKJJKH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean KBKLKHGBNFD
    // Size: 0x1
    // Offset: 0x130
    bool KBKLKHGBNFD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KBKLKHGBNFD and: abil4_icon
    char __padding44[0x7] = {};
    // public UnityEngine.UI.Image abil4_icon
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::UI::Image* abil4_icon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single MMBGGFGAOMA
    // Size: 0x4
    // Offset: 0x140
    float MMBGGFGAOMA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JCPLOKNLJDE
    // Size: 0x4
    // Offset: 0x144
    float JCPLOKNLJDE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean LOOFPNFLHAF
    // Size: 0x1
    // Offset: 0x148
    bool LOOFPNFLHAF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DHKDOGJAOIG
    // Size: 0x1
    // Offset: 0x149
    bool DHKDOGJAOIG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MBFHKOJKKLI
    // Size: 0x1
    // Offset: 0x14A
    bool MBFHKOJKKLI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DIJNPBDLJHF
    // Size: 0x1
    // Offset: 0x14B
    bool DIJNPBDLJHF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DIJNPBDLJHF and: BCOFKLAEOMF
    char __padding51[0x4] = {};
    // private UnityEngine.GameObject BCOFKLAEOMF
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::GameObject* BCOFKLAEOMF;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 PKPAONONFFC
    // Size: 0xC
    // Offset: 0x158
    ::UnityEngine::Vector3 PKPAONONFFC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: PKPAONONFFC and: beltTrap
    char __padding53[0x4] = {};
    // public UnityEngine.GameObject beltTrap
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::GameObject* beltTrap;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.BoxCollider CHHNCGNNLPA
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::BoxCollider* CHHNCGNNLPA;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Single FMJAJFCHDGK
    // Size: 0x4
    // Offset: 0x178
    float FMJAJFCHDGK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: FMJAJFCHDGK and: IHDIMJGLDIJ
    char __padding56[0x4] = {};
    // private UnityEngine.GameObject IHDIMJGLDIJ
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::GameObject* IHDIMJGLDIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.BoxCollider KEAJKAGBNDE
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::BoxCollider* KEAJKAGBNDE;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private UnityEngine.GameObject JECFNMKBJPK
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::GameObject* JECFNMKBJPK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.ObjectHighlighter MOBFGEGIHCG
    // Size: 0x8
    // Offset: 0x198
    ::MagicalActual::ObjectHighlighter* MOBFGEGIHCG;
    // Field size check
    static_assert(sizeof(::MagicalActual::ObjectHighlighter*) == 0x8);
    // private UnityEngine.GameObject CKIFGLEFIBD
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::GameObject* CKIFGLEFIBD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject BDDDDLHEGFG
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::GameObject* BDDDDLHEGFG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.BoxCollider NHIDNFFMEBD
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::BoxCollider* NHIDNFFMEBD;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private UnityEngine.GameObject CGLDGMBJMME
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::GameObject* CGLDGMBJMME;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.ObjectHighlighter ECPICIOFHBM
    // Size: 0x8
    // Offset: 0x1C0
    ::MagicalActual::ObjectHighlighter* ECPICIOFHBM;
    // Field size check
    static_assert(sizeof(::MagicalActual::ObjectHighlighter*) == 0x8);
    // private UnityEngine.GameObject BFJGFPNIGIJ
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::GameObject* BFJGFPNIGIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject ACIFNEANCBL
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::GameObject* ACIFNEANCBL;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject JFMDKCFOKCD
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::GameObject* JFMDKCFOKCD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject ICKGFJMICME
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::GameObject* ICKGFJMICME;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt JLOOMEIDNFH
    // Size: 0x19
    // Offset: 0x1E8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt JLOOMEIDNFH;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: JLOOMEIDNFH and: NAGDLHIDCAH
    char __padding70[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt NAGDLHIDCAH
    // Size: 0x19
    // Offset: 0x208
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt NAGDLHIDCAH;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: NAGDLHIDCAH and: IOGHDECGGKF
    char __padding71[0x7] = {};
    // private System.Single IOGHDECGGKF
    // Size: 0x4
    // Offset: 0x228
    float IOGHDECGGKF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NCCNAPLJMBM
    // Size: 0x4
    // Offset: 0x22C
    float NCCNAPLJMBM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 MCFENCIJGNG
    // Size: 0xC
    // Offset: 0x230
    ::UnityEngine::Vector3 MCFENCIJGNG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Color JMJKIJDCPDF
    // Size: 0x10
    // Offset: 0x23C
    ::UnityEngine::Color JMJKIJDCPDF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color OFJLNPFPAAD
    // Size: 0x10
    // Offset: 0x24C
    ::UnityEngine::Color OFJLNPFPAAD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0x25C
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0x25D
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x25E
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0x25F
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 AAIGNGFONBI
    // Size: 0x4
    // Offset: 0x260
    int AAIGNGFONBI;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 GGEFNAGCKIM
    // Size: 0xC
    // Offset: 0x264
    ::UnityEngine::Vector3 GGEFNAGCKIM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion PGEPDKMCMAG
    // Size: 0x10
    // Offset: 0x270
    ::UnityEngine::Quaternion PGEPDKMCMAG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.GameObject FHLMGEOALGC
    // Size: 0x8
    // Offset: 0x280
    ::UnityEngine::GameObject* FHLMGEOALGC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x288
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean IHHGAHCIFPM
    // Size: 0x1
    // Offset: 0x290
    bool IHHGAHCIFPM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IHHGAHCIFPM and: CCEMBLKGKLN
    char __padding86[0x7] = {};
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x2A0
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 GHDHNDFOEJD
    // Size: 0x4
    // Offset: 0x2A8
    int GHDHNDFOEJD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 LOOMJHGPNOO
    // Size: 0x4
    // Offset: 0x2AC
    int LOOMJHGPNOO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private OrbusTrackedController IKCANGJCBED
    // Size: 0x8
    // Offset: 0x2B0
    ::GlobalNamespace::OrbusTrackedController* IKCANGJCBED;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private OrbusTrackedController HKFGNKJKLPH
    // Size: 0x8
    // Offset: 0x2B8
    ::GlobalNamespace::OrbusTrackedController* HKFGNKJKLPH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // public UnityEngine.GameObject[] globesOn
    // Size: 0x8
    // Offset: 0x2C0
    ::ArrayW<::UnityEngine::GameObject*> globesOn;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] globesOff
    // Size: 0x8
    // Offset: 0x2C8
    ::ArrayW<::UnityEngine::GameObject*> globesOff;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public SuperTextMesh shotRatingIndicator
    // Size: 0x8
    // Offset: 0x2D0
    ::GlobalNamespace::SuperTextMesh* shotRatingIndicator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private System.Single JODNJDBJDNO
    // Size: 0x4
    // Offset: 0x2D8
    float JODNJDBJDNO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JEOMDONEDFM
    // Size: 0x4
    // Offset: 0x2DC
    float JEOMDONEDFM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 JIBNAJKFJIA
    // Size: 0xC
    // Offset: 0x2E0
    ::UnityEngine::Vector3 JIBNAJKFJIA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: JIBNAJKFJIA and: ABKOIGAJPKE
    char __padding98[0x4] = {};
    // private UnityEngine.GameObject ABKOIGAJPKE
    // Size: 0x8
    // Offset: 0x2F0
    ::UnityEngine::GameObject* ABKOIGAJPKE;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 MLPCJDMEOLM
    // Size: 0xC
    // Offset: 0x2F8
    ::UnityEngine::Vector3 MLPCJDMEOLM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: MLPCJDMEOLM and: bowHud
    char __padding100[0x4] = {};
    // public UnityEngine.GameObject bowHud
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::GameObject* bowHud;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0x310
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject critPrefab
    // Size: 0x8
    // Offset: 0x318
    ::UnityEngine::GameObject* critPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.List`1<MagicalActual.ArcherCriticalSpot> critSpots
    // Size: 0x8
    // Offset: 0x320
    ::System::Collections::Generic::List_1<::MagicalActual::ArcherCriticalSpot*>* critSpots;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::ArcherCriticalSpot*>*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt DKKJDEGCOLN
    // Size: 0x19
    // Offset: 0x328
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt DKKJDEGCOLN;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: DKKJDEGCOLN and: MGEMIPNLONH
    char __padding105[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt MGEMIPNLONH
    // Size: 0x19
    // Offset: 0x348
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt MGEMIPNLONH;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: MGEMIPNLONH and: EEJPPOFELBG
    char __padding106[0x7] = {};
    // private System.Boolean EEJPPOFELBG
    // Size: 0x1
    // Offset: 0x368
    bool EEJPPOFELBG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EEJPPOFELBG and: COLMMMMCHPF
    char __padding107[0x3] = {};
    // private System.Int32 COLMMMMCHPF
    // Size: 0x4
    // Offset: 0x36C
    int COLMMMMCHPF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MagicalActual.Archer/useAxis MOHANHGCAPP
    // Size: 0x4
    // Offset: 0x370
    ::MagicalActual::Archer::useAxis MOHANHGCAPP;
    // Field size check
    static_assert(sizeof(::MagicalActual::Archer::useAxis) == 0x4);
    // public MagicalActual.Archer/arrowAbilities arrowNotchedWithAbility
    // Size: 0x4
    // Offset: 0x374
    ::MagicalActual::Archer::arrowAbilities arrowNotchedWithAbility;
    // Field size check
    static_assert(sizeof(::MagicalActual::Archer::arrowAbilities) == 0x4);
    // private System.Int32 PEHHBDBEAEM
    // Size: 0x4
    // Offset: 0x378
    int PEHHBDBEAEM;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 NFOHLCAANJB
    // Size: 0x4
    // Offset: 0x37C
    int NFOHLCAANJB;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Byte HCIPCMLDHDD
    // Size: 0x1
    // Offset: 0x380
    uint8_t HCIPCMLDHDD;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean DEAAGGEFHEE
    // Size: 0x1
    // Offset: 0x381
    bool DEAAGGEFHEE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DKNPCJOMGBJ
    // Size: 0x1
    // Offset: 0x382
    bool DKNPCJOMGBJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte JNMJJKDAECC
    // Size: 0x1
    // Offset: 0x383
    uint8_t JNMJJKDAECC;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean LGJCIINDCAL
    // Size: 0x1
    // Offset: 0x384
    bool LGJCIINDCAL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LGJCIINDCAL and: HCJEOHLOMGB
    char __padding117[0x3] = {};
    // private ClickedEventHandler HCJEOHLOMGB
    // Size: 0x8
    // Offset: 0x388
    ::GlobalNamespace::ClickedEventHandler* HCJEOHLOMGB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler KEBNGJKMOCC
    // Size: 0x8
    // Offset: 0x390
    ::GlobalNamespace::ClickedEventHandler* KEBNGJKMOCC;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler HBOOKAFBIEP
    // Size: 0x8
    // Offset: 0x398
    ::GlobalNamespace::ClickedEventHandler* HBOOKAFBIEP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler POBEHEJEEFA
    // Size: 0x8
    // Offset: 0x3A0
    ::GlobalNamespace::ClickedEventHandler* POBEHEJEEFA;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler BHLDGAKLBLB
    // Size: 0x8
    // Offset: 0x3A8
    ::GlobalNamespace::ClickedEventHandler* BHLDGAKLBLB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler FHBKAFFKFOD
    // Size: 0x8
    // Offset: 0x3B0
    ::GlobalNamespace::ClickedEventHandler* FHBKAFFKFOD;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler MDEBIKPCABE
    // Size: 0x8
    // Offset: 0x3B8
    ::GlobalNamespace::ClickedEventHandler* MDEBIKPCABE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler BMHNEDFCFFE
    // Size: 0x8
    // Offset: 0x3C0
    ::GlobalNamespace::ClickedEventHandler* BMHNEDFCFFE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x3C8
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
    // Get instance field reference: private System.Boolean CBOHFPEBBLA
    [[deprecated("Use field access instead!")]] bool& dyn_CBOHFPEBBLA();
    // Get instance field reference: private MagicalActual.PlayerCharacter HCFELEODBLD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerCharacter*& dyn_HCFELEODBLD();
