// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: BarbarianHitMarker
  class BarbarianHitMarker;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: BarbarianBeat
  class BarbarianBeat;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::BarbarianBeat);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::BarbarianBeat*, "MagicalActual", "BarbarianBeat");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.BarbarianBeat
  // [TokenAttribute] Offset: FFFFFFFF
  class BarbarianBeat : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::BarbarianBeat::$$c__DisplayClass17_0
    class $$c__DisplayClass17_0;
    public:
    // public UnityEngine.GameObject hitMarkerAny
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* hitMarkerAny;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject hitMarkerVertical
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* hitMarkerVertical;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject hitMarkerHorizontal
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* hitMarkerHorizontal;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single HPDFHCJJGMO
    // Size: 0x4
    // Offset: 0x30
    float HPDFHCJJGMO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KIEALDCOLBI
    // Size: 0x4
    // Offset: 0x34
    float KIEALDCOLBI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JJBHMGDJEAL
    // Size: 0x4
    // Offset: 0x38
    float JJBHMGDJEAL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EMFLAHHPMBN
    // Size: 0x4
    // Offset: 0x3C
    float EMFLAHHPMBN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BLHGLPPPLFP
    // Size: 0x4
    // Offset: 0x40
    float BLHGLPPPLFP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: BLHGLPPPLFP and: hitmarkers
    char __padding7[0x4] = {};
    // public System.Collections.Generic.List`1<MagicalActual.BarbarianHitMarker> hitmarkers
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::MagicalActual::BarbarianHitMarker*>* hitmarkers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::BarbarianHitMarker*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> OPDIOJNHKDK
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<int>* OPDIOJNHKDK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Int32 DIKLKIEFENJ
    // Size: 0x4
    // Offset: 0x58
    int DIKLKIEFENJ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 DBHFAPMMECG
    // Size: 0x4
    // Offset: 0x5C
    int DBHFAPMMECG;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject hitMarkerAny
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_hitMarkerAny();
    // Get instance field reference: public UnityEngine.GameObject hitMarkerVertical
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_hitMarkerVertical();
    // Get instance field reference: public UnityEngine.GameObject hitMarkerHorizontal
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_hitMarkerHorizontal();
    // Get instance field reference: private System.Single HPDFHCJJGMO
    [[deprecated("Use field access instead!")]] float& dyn_HPDFHCJJGMO();
