// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: BarbarianAxe
  class BarbarianAxe;
  // Forward declaring type: BarbarianTarget
  class BarbarianTarget;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: OrbusNetManager
  class OrbusNetManager;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Barbarian
  class Barbarian;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Barbarian);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Barbarian*, "MagicalActual", "Barbarian");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Barbarian
  // [TokenAttribute] Offset: FFFFFFFF
  class Barbarian : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::Barbarian::axeAbilityIdx
    struct axeAbilityIdx;
    // Nested type: ::MagicalActual::Barbarian::$$c__DisplayClass35_0
    class $$c__DisplayClass35_0;
    // Nested type: ::MagicalActual::Barbarian::$$c__DisplayClass36_0
    class $$c__DisplayClass36_0;
    // Nested type: ::MagicalActual::Barbarian::$$c__DisplayClass38_0
    class $$c__DisplayClass38_0;
    public:
    // public MagicalActual.BarbarianAxe axeLeft
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::BarbarianAxe* axeLeft;
    // Field size check
    static_assert(sizeof(::MagicalActual::BarbarianAxe*) == 0x8);
    // public MagicalActual.BarbarianAxe axeRight
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::BarbarianAxe* axeRight;
    // Field size check
    static_assert(sizeof(::MagicalActual::BarbarianAxe*) == 0x8);
    // private System.Single PMELGNJJFDD
    // Size: 0x4
    // Offset: 0x28
    float PMELGNJJFDD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single LAEOENGPBJL
    // Size: 0x4
    // Offset: 0x2C
    float LAEOENGPBJL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MMJHKPCDMIM
    // Size: 0x4
    // Offset: 0x30
    float MMJHKPCDMIM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: MMJHKPCDMIM and: barbarianBeatPrefab
    char __padding4[0x4] = {};
    // public UnityEngine.GameObject barbarianBeatPrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* barbarianBeatPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxHit
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* vfxHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxBlood
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* vfxBlood;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxTaunt
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* vfxTaunt;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean CBAGABHFFMA
    // Size: 0x1
    // Offset: 0x58
    bool CBAGABHFFMA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean LCLNEEMAIEN
    // Size: 0x1
    // Offset: 0x59
    bool LCLNEEMAIEN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LCLNEEMAIEN and: OMLNIIBDLNG
    char __padding10[0x6] = {};
    // private UnityEngine.UI.Image OMLNIIBDLNG
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UI::Image* OMLNIIBDLNG;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single HKPOGBIAGBO
    // Size: 0x4
    // Offset: 0x68
    float HKPOGBIAGBO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BLOHAMJKLBC
    // Size: 0x4
    // Offset: 0x6C
    float BLOHAMJKLBC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UI.Image GPPDIBPBIPJ
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UI::Image* GPPDIBPBIPJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single FJBCDOIMFOI
    // Size: 0x4
    // Offset: 0x78
    float FJBCDOIMFOI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HBEPFNLAKHG
    // Size: 0x4
    // Offset: 0x7C
    float HBEPFNLAKHG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UI.Image AHIODJENCPL
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UI::Image* AHIODJENCPL;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single IEFLJJJMNII
    // Size: 0x4
    // Offset: 0x88
    float IEFLJJJMNII;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EMOIDALBJHI
    // Size: 0x4
    // Offset: 0x8C
    float EMOIDALBJHI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.UI.Image IPAKBPLCKIH
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Image* IPAKBPLCKIH;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.BarbarianTarget> MAFDLGCKFAJ
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::MagicalActual::BarbarianTarget*>* MAFDLGCKFAJ;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::BarbarianTarget*>*) == 0x8);
    // public MagicalActual.PlayerCharacter myPlayer
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::PlayerCharacter* myPlayer;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0xA8
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0xB0
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0xB8
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: fury
    char __padding25[0x3] = {};
    // public System.Int32 fury
    // Size: 0x4
    // Offset: 0xBC
    int fury;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 maxFury
    // Size: 0x4
    // Offset: 0xC0
    int maxFury;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: maxFury and: OrbusNetComponent
    char __padding27[0x4] = {};
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0xC8
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0xD0
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.OrbusNetManager KPMLFHPFLBL
    // Size: 0x8
    // Offset: 0xD8
    ::MagicalActual::OrbusNetManager* KPMLFHPFLBL;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusNetManager*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.BarbarianAxe axeLeft
    [[deprecated("Use field access instead!")]] ::MagicalActual::BarbarianAxe*& dyn_axeLeft();
    // Get instance field reference: public MagicalActual.BarbarianAxe axeRight
    [[deprecated("Use field access instead!")]] ::MagicalActual::BarbarianAxe*& dyn_axeRight();
    // Get instance field reference: private System.Single PMELGNJJFDD
    [[deprecated("Use field access instead!")]] float& dyn_PMELGNJJFDD();
    // Get instance field reference: private System.Single LAEOENGPBJL
    [[deprecated("Use field access instead!")]] float& dyn_LAEOENGPBJL();
