// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: BardUpcomingNote
  class BardUpcomingNote;
  // Forward declaring type: BardDrumstick
  class BardDrumstick;
  // Forward declaring type: BardAvailableInstrument
  class BardAvailableInstrument;
  // Forward declaring type: BardInstrument
  class BardInstrument;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Bard
  class Bard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Bard);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Bard*, "MagicalActual", "Bard");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x2B0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Bard
  // [TokenAttribute] Offset: FFFFFFFF
  class Bard : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Bard::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::Bard::arrowSpellIdx
    struct arrowSpellIdx;
    // Nested type: ::MagicalActual::Bard::$$c__DisplayClass112_0
    class $$c__DisplayClass112_0;
    // Nested type: ::MagicalActual::Bard::$$c
    class $$c;
    // Nested type: ::MagicalActual::Bard::$$c__DisplayClass135_0
    class $$c__DisplayClass135_0;
    // Nested type: ::MagicalActual::Bard::$$c__DisplayClass138_0
    class $$c__DisplayClass138_0;
    // Nested type: ::MagicalActual::Bard::$$c__DisplayClass138_1
    class $$c__DisplayClass138_1;
    // Nested type: ::MagicalActual::Bard::$$c__DisplayClass139_0
    class $$c__DisplayClass139_0;
    // Nested type: ::MagicalActual::Bard::$$c__DisplayClass142_0
    class $$c__DisplayClass142_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x28
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: FNINBDEICCD
    char __padding2[0x7] = {};
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 KHIKJLICKKF
    // Size: 0x4
    // Offset: 0x58
    int KHIKJLICKKF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 FJPBNPLIKHA
    // Size: 0x4
    // Offset: 0x5C
    int FJPBNPLIKHA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.GameObject primaryDrumstick
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* primaryDrumstick;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.BoxCollider primaryHitpoint
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::BoxCollider* primaryHitpoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // public UnityEngine.GameObject secondaryDrumstick
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* secondaryDrumstick;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.BoxCollider secondaryHitpoint
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::BoxCollider* secondaryHitpoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // public UnityEngine.GameObject superVfx
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* superVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject drumstickHitVfx
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* drumstickHitVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0x90
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0x91
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x92
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0x93
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single GNEEOPILHPG
    // Size: 0x4
    // Offset: 0x94
    float GNEEOPILHPG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DPKHHNAOFGK
    // Size: 0x4
    // Offset: 0x98
    float DPKHHNAOFGK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean EJIGLMNDIGP
    // Size: 0x1
    // Offset: 0x9C
    bool EJIGLMNDIGP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PHBPMGGLGNG
    // Size: 0x1
    // Offset: 0x9D
    bool PHBPMGGLGNG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PHBPMGGLGNG and: JGOGJDHABHN
    char __padding23[0x2] = {};
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.GameObject DNCIHIJBHKJ
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* DNCIHIJBHKJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject CKAOHCBFDNE
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* CKAOHCBFDNE;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single BGPBJLKNKOF
    // Size: 0x4
    // Offset: 0xB8
    float BGPBJLKNKOF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OBNBKDGGHCH
    // Size: 0x4
    // Offset: 0xBC
    float OBNBKDGGHCH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single LCFDPJCNOCE
    // Size: 0x4
    // Offset: 0xC0
    float LCFDPJCNOCE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean LEGOGAPELIM
    // Size: 0x1
    // Offset: 0xC4
    bool LEGOGAPELIM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PJCDEEBJDOO
    // Size: 0x1
    // Offset: 0xC5
    bool PJCDEEBJDOO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PJCDEEBJDOO and: MHBCOGCKEFA
    char __padding31[0x2] = {};
    // private System.Single MHBCOGCKEFA
    // Size: 0x4
    // Offset: 0xC8
    float MHBCOGCKEFA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EKPBFACIOCO
    // Size: 0x4
    // Offset: 0xCC
    float EKPBFACIOCO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 FDAOFEJNPLG
    // Size: 0xC
    // Offset: 0xD0
    ::UnityEngine::Vector3 FDAOFEJNPLG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 DBLEPIAFDLK
    // Size: 0xC
    // Offset: 0xDC
    ::UnityEngine::Vector3 DBLEPIAFDLK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.GameObject FDDKNHICLPC
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* FDDKNHICLPC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject MEKBANNCELE
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::GameObject* MEKBANNCELE;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Material normalMaterial
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Material* normalMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material highlightedMaterial
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Material* highlightedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.AudioSource metronome
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::AudioSource* metronome;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.GameObject[] instrumentBeltSlots
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::UnityEngine::GameObject*> instrumentBeltSlots;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] instrumentNotchSlots
    // Size: 0x8
    // Offset: 0x118
    ::ArrayW<::UnityEngine::GameObject*> instrumentNotchSlots;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.AudioClip[] bardNotes
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::UnityEngine::AudioClip*> bardNotes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.BardUpcomingNote> GGIGBCEHDDA
    // Size: 0x8
    // Offset: 0x128
    ::System::Collections::Generic::List_1<::MagicalActual::BardUpcomingNote*>* GGIGBCEHDDA;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::BardUpcomingNote*>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.BardUpcomingNote> EMJDBOHFGDB
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::MagicalActual::BardUpcomingNote*>* EMJDBOHFGDB;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::BardUpcomingNote*>*) == 0x8);
    // public UnityEngine.GameObject upcomingNotePrefab
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* upcomingNotePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject upcomingNoteEmpoweredVfx
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::GameObject* upcomingNoteEmpoweredVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playSheet
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::GameObject* playSheet;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject marimbaTarget
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::GameObject* marimbaTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject marimba
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::GameObject* marimba;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject notesContainer
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::GameObject* notesContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.AudioSource instrumentAudio
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::AudioSource* instrumentAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.Vector3 HBKOINHBHMO
    // Size: 0xC
    // Offset: 0x170
    ::UnityEngine::Vector3 HBKOINHBHMO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 JCBHEJGOPMK
    // Size: 0xC
    // Offset: 0x17C
    ::UnityEngine::Vector3 JCBHEJGOPMK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single LLHPAHEDGJE
    // Size: 0x4
    // Offset: 0x188
    float LLHPAHEDGJE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KKCOFOCGMNA
    // Size: 0x4
    // Offset: 0x18C
    float KKCOFOCGMNA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MADJGLIBBJD
    // Size: 0x4
    // Offset: 0x190
    float MADJGLIBBJD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PLEHPGBMBML
    // Size: 0x4
    // Offset: 0x194
    float PLEHPGBMBML;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 LIMJILMDFAP
    // Size: 0x4
    // Offset: 0x198
    int LIMJILMDFAP;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: LIMJILMDFAP and: AMBLPHONNND
    char __padding59[0x4] = {};
    // private System.Int32[] AMBLPHONNND
    // Size: 0x8
    // Offset: 0x1A0
    ::ArrayW<int> AMBLPHONNND;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> NMDANDPLOAJ
    // Size: 0x8
    // Offset: 0x1A8
    ::System::Collections::Generic::List_1<int>* NMDANDPLOAJ;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private MagicalActual.BardDrumstick JDBHDAOHMHI
    // Size: 0x8
    // Offset: 0x1B0
    ::MagicalActual::BardDrumstick* JDBHDAOHMHI;
    // Field size check
    static_assert(sizeof(::MagicalActual::BardDrumstick*) == 0x8);
    // private MagicalActual.BardDrumstick DLHBABGCAJG
    // Size: 0x8
    // Offset: 0x1B8
    ::MagicalActual::BardDrumstick* DLHBABGCAJG;
    // Field size check
    static_assert(sizeof(::MagicalActual::BardDrumstick*) == 0x8);
    // public UnityEngine.GameObject instrumentBeatVfx
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::GameObject* instrumentBeatVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject notePlayedVfx
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::GameObject* notePlayedVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject instrumentPulseVfx
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::GameObject* instrumentPulseVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject instrumentCrescendoVfx
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::GameObject* instrumentCrescendoVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject instrumentChargedVfx
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::GameObject* instrumentChargedVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.BardAvailableInstrument[] EFNLPOAHKHE
    // Size: 0x8
    // Offset: 0x1F0
    ::ArrayW<::MagicalActual::BardAvailableInstrument*> EFNLPOAHKHE;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::BardAvailableInstrument*>) == 0x8);
    // private System.Byte[] DONEMPDHLCA
    // Size: 0x8
    // Offset: 0x1F8
    ::ArrayW<uint8_t> DONEMPDHLCA;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private UnityEngine.Color[] NHAIGDALOAJ
    // Size: 0x8
    // Offset: 0x200
    ::ArrayW<::UnityEngine::Color> NHAIGDALOAJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private System.Int32 CLMHOPCLBCA
    // Size: 0x4
    // Offset: 0x208
    int CLMHOPCLBCA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 LFPGIJDBAHK
    // Size: 0x4
    // Offset: 0x20C
    int LFPGIJDBAHK;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single NGIFIEEOMPC
    // Size: 0x4
    // Offset: 0x210
    float NGIFIEEOMPC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Byte AMEHAHENPCD
    // Size: 0x1
    // Offset: 0x214
    uint8_t AMEHAHENPCD;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte OPOBPKDLAHC
    // Size: 0x1
    // Offset: 0x215
    uint8_t OPOBPKDLAHC;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte OFLDKIABLBN
    // Size: 0x1
    // Offset: 0x216
    uint8_t OFLDKIABLBN;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte LONFMBGCIHF
    // Size: 0x1
    // Offset: 0x217
    uint8_t LONFMBGCIHF;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Single ENDIIBINMIP
    // Size: 0x4
    // Offset: 0x218
    float ENDIIBINMIP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OEHCCOFBGCC
    // Size: 0x4
    // Offset: 0x21C
    float OEHCCOFBGCC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MCKKMHLEFMB
    // Size: 0x4
    // Offset: 0x220
    float MCKKMHLEFMB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ICPOGEBJINM
    // Size: 0x4
    // Offset: 0x224
    float ICPOGEBJINM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MIEGKIECICO
    // Size: 0x4
    // Offset: 0x228
    float MIEGKIECICO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean FMGBDHMKGMC
    // Size: 0x1
    // Offset: 0x22C
    bool FMGBDHMKGMC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean KJBEENINAEI
    // Size: 0x1
    // Offset: 0x22D
    bool KJBEENINAEI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean LCMOOKALBHK
    // Size: 0x1
    // Offset: 0x22E
    bool LCMOOKALBHK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DKGLCBPJFID
    // Size: 0x1
    // Offset: 0x22F
    bool DKGLCBPJFID;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean KEDPADGIDOO
    // Size: 0x1
    // Offset: 0x230
    bool KEDPADGIDOO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KEDPADGIDOO and: songsToPlay
    char __padding89[0x3] = {};
    // public System.Int32 songsToPlay
    // Size: 0x4
    // Offset: 0x234
    int songsToPlay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32[][] NBECOFNMLMP
    // Size: 0x8
    // Offset: 0x238
    ::ArrayW<::ArrayW<int>> NBECOFNMLMP;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] GAFKOPDCLMP
    // Size: 0x8
    // Offset: 0x240
    ::ArrayW<::ArrayW<int>> GAFKOPDCLMP;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] JDJNILJLAEC
    // Size: 0x8
    // Offset: 0x248
    ::ArrayW<::ArrayW<int>> JDJNILJLAEC;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] OBJDPCMMPDB
    // Size: 0x8
    // Offset: 0x250
    ::ArrayW<::ArrayW<int>> OBJDPCMMPDB;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] BCHPICCGBBK
    // Size: 0x8
    // Offset: 0x258
    ::ArrayW<::ArrayW<int>> BCHPICCGBBK;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] NOGDBABFEMJ
    // Size: 0x8
    // Offset: 0x260
    ::ArrayW<::ArrayW<int>> NOGDBABFEMJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] ABDMCBCMPFB
    // Size: 0x8
    // Offset: 0x268
    ::ArrayW<::ArrayW<int>> ABDMCBCMPFB;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] EOLLCBKONOD
    // Size: 0x8
    // Offset: 0x270
    ::ArrayW<::ArrayW<int>> EOLLCBKONOD;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] KFCGMPFAJAJ
    // Size: 0x8
    // Offset: 0x278
    ::ArrayW<::ArrayW<int>> KFCGMPFAJAJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] AJOJOJDHHDM
    // Size: 0x8
    // Offset: 0x280
    ::ArrayW<::ArrayW<int>> AJOJOJDHHDM;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] KGLNOIAIKJA
    // Size: 0x8
    // Offset: 0x288
    ::ArrayW<::ArrayW<int>> KGLNOIAIKJA;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][] FOADAJHCHOD
    // Size: 0x8
    // Offset: 0x290
    ::ArrayW<::ArrayW<int>> FOADAJHCHOD;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<int>>) == 0x8);
    // private System.Int32[][][] CABCGFKDCBK
    // Size: 0x8
    // Offset: 0x298
    ::ArrayW<::ArrayW<::ArrayW<int>>> CABCGFKDCBK;
    // Field size check
    static_assert(sizeof(::ArrayW<::ArrayW<::ArrayW<int>>>) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> CEAJKGCEAGL
    // Size: 0x8
    // Offset: 0x2A0
    ::System::Collections::Generic::List_1<int>* CEAJKGCEAGL;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Int32[] CIBDAONHMIO
    // Size: 0x8
    // Offset: 0x2A8
    ::ArrayW<int> CIBDAONHMIO;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
