// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObscuredUShort
#include "CodeStage/AntiCheat/ObscuredTypes/ObscuredUShort.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: BoostBomb
  class BoostBomb;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::BoostBomb);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::BoostBomb*, "MagicalActual", "BoostBomb");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.BoostBomb
  // [TokenAttribute] Offset: FFFFFFFF
  class BoostBomb : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public MagicalActual.PlayerTool myTool
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerTool* myTool;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    // public UnityEngine.GameObject model
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* model;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public CodeStage.AntiCheat.ObscuredTypes.ObscuredUShort boostBombType
    // Size: 0x9
    // Offset: 0x28
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredUShort boostBombType;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredUShort) == 0x9);
    // Padding between fields: boostBombType and: BHDFMKPMCPM
    char __padding2[0x1] = {};
    // private System.Boolean BHDFMKPMCPM
    // Size: 0x1
    // Offset: 0x32
    bool BHDFMKPMCPM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean FFDEBPIEPDO
    // Size: 0x1
    // Offset: 0x33
    bool FFDEBPIEPDO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single CKJMGLKIFDD
    // Size: 0x4
    // Offset: 0x34
    float CKJMGLKIFDD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 APHKKAKIAKB
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 APHKKAKIAKB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.PlayerTool myTool
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerTool*& dyn_myTool();
    // Get instance field reference: public UnityEngine.GameObject model
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_model();
    // Get instance field reference: public CodeStage.AntiCheat.ObscuredTypes.ObscuredUShort boostBombType
    [[deprecated("Use field access instead!")]] ::CodeStage::AntiCheat::ObscuredTypes::ObscuredUShort& dyn_boostBombType();
    // Get instance field reference: private System.Boolean BHDFMKPMCPM
    [[deprecated("Use field access instead!")]] bool& dyn_BHDFMKPMCPM();
