// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.BoundingSphere
#include "UnityEngine/BoundingSphere.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: SphereCuller
  class SphereCuller;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: CullingGroup
  class CullingGroup;
  // Forward declaring type: CullingGroupEvent
  struct CullingGroupEvent;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: BoxCuller
  class BoxCuller;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::BoxCuller);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::BoxCuller*, "MagicalActual", "BoxCuller");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.BoxCuller
  // [TokenAttribute] Offset: FFFFFFFF
  class BoxCuller : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.SphereCuller[] PDJPMPNHGJK
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::MagicalActual::SphereCuller*> PDJPMPNHGJK;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::SphereCuller*>) == 0x8);
    // private UnityEngine.CullingGroup IHGMDNHLAOL
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::CullingGroup* IHGMDNHLAOL;
    // Field size check
    static_assert(sizeof(::UnityEngine::CullingGroup*) == 0x8);
    // private UnityEngine.BoundingSphere[] NJBNHEJGAAJ
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::BoundingSphere> NJBNHEJGAAJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::BoundingSphere>) == 0x8);
    // private System.Boolean NECIOIDGILI
    // Size: 0x1
    // Offset: 0x30
    bool NECIOIDGILI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NECIOIDGILI and: HLLJEMEBKPM
    char __padding3[0x7] = {};
    // private System.String HLLJEMEBKPM
    // Size: 0x8
    // Offset: 0x38
    ::StringW HLLJEMEBKPM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.SphereCuller[] PDJPMPNHGJK
    [[deprecated("Use field access instead!")]] ::ArrayW<::MagicalActual::SphereCuller*>& dyn_PDJPMPNHGJK();
    // Get instance field reference: private UnityEngine.CullingGroup IHGMDNHLAOL
    [[deprecated("Use field access instead!")]] ::UnityEngine::CullingGroup*& dyn_IHGMDNHLAOL();
    // Get instance field reference: private UnityEngine.BoundingSphere[] NJBNHEJGAAJ
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::BoundingSphere>& dyn_NJBNHEJGAAJ();
    // Get instance field reference: private System.Boolean NECIOIDGILI
    [[deprecated("Use field access instead!")]] bool& dyn_NECIOIDGILI();
    // Get instance field reference: private System.String HLLJEMEBKPM
    [[deprecated("Use field access instead!")]] ::StringW& dyn_HLLJEMEBKPM();
    // private System.Void OJFAEAIKFED()
    // Offset: 0x17987D0
    void OJFAEAIKFED();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x1798EA0
    void KBDGAPMJGLG();
    // public System.Void OnDestroy()
    // Offset: 0x1799600
    void OnDestroy();
    // private System.Void OPNJBPHPDJJ(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x1799614
    void OPNJBPHPDJJ(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // public System.Void Rescan()
    // Offset: 0x179992C
    void Rescan();
    // private System.Void KKLFAINJENI(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x1799ED4
    void KKLFAINJENI(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // public System.Void ALDELOEJOAD()
    // Offset: 0x179A1EC
    void ALDELOEJOAD();
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x179A71C
    void AHPDCIGFMJI();
    // public System.Void LGPGLFGMODN()
    // Offset: 0x179AE20
    void LGPGLFGMODN();
    // private System.Void GPFBGGFPINB()
    // Offset: 0x179AE34
    void GPFBGGFPINB();
    // public System.Void LHOPDGBGLEM()
    // Offset: 0x179A8D4
    void LHOPDGBGLEM();
    // public System.Void GMNJEIOBNJG()
    // Offset: 0x179AFF0
    void GMNJEIOBNJG();
    // public System.Void MDLALKIJEBN()
    // Offset: 0x179B0FC
    void MDLALKIJEBN();
    // private System.Void CIBLKBGGLHI(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179B110
    void CIBLKBGGLHI(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // public System.Void MDALPNHFBBJ()
    // Offset: 0x179B428
    void MDALPNHFBBJ();
    // private System.Void LJEKGPIPIFA(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179B43C
    void LJEKGPIPIFA(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // private System.Void PIFGPBKDAOK(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179B758
    void PIFGPBKDAOK(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // private System.Void LMKFMMOGFDB(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179BA70
    void LMKFMMOGFDB(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // public System.Void ICMFFIJDFOH()
    // Offset: 0x179BD8C
    void ICMFFIJDFOH();
    // public System.Void .ctor()
    // Offset: 0x179BE98
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static BoxCuller* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::BoxCuller::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<BoxCuller*, creationType>()));
    }
    // private System.Void FOLEDJJJADG(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179BEF0
    void FOLEDJJJADG(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // private System.Void OACMGPBCPEL()
    // Offset: 0x179C20C
    void OACMGPBCPEL();
    // public System.Void DKHCBPBNNNM()
    // Offset: 0x179905C
    void DKHCBPBNNNM();
    // public System.Void NMKKEOHDCJF()
    // Offset: 0x179C3C8
    void NMKKEOHDCJF();
    // public System.Void EOGJBFKHFPO()
    // Offset: 0x179C4D8
    void EOGJBFKHFPO();
    // private System.Void OLKKDIKIPNE(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179CA30
    void OLKKDIKIPNE(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // private System.Void DFCOAPEIKLN()
    // Offset: 0x179CD4C
    void DFCOAPEIKLN();
    // public System.Void AKKOAMPAEEB()
    // Offset: 0x179CF0C
    void AKKOAMPAEEB();
    // public System.Void KDBGBFBCBCF()
    // Offset: 0x179D458
    void KDBGBFBCBCF();
    // private System.Void HHHAAAPOLBM(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179D46C
    void HHHAAAPOLBM(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // private System.Void EAGNDKMACKF(UnityEngine.CullingGroupEvent LFNCKLDCHAG)
    // Offset: 0x179D788
    void EAGNDKMACKF(::UnityEngine::CullingGroupEvent LFNCKLDCHAG);
    // public System.Void BBJGCNABFCG()
    // Offset: 0x179DAA0
    void BBJGCNABFCG();
    // private System.Void FNGLOIECKDG()
    // Offset: 0x179DAB4
    void FNGLOIECKDG();
    // public System.Void OnDisable()
    // Offset: 0x179DC70
    void OnDisable();
    // private System.Void ABIHCGOKNCL()
    // Offset: 0x179DD7C
    void ABIHCGOKNCL();
    // public System.Void HJBPPCEFHMJ()
    // Offset: 0x179DF34
    void HJBPPCEFHMJ();
    // public System.Void JKDFCMDDCIK()
    // Offset: 0x179E4A8
    void JKDFCMDDCIK();
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x179E4BC
    void FGIFGGNGKPK();
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x179E670
    void EIIKFEMCNKM();
    // public System.Void EJPPHNJKFPP()
    // Offset: 0x179E82C
    void EJPPHNJKFPP();
    // public System.Void GDCLKLCCLGP()
    // Offset: 0x1798988
    void GDCLKLCCLGP();
    // private System.Void Start()
    // Offset: 0x179E840
    void Start();
    // private System.Void APMNGLNBFNP()
    // Offset: 0x179E9F4
    void APMNGLNBFNP();
    // private System.Void APIMIOELFAJ()
    // Offset: 0x179EBA8
    void APIMIOELFAJ();
    // public System.Void BLLECEOABBI()
    // Offset: 0x179ED5C
    void BLLECEOABBI();
  }; // MagicalActual.BoxCuller
  #pragma pack(pop)
  static check_size<sizeof(BoxCuller), 56 + sizeof(::StringW)> __MagicalActual_BoxCullerSizeCheck;
  static_assert(sizeof(BoxCuller) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::BoxCuller::OJFAEAIKFED
// Il2CppName: OJFAEAIKFED
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::BoxCuller::*)()>(&MagicalActual::BoxCuller::OJFAEAIKFED)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::BoxCuller*), "OJFAEAIKFED", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::BoxCuller::KBDGAPMJGLG
// Il2CppName: KBDGAPMJGLG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::BoxCuller::*)()>(&MagicalActual::BoxCuller::KBDGAPMJGLG)> {
  static const MethodInfo* get() {
