// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
  // Forward declaring type: Grabber
  class Grabber;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CameraBot
  class CameraBot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CameraBot);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CameraBot*, "MagicalActual", "CameraBot");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CameraBot
  // [TokenAttribute] Offset: FFFFFFFF
  class CameraBot : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Boolean JHFEGDEMJOF
    // Size: 0x1
    // Offset: 0x18
    bool JHFEGDEMJOF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JHFEGDEMJOF and: LFCHOIJBFFN
    char __padding0[0x3] = {};
    // private System.Single LFCHOIJBFFN
    // Size: 0x4
    // Offset: 0x1C
    float LFCHOIJBFFN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KHINBJFLALH
    // Size: 0x4
    // Offset: 0x20
    float KHINBJFLALH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KDGNILBBHJF
    // Size: 0x4
    // Offset: 0x24
    float KDGNILBBHJF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BPGIICNLNON
    // Size: 0x4
    // Offset: 0x28
    float BPGIICNLNON;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean HEOEPONHEFJ
    // Size: 0x1
    // Offset: 0x2C
    bool HEOEPONHEFJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HEOEPONHEFJ and: EIPMBKLODIJ
    char __padding5[0x3] = {};
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public UnityEngine.GameObject cameraObject
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* cameraObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3180
    // private MagicalActual.PlayerTool <DGACPEMHNJJ>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerTool* DGACPEMHNJJ;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Boolean JHFEGDEMJOF
    [[deprecated("Use field access instead!")]] bool& dyn_JHFEGDEMJOF();
    // Get instance field reference: private System.Single LFCHOIJBFFN
    [[deprecated("Use field access instead!")]] float& dyn_LFCHOIJBFFN();
    // Get instance field reference: private System.Single KHINBJFLALH
    [[deprecated("Use field access instead!")]] float& dyn_KHINBJFLALH();
    // Get instance field reference: private System.Single KDGNILBBHJF
    [[deprecated("Use field access instead!")]] float& dyn_KDGNILBBHJF();
    // Get instance field reference: private System.Single BPGIICNLNON
