// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Renderer
  class Renderer;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: ProgressBarPro
  class ProgressBarPro;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CapturePoint
  class CapturePoint;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CapturePoint);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CapturePoint*, "MagicalActual", "CapturePoint");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x56
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CapturePoint
  // [TokenAttribute] Offset: FFFFFFFF
  class CapturePoint : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x20
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String pointName
    // Size: 0x8
    // Offset: 0x28
    ::StringW pointName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Renderer myFlagRenderer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Renderer* myFlagRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // public SuperTextMesh myText
    // Size: 0x8
    // Offset: 0x38
    ::GlobalNamespace::SuperTextMesh* myText;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public ProgressBarPro redBar
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::ProgressBarPro* redBar;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // public ProgressBarPro blueBar
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::ProgressBarPro* blueBar;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // private System.Single KMLEGFBOEIN
    // Size: 0x4
    // Offset: 0x50
    float KMLEGFBOEIN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Byte PAGLBLHHBFE
    // Size: 0x1
    // Offset: 0x54
    uint8_t PAGLBLHHBFE;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean JHMLPPBBCPJ
    // Size: 0x1
    // Offset: 0x55
    bool JHMLPPBBCPJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: public System.String pointName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_pointName();
    // Get instance field reference: public UnityEngine.Renderer myFlagRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::Renderer*& dyn_myFlagRenderer();
    // Get instance field reference: public SuperTextMesh myText
