// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ChaosWyvern
  class ChaosWyvern;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ChaosWyvern);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ChaosWyvern*, "MagicalActual", "ChaosWyvern");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ChaosWyvern
  // [TokenAttribute] Offset: FFFFFFFF
  class ChaosWyvern : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.GameObject teleportVFX
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* teleportVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject healthBar
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* healthBar;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean JCCILHIBOBO
    // Size: 0x1
    // Offset: 0x38
    bool JCCILHIBOBO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JCCILHIBOBO and: GCLKDLJHJEI
    char __padding4[0x3] = {};
    // private UnityEngine.Vector3 GCLKDLJHJEI
    // Size: 0xC
    // Offset: 0x3C
    ::UnityEngine::Vector3 GCLKDLJHJEI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 AEPLPJKOEHP
    // Size: 0xC
    // Offset: 0x48
    ::UnityEngine::Vector3 AEPLPJKOEHP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single LEPDCJMEJHH
    // Size: 0x4
    // Offset: 0x54
    float LEPDCJMEJHH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.GameObject teleportVFX
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_teleportVFX();
    // Get instance field reference: private UnityEngine.GameObject healthBar
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_healthBar();
