// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: OrbusAudioParticleController
  class OrbusAudioParticleController;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ChainLinkController
  class ChainLinkController;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CitadelBoss2
  class CitadelBoss2;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CitadelBoss2);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CitadelBoss2*, "MagicalActual", "CitadelBoss2");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x84
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CitadelBoss2
  // [TokenAttribute] Offset: FFFFFFFF
  class CitadelBoss2 : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.GameObject chainCircleVFX
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* chainCircleVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.OrbusAudioParticleController anticipationVFX
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::OrbusAudioParticleController* anticipationVFX;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusAudioParticleController*) == 0x8);
    // private MagicalActual.OrbusAudioParticleController climaxVFX
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::OrbusAudioParticleController* climaxVFX;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusAudioParticleController*) == 0x8);
    // private UnityEngine.GameObject rampageVFX
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* rampageVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Animator circleChainAnimator
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Animator* circleChainAnimator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.Animator NBNKFBECLJG
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Animator* NBNKFBECLJG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.Transform chainStart
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* chainStart;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private ChainLinkController[] chains
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::GlobalNamespace::ChainLinkController*> chains;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::ChainLinkController*>) == 0x8);
    // private System.UInt16[] AMCFKCMGFLC
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<uint16_t> AMCFKCMGFLC;
    // Field size check
    static_assert(sizeof(::ArrayW<uint16_t>) == 0x8);
    // private UnityEngine.Vector3[] CKHNCBPDLNL
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::Vector3> CKHNCBPDLNL;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Single MEHACPCKELN
    // Size: 0x4
    // Offset: 0x78
    float MEHACPCKELN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OAIMGMAMPFM
    // Size: 0x4
    // Offset: 0x7C
    float OAIMGMAMPFM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DIHOHLDOHHA
    // Size: 0x4
    // Offset: 0x80
    float DIHOHLDOHHA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.GameObject chainCircleVFX
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_chainCircleVFX();
    // Get instance field reference: private MagicalActual.OrbusAudioParticleController anticipationVFX
    [[deprecated("Use field access instead!")]] ::MagicalActual::OrbusAudioParticleController*& dyn_anticipationVFX();
