// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CitadelBoss4
  class CitadelBoss4;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CitadelBoss4);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CitadelBoss4*, "MagicalActual", "CitadelBoss4");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x5C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CitadelBoss4
  // [TokenAttribute] Offset: FFFFFFFF
  class CitadelBoss4 : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.MeshRenderer shield
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::MeshRenderer* shield;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.GameObject portalHint
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* portalHint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Material MGGKKBOKFDK
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Material* MGGKKBOKFDK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Int32 HJGFEMELLII
    // Size: 0x4
    // Offset: 0x40
    int HJGFEMELLII;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: HJGFEMELLII and: phases
    char __padding5[0x4] = {};
    // private UnityEngine.Color[] phases
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::Color> phases;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private UnityEngine.Vector3 DIKAGIFEIEP
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 DIKAGIFEIEP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.MeshRenderer shield
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshRenderer*& dyn_shield();
    // Get instance field reference: private UnityEngine.GameObject portalHint
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_portalHint();
