// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ClockworkHunter
  class ClockworkHunter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ClockworkHunter);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ClockworkHunter*, "MagicalActual", "ClockworkHunter");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x41
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ClockworkHunter
  // [TokenAttribute] Offset: FFFFFFFF
  class ClockworkHunter : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.GameObject clockworkBeamPrefab
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* clockworkBeamPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject OHOBCLNOKID
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* OHOBCLNOKID;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject breakShieldVfx
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* breakShieldVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean AKHIIFCMIPL
    // Size: 0x1
    // Offset: 0x40
    bool AKHIIFCMIPL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public UnityEngine.GameObject clockworkBeamPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_clockworkBeamPrefab();
    // Get instance field reference: private UnityEngine.GameObject OHOBCLNOKID
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_OHOBCLNOKID();
    // Get instance field reference: public UnityEngine.GameObject breakShieldVfx
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_breakShieldVfx();
    // Get instance field reference: private System.Boolean AKHIIFCMIPL
    [[deprecated("Use field access instead!")]] bool& dyn_AKHIIFCMIPL();
    // private System.Void NNBODOLEAFK()
    // Offset: 0x1D2174C
    void NNBODOLEAFK();
    // private System.Void DGIKKMCHFGM(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D218BC
    void DGIKKMCHFGM(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void AGPEIDHOJPN(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D21944
    void AGPEIDHOJPN(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void JMPPPHNKAFG()
    // Offset: 0x1D219CC
    void JMPPPHNKAFG();
    // private System.Void DDOOFFHBJJN(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D219D0
    void DDOOFFHBJJN(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void KIPDPKEIOEO()
    // Offset: 0x1D21A58
    void KIPDPKEIOEO();
    // private System.Void HKINNMLBMMG()
    // Offset: 0x1D21A5C
    void HKINNMLBMMG();
    // public System.Void OFDMFGNMEOP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1D21B9C
    void OFDMFGNMEOP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void MONCBOKMLEA(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D21C50
    void MONCBOKMLEA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1D21CD8
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BLDNGKHOIID(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D21D8C
    void BLDNGKHOIID(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void LOEFDHDIHGE()
    // Offset: 0x1D21E14
    void LOEFDHDIHGE();
    // private System.Void DPJJHPHGGGB(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D21F84
    void DPJJHPHGGGB(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void EHGHLOMCBAG(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D2200C
    void EHGHLOMCBAG(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1D22094
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AMGJNJLJIFO()
    // Offset: 0x1D22148
    void AMGJNJLJIFO();
    // private System.Void FixedUpdate()
    // Offset: 0x1D222B8
    void FixedUpdate();
    // private System.Void LOKDCCBIBCM(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D22424
    void LOKDCCBIBCM(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void OHJOGJPPNLI(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D224AC
    void OHJOGJPPNLI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void PFPDONMFLDH()
    // Offset: 0x1D22534
    void PFPDONMFLDH();
    // private System.Void NEDFCIDMJBB()
    // Offset: 0x1D225E0
    void NEDFCIDMJBB();
    // private System.Void Awake()
    // Offset: 0x1D22724
    void Awake();
    // private System.Void Start()
    // Offset: 0x1D22728
    void Start();
    // private System.Void HHKOFMNJKDA()
    // Offset: 0x1D22868
    void HHKOFMNJKDA();
    // private System.Void BIMCNDAFFJC()
    // Offset: 0x1D229D8
    void BIMCNDAFFJC();
    // public System.Void PPKPHFHCELO(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1D22B48
    void PPKPHFHCELO(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void ANKCGGIBCAI()
    // Offset: 0x1D22BFC
    void ANKCGGIBCAI();
    // private System.Void FAHDGOAALEM()
    // Offset: 0x1D22D6C
    void FAHDGOAALEM();
    // public System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1D22E18
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void IDOCJGNLNFL()
    // Offset: 0x1D22ECC
    void IDOCJGNLNFL();
    // private System.Void BIECMCLCPFG(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D23010
    void BIECMCLCPFG(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void AKONOOIDPDA()
    // Offset: 0x1D23098
    void AKONOOIDPDA();
    // private System.Void HDMHEDEGDFD()
    // Offset: 0x1D2309C
    void HDMHEDEGDFD();
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1D230A0
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KPOAAAHLGLA()
    // Offset: 0x1D23154
    void KPOAAAHLGLA();
    // private System.Void LBBHKKFNJPA()
    // Offset: 0x1D23298
    void LBBHKKFNJPA();
    // private System.Void JCOEAIILOND()
    // Offset: 0x1D23344
    void JCOEAIILOND();
    // private System.Void LKJDOIJDNMM(System.Object OMLPNCLFFMJ)
    // Offset: 0x1D234B4
    void LKJDOIJDNMM(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void .ctor()
    // Offset: 0x1D2353C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ClockworkHunter* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::ClockworkHunter::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ClockworkHunter*, creationType>()));
    }
    // private System.Void OnDestroy()
    // Offset: 0x1D23594
    void OnDestroy();
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x1D23640
    void MLGBKBMHHLE();
  }; // MagicalActual.ClockworkHunter
  #pragma pack(pop)
  static check_size<sizeof(ClockworkHunter), 64 + sizeof(bool)> __MagicalActual_ClockworkHunterSizeCheck;
  static_assert(sizeof(ClockworkHunter) == 0x41);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::ClockworkHunter::NNBODOLEAFK
// Il2CppName: NNBODOLEAFK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::ClockworkHunter::*)()>(&MagicalActual::ClockworkHunter::NNBODOLEAFK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::ClockworkHunter*), "NNBODOLEAFK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::ClockworkHunter::DGIKKMCHFGM
// Il2CppName: DGIKKMCHFGM
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::ClockworkHunter::*)(::Il2CppObject*)>(&MagicalActual::ClockworkHunter::DGIKKMCHFGM)> {
  static const MethodInfo* get() {
