// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: Animator
  class Animator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ConfettiGun
  class ConfettiGun;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ConfettiGun);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ConfettiGun*, "MagicalActual", "ConfettiGun");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ConfettiGun
  // [TokenAttribute] Offset: FFFFFFFF
  class ConfettiGun : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.PlayerTool FKJHGIFOJKD
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerTool* FKJHGIFOJKD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    // public UnityEngine.GameObject confettiVfx
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* confettiVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.AudioSource GHPLEIOBCOD
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::AudioSource* GHPLEIOBCOD;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip gunFireSound
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::AudioClip* gunFireSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.Animator NBNKFBECLJG
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Animator* NBNKFBECLJG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private System.Single AGFNNJEGMIL
    // Size: 0x4
    // Offset: 0x40
    float AGFNNJEGMIL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NJEAJDANNLE
    // Size: 0x4
    // Offset: 0x44
    float NJEAJDANNLE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.PlayerTool FKJHGIFOJKD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerTool*& dyn_FKJHGIFOJKD();
    // Get instance field reference: public UnityEngine.GameObject confettiVfx
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_confettiVfx();
    // Get instance field reference: private UnityEngine.AudioSource GHPLEIOBCOD
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_GHPLEIOBCOD();
    // Get instance field reference: public UnityEngine.AudioClip gunFireSound
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_gunFireSound();
    // Get instance field reference: private UnityEngine.Animator NBNKFBECLJG
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_NBNKFBECLJG();
    // Get instance field reference: private System.Single AGFNNJEGMIL
    [[deprecated("Use field access instead!")]] float& dyn_AGFNNJEGMIL();
    // Get instance field reference: private System.Single NJEAJDANNLE
    [[deprecated("Use field access instead!")]] float& dyn_NJEAJDANNLE();
    // private System.Void LEKNJGKKCIE(System.Byte KLIPNGBEELK)
    // Offset: 0x1D2E844
    void LEKNJGKKCIE(uint8_t KLIPNGBEELK);
    // private System.Void NEDFCIDMJBB()
    // Offset: 0x1D2EAB4
    void NEDFCIDMJBB();
    // private System.Void PGENGDMGJOK(System.Byte KLIPNGBEELK)
    // Offset: 0x1D2EB3C
    void PGENGDMGJOK(uint8_t KLIPNGBEELK);
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x1D2EDAC
    void EPCHNEGNKNF();
    // private System.Void NNBODOLEAFK()
    // Offset: 0x1D2EE34
    void NNBODOLEAFK();
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x1D2EE74
    void MLGBKBMHHLE();
    // private System.Void IFLGMEJOOFK()
    // Offset: 0x1D2EEFC
    void IFLGMEJOOFK();
    // private System.Void IPKKJINNGAF()
    // Offset: 0x1D2EF4C
    void IPKKJINNGAF();
    // private System.Void HMLPEKMDCDI(System.Byte KLIPNGBEELK)
    // Offset: 0x1D2EF8C
    void HMLPEKMDCDI(uint8_t KLIPNGBEELK);
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x1D2F1FC
    void EIIKFEMCNKM();
    // private System.Void MJOHBIENFBC()
    // Offset: 0x1D2F284
    void MJOHBIENFBC();
    // private System.Void AGOBDBDGJKD()
    // Offset: 0x1D2F2D8
    void AGOBDBDGJKD();
    // private System.Void IKLEACMHAMK()
    // Offset: 0x1D2F318
    void IKLEACMHAMK();
    // private System.Void AKGFEENGKJD()
    // Offset: 0x1D2F36C
    void AKGFEENGKJD();
    // private System.Void GPNKFJCGIPH()
    // Offset: 0x1D2F3F4
    void GPNKFJCGIPH();
    // public System.Void .ctor()
    // Offset: 0x1D2F448
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ConfettiGun* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::ConfettiGun::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ConfettiGun*, creationType>()));
    }
    // private System.Void APMNGLNBFNP()
    // Offset: 0x1D2F458
    void APMNGLNBFNP();
    // private System.Void JLADKFMLIAN(System.Byte KLIPNGBEELK)
    // Offset: 0x1D2F4E0
    void JLADKFMLIAN(uint8_t KLIPNGBEELK);
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x1D2F74C
    void AHPDCIGFMJI();
    // private System.Void CIJPPCPNPCI()
    // Offset: 0x1D2F7D4
    void CIJPPCPNPCI();
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x1D2F814
    void DGJGAFKDIDK();
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x1D2F89C
    void LPLGKBGLPOK();
    // private System.Void Start()
    // Offset: 0x1D2F924
    void Start();
    // private System.Void IOHCMGPOHBM(System.Byte KLIPNGBEELK)
    // Offset: 0x1D2F9AC
    void IOHCMGPOHBM(uint8_t KLIPNGBEELK);
    // private System.Void GGAFMPPDBOH()
    // Offset: 0x1D2FC1C
    void GGAFMPPDBOH();
    // private System.Void PhysicsInteractableTrigger()
    // Offset: 0x1D2FC5C
    void PhysicsInteractableTrigger();
    // private System.Void AIEPGHLFDAL()
    // Offset: 0x1D2FCA8
    void AIEPGHLFDAL();
    // private System.Void JCOEAIILOND()
    // Offset: 0x1D2FCE8
    void JCOEAIILOND();
    // private System.Void PMMNOANBFKJ()
    // Offset: 0x1D2FD28
    void PMMNOANBFKJ();
    // private System.Void HAOOMMNPNGF(System.Byte KLIPNGBEELK)
    // Offset: 0x1D2FD78
    void HAOOMMNPNGF(uint8_t KLIPNGBEELK);
    // private System.Void BGLNFMKAGJG()
    // Offset: 0x1D2FFE8
    void BGLNFMKAGJG();
    // private System.Void DOCJMCPAEOI(System.Byte KLIPNGBEELK)
    // Offset: 0x1D30038
    void DOCJMCPAEOI(uint8_t KLIPNGBEELK);
    // private System.Void SignalReceived(System.Byte KLIPNGBEELK)
    // Offset: 0x1D302A8
    void SignalReceived(uint8_t KLIPNGBEELK);
    // private System.Void OPEIEDLCMJE(System.Byte KLIPNGBEELK)
    // Offset: 0x1D30504
    void OPEIEDLCMJE(uint8_t KLIPNGBEELK);
    // private System.Void BKGHKPPKGCA()
    // Offset: 0x1D30774
    void BKGHKPPKGCA();
    // private System.Void JDJIFAJICCP()
    // Offset: 0x1D307C8
    void JDJIFAJICCP();
    // private System.Void FixedUpdate()
    // Offset: 0x1D30818
    void FixedUpdate();
    // private System.Void ABBNBBPDILC(System.Byte KLIPNGBEELK)
    // Offset: 0x1D30858
    void ABBNBBPDILC(uint8_t KLIPNGBEELK);
    // private System.Void AMIPIMKIJMO()
    // Offset: 0x1D30AC8
    void AMIPIMKIJMO();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x1D30B08
    void KBDGAPMJGLG();
    // private System.Void MKHEDAAIDIE()
    // Offset: 0x1D30B90
    void MKHEDAAIDIE();
    // private System.Void JENOIOBAEPG()
    // Offset: 0x1D30BD0
    void JENOIOBAEPG();
    // private System.Void JPHEBENNLCB()
    // Offset: 0x1D30C58
    void JPHEBENNLCB();
  }; // MagicalActual.ConfettiGun
  #pragma pack(pop)
  static check_size<sizeof(ConfettiGun), 68 + sizeof(float)> __MagicalActual_ConfettiGunSizeCheck;
  static_assert(sizeof(ConfettiGun) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::ConfettiGun::LEKNJGKKCIE
// Il2CppName: LEKNJGKKCIE
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::ConfettiGun::*)(uint8_t)>(&MagicalActual::ConfettiGun::LEKNJGKKCIE)> {
  static const MethodInfo* get() {
    static auto* KLIPNGBEELK = &::il2cpp_utils::GetClassFromName("System", "Byte")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::ConfettiGun*), "LEKNJGKKCIE", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{KLIPNGBEELK});
  }
};
// Writing MetadataGetter for method: MagicalActual::ConfettiGun::NEDFCIDMJBB
// Il2CppName: NEDFCIDMJBB
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::ConfettiGun::*)()>(&MagicalActual::ConfettiGun::NEDFCIDMJBB)> {
  static const MethodInfo* get() {
