// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: MeshCollider
  class MeshCollider;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ConstructablePiece
  class ConstructablePiece;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ConstructablePiece);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ConstructablePiece*, "MagicalActual", "ConstructablePiece");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ConstructablePiece
  // [TokenAttribute] Offset: FFFFFFFF
  class ConstructablePiece : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Rigidbody DEDDHIEDNMH
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rigidbody* DEDDHIEDNMH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.GameObject DDGCEAONKAK
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* DDGCEAONKAK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.MeshRenderer JKLAGPELEEF
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::MeshRenderer* JKLAGPELEEF;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.MeshFilter GGAGBPCDDMJ
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::MeshFilter* GGAGBPCDDMJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshCollider MIOHHEKDNNO
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshCollider* MIOHHEKDNNO;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshCollider*) == 0x8);
    // private PhysicsInteractable CMJCOEANHMP
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::PhysicsInteractable* CMJCOEANHMP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.Vector3 FKKFPPDHEBJ
    // Size: 0xC
    // Offset: 0x48
    ::UnityEngine::Vector3 FKKFPPDHEBJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 ACNGEJPJIFP
    // Size: 0xC
    // Offset: 0x54
    ::UnityEngine::Vector3 ACNGEJPJIFP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean isLocked
    // Size: 0x1
    // Offset: 0x60
    bool isLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Rigidbody DEDDHIEDNMH
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_DEDDHIEDNMH();
    // Get instance field reference: private UnityEngine.GameObject DDGCEAONKAK
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_DDGCEAONKAK();
    // Get instance field reference: private UnityEngine.MeshRenderer JKLAGPELEEF
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshRenderer*& dyn_JKLAGPELEEF();
    // Get instance field reference: private UnityEngine.MeshFilter GGAGBPCDDMJ
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshFilter*& dyn_GGAGBPCDDMJ();
