// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: OrbusAudioParticleController
  class OrbusAudioParticleController;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CorruptedNatureGiant
  class CorruptedNatureGiant;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CorruptedNatureGiant);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CorruptedNatureGiant*, "MagicalActual", "CorruptedNatureGiant");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CorruptedNatureGiant
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD3034
  class CorruptedNatureGiant : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private MagicalActual.OrbusAudioParticleController worldBossEffect
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::OrbusAudioParticleController* worldBossEffect;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusAudioParticleController*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x30
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private MagicalActual.OrbusAudioParticleController worldBossEffect
    [[deprecated("Use field access instead!")]] ::MagicalActual::OrbusAudioParticleController*& dyn_worldBossEffect();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2057968
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HMKJKOKPOBP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2057A40
    void HMKJKOKPOBP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JCOFJKJMOAA()
    // Offset: 0x2057B18
    void JCOFJKJMOAA();
    // public System.Void KDPEOPPDLLP()
    // Offset: 0x2057D3C
    void KDPEOPPDLLP();
    // public System.Void JFBOMHHGFDN()
    // Offset: 0x2057F60
    void JFBOMHHGFDN();
    // private System.Void FBHLJMIDKDO(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2058184
    void FBHLJMIDKDO(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x20581B4
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void Start()
    // Offset: 0x205828C
    void Start();
    // public System.Void HLGKLABMHHD()
    // Offset: 0x20582E4
    void HLGKLABMHHD();
    // private System.Void CLNMKBPKGDN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2058508
    void CLNMKBPKGDN(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void AEDBMBNPNLF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2058538
    void AEDBMBNPNLF(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void CEPPICBNJOI()
    // Offset: 0x2058568
    void CEPPICBNJOI();
    // private System.Void ABIHCGOKNCL()
    // Offset: 0x205878C
    void ABIHCGOKNCL();
    // public System.Void DICPOOMKKKB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x20587E4
    void DICPOOMKKKB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FMEPBEDDFEM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x20588BC
    void FMEPBEDDFEM(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void DKILGFBCKHD()
    // Offset: 0x20588EC
    void DKILGFBCKHD();
    // public System.Void AMBHFINDKPK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2058B10
    void AMBHFINDKPK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void CCOODLILKJD()
    // Offset: 0x2058BE8
    void CCOODLILKJD();
    // public System.Void JHPGGLDGNMG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2058E0C
    void JHPGGLDGNMG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void OMKBAIIIFBJ()
    // Offset: 0x2058EE4
    void OMKBAIIIFBJ();
    // public System.Void .ctor()
    // Offset: 0x2059108
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CorruptedNatureGiant* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::CorruptedNatureGiant::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CorruptedNatureGiant*, creationType>()));
    }
    // public System.Void PKINMLEHJFB()
    // Offset: 0x2059160
    void PKINMLEHJFB();
    // public System.Void BFEOMBNEICE()
    // Offset: 0x2059384
    void BFEOMBNEICE();
    // private System.Void BBMOOPGEBIA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x20595A4
    void BBMOOPGEBIA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void CIGIPMPLKGF()
    // Offset: 0x20595D4
    void CIGIPMPLKGF();
    // private System.Void NMLIFNGCGLJ(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x20597F8
    void NMLIFNGCGLJ(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void HKINNMLBMMG()
    // Offset: 0x2059828
    void HKINNMLBMMG();
    // public System.Void LCKDPMJKHEN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2059880
    void LCKDPMJKHEN(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void OMPJCNEMJHG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2059958
    void OMPJCNEMJHG(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GDDMNDHBECL(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2059988
    void GDDMNDHBECL(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x20599B8
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DKJFPDMDIAA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2059A90
    void DKJFPDMDIAA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void FNAJKCKMHHJ()
    // Offset: 0x2059AC0
    void FNAJKCKMHHJ();
    // public System.Void OMFMIKPMPEL()
    // Offset: 0x2059CE4
    void OMFMIKPMPEL();
    // private System.Void KPOAAAHLGLA()
    // Offset: 0x2059F08
    void KPOAAAHLGLA();
    // public System.Void ALKHPPEDLNC()
    // Offset: 0x2059F60
    void ALKHPPEDLNC();
    // public System.Void JOCIAJOCGNM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x205A184
    void JOCIAJOCGNM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FNGLOIECKDG()
    // Offset: 0x205A25C
    void FNGLOIECKDG();
    // private System.Void OACMGPBCPEL()
    // Offset: 0x205A2B4
    void OACMGPBCPEL();
    // public System.Void Slash()
    // Offset: 0x205A30C
    void Slash();
  }; // MagicalActual.CorruptedNatureGiant
  #pragma pack(pop)
  static check_size<sizeof(CorruptedNatureGiant), 56 + sizeof(::MagicalActual::NetEntity*)> __MagicalActual_CorruptedNatureGiantSizeCheck;
  static_assert(sizeof(CorruptedNatureGiant) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::CorruptedNatureGiant::JJEJNGMIMOI
// Il2CppName: JJEJNGMIMOI
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::CorruptedNatureGiant::*)(::MagicalActual::NetEntity*)>(&MagicalActual::CorruptedNatureGiant::JJEJNGMIMOI)> {
  static const MethodInfo* get() {
    static auto* CMLIHJCOINC = &::il2cpp_utils::GetClassFromName("MagicalActual", "NetEntity")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::CorruptedNatureGiant*), "JJEJNGMIMOI", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CMLIHJCOINC});
  }
};
// Writing MetadataGetter for method: MagicalActual::CorruptedNatureGiant::HMKJKOKPOBP
// Il2CppName: HMKJKOKPOBP
template<>
