// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Craftable_FollowPlayer
  class Craftable_FollowPlayer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Craftable_FollowPlayer);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Craftable_FollowPlayer*, "MagicalActual", "Craftable_FollowPlayer");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x4C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Craftable_FollowPlayer
  // [TokenAttribute] Offset: FFFFFFFF
  class Craftable_FollowPlayer : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.GameObject owner
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* owner;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Single speed
    // Size: 0x4
    // Offset: 0x20
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single rotSpeed
    // Size: 0x4
    // Offset: 0x24
    float rotSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.PlayerCharacter IBODBJEJGEK
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::PlayerCharacter* IBODBJEJGEK;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private System.Single MNFHKKEOLEC
    // Size: 0x4
    // Offset: 0x30
    float MNFHKKEOLEC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single moveDelay
    // Size: 0x4
    // Offset: 0x34
    float moveDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CLOBFOEGGBE
    // Size: 0x4
    // Offset: 0x38
    float CLOBFOEGGBE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CJHLAKEHELI
    // Size: 0x4
    // Offset: 0x3C
    float CJHLAKEHELI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 JALCGOGCIHD
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 JALCGOGCIHD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject owner
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_owner();
    // Get instance field reference: public System.Single speed
    [[deprecated("Use field access instead!")]] float& dyn_speed();
    // Get instance field reference: public System.Single rotSpeed
    [[deprecated("Use field access instead!")]] float& dyn_rotSpeed();
    // Get instance field reference: private MagicalActual.PlayerCharacter IBODBJEJGEK
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerCharacter*& dyn_IBODBJEJGEK();
    // Get instance field reference: private System.Single MNFHKKEOLEC
