// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
  // Forward declaring type: SKManager
  class SKManager;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CreationGrabPoint
  class CreationGrabPoint;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CreationGrabPoint);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CreationGrabPoint*, "MagicalActual", "CreationGrabPoint");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x72
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CreationGrabPoint
  // [TokenAttribute] Offset: FFFFFFFF
  class CreationGrabPoint : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private PhysicsInteractable NENLBJKDCFP
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::PhysicsInteractable* NENLBJKDCFP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.Vector3 FKKFPPDHEBJ
    // Size: 0xC
    // Offset: 0x28
    ::UnityEngine::Vector3 FKKFPPDHEBJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion BAHHCAAFOIP
    // Size: 0x10
    // Offset: 0x34
    ::UnityEngine::Quaternion BAHHCAAFOIP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: BAHHCAAFOIP and: JNBOAIGLFGP
    char __padding3[0x4] = {};
    // private UnityEngine.Transform JNBOAIGLFGP
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* JNBOAIGLFGP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private SKManager DLJKDNIJGDD
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::SKManager* DLJKDNIJGDD;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SKManager*) == 0x8);
    // private UnityEngine.Vector3 GFKCJOCPBND
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 GFKCJOCPBND;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean DLCHEMODKHH
    // Size: 0x1
    // Offset: 0x64
    bool DLCHEMODKHH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DLCHEMODKHH and: propertyToModify
    char __padding7[0x3] = {};
    // public System.String propertyToModify
    // Size: 0x8
    // Offset: 0x68
    ::StringW propertyToModify;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean reverseDirection
    // Size: 0x1
    // Offset: 0x70
    bool reverseDirection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean pullTowardsPlayer
    // Size: 0x1
    // Offset: 0x71
    bool pullTowardsPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Rigidbody EIPMBKLODIJ
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_EIPMBKLODIJ();
    // Get instance field reference: private PhysicsInteractable NENLBJKDCFP
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PhysicsInteractable*& dyn_NENLBJKDCFP();
    // Get instance field reference: private UnityEngine.Vector3 FKKFPPDHEBJ
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_FKKFPPDHEBJ();
    // Get instance field reference: private UnityEngine.Quaternion BAHHCAAFOIP
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_BAHHCAAFOIP();
