// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: CrossbowInteractable
  class CrossbowInteractable;
  // Forward declaring type: CrossbowBolt
  class CrossbowBolt;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Animation
  class Animation;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Crossbow
  class Crossbow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Crossbow);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Crossbow*, "MagicalActual", "Crossbow");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Crossbow
  // [TokenAttribute] Offset: FFFFFFFF
  class Crossbow : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::Crossbow::$$c
    class $$c;
    // Nested type: ::MagicalActual::Crossbow::$$c__DisplayClass20_0
    class $$c__DisplayClass20_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.CrossbowInteractable crossbow
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::CrossbowInteractable* crossbow;
    // Field size check
    static_assert(sizeof(::MagicalActual::CrossbowInteractable*) == 0x8);
    // private UnityEngine.GameObject boltPrefab
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* boltPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject fakeBolt
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* fakeBolt;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Animation fireAnim
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Animation* fireAnim;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animation*) == 0x8);
    // private UnityEngine.GameObject vfxHit
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* vfxHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Events.UnityEvent BoltNocked
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Events::UnityEvent* BoltNocked;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // private UnityEngine.Events.UnityEvent BoltFired
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Events::UnityEvent* BoltFired;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public System.UInt16 pilotGuid
    // Size: 0x2
    // Offset: 0x60
    uint16_t pilotGuid;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.Boolean BGACBEDBILE
    // Size: 0x1
    // Offset: 0x62
    bool BGACBEDBILE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BGACBEDBILE and: IEKBAFFCMNA
    char __padding10[0x5] = {};
    // private System.Collections.Generic.Dictionary`2<System.Byte,MagicalActual.CrossbowBolt> IEKBAFFCMNA
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::Dictionary_2<uint8_t, ::MagicalActual::CrossbowBolt*>* IEKBAFFCMNA;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint8_t, ::MagicalActual::CrossbowBolt*>*) == 0x8);
    // private UnityEngine.Quaternion CKBLEIAFBCC
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Quaternion CKBLEIAFBCC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: protected MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.CrossbowInteractable crossbow
    [[deprecated("Use field access instead!")]] ::MagicalActual::CrossbowInteractable*& dyn_crossbow();
    // Get instance field reference: private UnityEngine.GameObject boltPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_boltPrefab();
