// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
  // Forward declaring type: Crossbow
  class Crossbow;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CrossbowInteractable
  class CrossbowInteractable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CrossbowInteractable);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CrossbowInteractable*, "MagicalActual", "CrossbowInteractable");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x94
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CrossbowInteractable
  // [TokenAttribute] Offset: FFFFFFFF
  class CrossbowInteractable : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::CrossbowInteractable::$doInterpolateRotation$d__18
    class $doInterpolateRotation$d__18;
    public:
    // private MagicalActual.Grabber EKKGJEIEONH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Grabber* EKKGJEIEONH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private MagicalActual.Grabber GJMKPJLCACC
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::Grabber* GJMKPJLCACC;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private MagicalActual.Crossbow crossbowController
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::Crossbow* crossbowController;
    // Field size check
    static_assert(sizeof(::MagicalActual::Crossbow*) == 0x8);
    // public UnityEngine.Transform crossbowTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* crossbowTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform pivot
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* pivot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform leftHandGrab
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* leftHandGrab;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform rightHandGrab
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* rightHandGrab;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single grabOffset
    // Size: 0x4
    // Offset: 0x50
    float grabOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: grabOffset and: GLKKNJLMIJI
    char __padding7[0x4] = {};
    // private UnityEngine.Coroutine GLKKNJLMIJI
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Coroutine* GLKKNJLMIJI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private ClickedEventHandler MOHACFAMFIF
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::ClickedEventHandler* MOHACFAMFIF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // public System.Boolean isLocalControlled
    // Size: 0x1
    // Offset: 0x68
    bool isLocalControlled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLocalControlled and: EFPGCEKDMJA
    char __padding10[0x3] = {};
    // private System.Single EFPGCEKDMJA
    // Size: 0x4
    // Offset: 0x6C
    float EFPGCEKDMJA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MLJONPGDIPL
    // Size: 0x4
    // Offset: 0x70
    float MLJONPGDIPL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion JNKPNBBNGHC
    // Size: 0x10
    // Offset: 0x74
    ::UnityEngine::Quaternion JNKPNBBNGHC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion CKBLEIAFBCC
    // Size: 0x10
    // Offset: 0x84
    ::UnityEngine::Quaternion CKBLEIAFBCC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Grabber EKKGJEIEONH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Grabber*& dyn_EKKGJEIEONH();
    // Get instance field reference: private MagicalActual.Grabber GJMKPJLCACC
    [[deprecated("Use field access instead!")]] ::MagicalActual::Grabber*& dyn_GJMKPJLCACC();
    // Get instance field reference: private MagicalActual.Crossbow crossbowController
    [[deprecated("Use field access instead!")]] ::MagicalActual::Crossbow*& dyn_crossbowController();
    // Get instance field reference: public UnityEngine.Transform crossbowTransform
