// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: OrbusAudioParticleController
  class OrbusAudioParticleController;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: CTGiant
  class CTGiant;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::CTGiant);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::CTGiant*, "MagicalActual", "CTGiant");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.CTGiant
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD31C4
  class CTGiant : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.OrbusAudioParticleController worldBossEffect
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::OrbusAudioParticleController* worldBossEffect;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusAudioParticleController*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.OrbusAudioParticleController worldBossEffect
    [[deprecated("Use field access instead!")]] ::MagicalActual::OrbusAudioParticleController*& dyn_worldBossEffect();
    // private System.Void ABIHCGOKNCL()
    // Offset: 0x1A5584C
    void ABIHCGOKNCL();
    // public System.Void .ctor()
    // Offset: 0x1A558A4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CTGiant* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::CTGiant::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CTGiant*, creationType>()));
    }
    // private System.Void JLMEEMCEEDO(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A558FC
    void JLMEEMCEEDO(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void AFIACGLCIPB()
    // Offset: 0x1A5592C
    void AFIACGLCIPB();
    // private System.Void ECHJFHBMMOM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A55984
    void ECHJFHBMMOM(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A559B4
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A55A8C
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JFDEDDEJJPK()
    // Offset: 0x1A55B64
    void JFDEDDEJJPK();
    // public System.Void JEDKGLFGEKK()
    // Offset: 0x1A55D88
    void JEDKGLFGEKK();
    // public System.Void BLBKOOGJNBB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A55FAC
    void BLBKOOGJNBB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A56084
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KPOAAAHLGLA()
    // Offset: 0x1A5615C
    void KPOAAAHLGLA();
    // private System.Void PFABJJGAOMM()
    // Offset: 0x1A561B4
    void PFABJJGAOMM();
    // private System.Void FMEPBEDDFEM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A5620C
    void FMEPBEDDFEM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GEIGDOGOODM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A5623C
    void GEIGDOGOODM(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void DBOKLBMPMJO()
    // Offset: 0x1A5626C
    void DBOKLBMPMJO();
    // public System.Void PHMNKLJAEMC()
    // Offset: 0x1A56490
    void PHMNKLJAEMC();
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A566B4
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void DICPOOMKKKB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A5678C
    void DICPOOMKKKB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GKIOLADOCOK()
    // Offset: 0x1A56864
    void GKIOLADOCOK();
    // public System.Void PLPDCBMCEJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A568BC
    void PLPDCBMCEJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A56994
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x1A56A6C
    void FGIFGGNGKPK();
    // private System.Void DKJFPDMDIAA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A56AC4
    void DKJFPDMDIAA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void DPFCHCEODPP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A56AF4
    void DPFCHCEODPP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x1A56BCC
    void EIIKFEMCNKM();
    // public System.Void OFDMFGNMEOP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A56C24
    void OFDMFGNMEOP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void OGALJHFFLHP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A56CFC
    void OGALJHFFLHP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void GGPGHGHMDJF()
    // Offset: 0x1A56DD4
    void GGPGHGHMDJF();
    // public System.Void PPKPHFHCELO(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A56FF8
    void PPKPHFHCELO(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A570D0
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void MMGEIKLBBOH()
    // Offset: 0x1A571A8
    void MMGEIKLBBOH();
    // private System.Void Start()
    // Offset: 0x1A573CC
    void Start();
    // private System.Void APMNGLNBFNP()
    // Offset: 0x1A57424
    void APMNGLNBFNP();
    // public System.Void Slash()
    // Offset: 0x1A5747C
    void Slash();
    // private System.Void CIJLNGBOFCL(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A57694
    void CIJLNGBOFCL(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void GHHAMAIIFFG()
    // Offset: 0x1A576C4
    void GHHAMAIIFFG();
    // private System.Void KKBEOCKIBGI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1A578E8
    void KKBEOCKIBGI(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x1A57918
    void DGJGAFKDIDK();
    // private System.Void LBIKOKCCILF()
    // Offset: 0x1A57970
    void LBIKOKCCILF();
    // public System.Void BGDHCACNDCK()
    // Offset: 0x1A579C8
    void BGDHCACNDCK();
    // public System.Void IBMKENLAMGB()
    // Offset: 0x1A57BEC
    void IBMKENLAMGB();
    // private System.Void HKINNMLBMMG()
    // Offset: 0x1A57E10
    void HKINNMLBMMG();
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A57E68
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void LCKDPMJKHEN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1A57F40
    void LCKDPMJKHEN(::MagicalActual::NetEntity* CMLIHJCOINC);
  }; // MagicalActual.CTGiant
  #pragma pack(pop)
  static check_size<sizeof(CTGiant), 56 + sizeof(::MagicalActual::OrbusAudioParticleController*)> __MagicalActual_CTGiantSizeCheck;
  static_assert(sizeof(CTGiant) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::CTGiant::ABIHCGOKNCL
// Il2CppName: ABIHCGOKNCL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::CTGiant::*)()>(&MagicalActual::CTGiant::ABIHCGOKNCL)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::CTGiant*), "ABIHCGOKNCL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::CTGiant::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: MagicalActual::CTGiant::JLMEEMCEEDO
// Il2CppName: JLMEEMCEEDO
template<>
