// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DangerWave
  class DangerWave;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DangerWave);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DangerWave*, "MagicalActual", "DangerWave");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x6E
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DangerWave
  // [TokenAttribute] Offset: FFFFFFFF
  class DangerWave : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::DangerWave::$$c
    class $$c;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer myRenderer
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::SkinnedMeshRenderer* myRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer myRenderer2
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::SkinnedMeshRenderer* myRenderer2;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private System.Single startSize
    // Size: 0x4
    // Offset: 0x38
    float startSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single endSize
    // Size: 0x4
    // Offset: 0x3C
    float endSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single startRadius
    // Size: 0x4
    // Offset: 0x40
    float startRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single endRadius
    // Size: 0x4
    // Offset: 0x44
    float endRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single thickness
    // Size: 0x4
    // Offset: 0x48
    float thickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single speed
    // Size: 0x4
    // Offset: 0x4C
    float speed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single expireTime
    // Size: 0x4
    // Offset: 0x50
    float expireTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: expireTime and: particles
    char __padding10[0x4] = {};
    // private UnityEngine.GameObject particles
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* particles;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single LONMIFNBEAA
    // Size: 0x4
    // Offset: 0x60
    float LONMIFNBEAA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PJEOPAJNNOC
    // Size: 0x4
    // Offset: 0x64
    float PJEOPAJNNOC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MDDBKDNPEOK
    // Size: 0x4
    // Offset: 0x68
    float MDDBKDNPEOK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean FECAIDNKEJJ
    // Size: 0x1
    // Offset: 0x6C
    bool FECAIDNKEJJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AEMOLLFOCLI
    // Size: 0x1
    // Offset: 0x6D
    bool AEMOLLFOCLI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.SkinnedMeshRenderer myRenderer
    [[deprecated("Use field access instead!")]] ::UnityEngine::SkinnedMeshRenderer*& dyn_myRenderer();
    // Get instance field reference: private UnityEngine.SkinnedMeshRenderer myRenderer2
    [[deprecated("Use field access instead!")]] ::UnityEngine::SkinnedMeshRenderer*& dyn_myRenderer2();
