// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: VectorLine
  class VectorLine;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DebugBox
  class DebugBox;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DebugBox);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DebugBox*, "MagicalActual", "DebugBox");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x70
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DebugBox
  // [TokenAttribute] Offset: FFFFFFFF
  class DebugBox : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.Vector3 OMBHDEFLBEE
    // Size: 0xC
    // Offset: 0x10
    ::UnityEngine::Vector3 OMBHDEFLBEE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 HJAJPOEGCJK
    // Size: 0xC
    // Offset: 0x1C
    ::UnityEngine::Vector3 HJAJPOEGCJK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single ICMHFDCBDPJ
    // Size: 0x4
    // Offset: 0x28
    float ICMHFDCBDPJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single MKANKHGHGGL
    // Size: 0x4
    // Offset: 0x2C
    float MKANKHGHGGL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Quaternion NOFFCFFNFEK
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Quaternion NOFFCFFNFEK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion NMKNHDJPJIF
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Quaternion NMKNHDJPJIF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 HIJNLFBCAOK
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 HIJNLFBCAOK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.UInt16 BHHGMPLHEDC
    // Size: 0x2
    // Offset: 0x5C
    uint16_t BHHGMPLHEDC;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: BHHGMPLHEDC and: HBPCBGINKIG
    char __padding7[0x2] = {};
    // private Vectrosity.VectorLine HBPCBGINKIG
    // Size: 0x8
    // Offset: 0x60
    ::Vectrosity::VectorLine* HBPCBGINKIG;
    // Field size check
    static_assert(sizeof(::Vectrosity::VectorLine*) == 0x8);
    // private UnityEngine.GameObject FMJCPBNAOEC
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* FMJCPBNAOEC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Get instance field reference: public UnityEngine.Vector3 OMBHDEFLBEE
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_OMBHDEFLBEE();
    // Get instance field reference: public UnityEngine.Vector3 HJAJPOEGCJK
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_HJAJPOEGCJK();
    // Get instance field reference: public System.Single ICMHFDCBDPJ
    [[deprecated("Use field access instead!")]] float& dyn_ICMHFDCBDPJ();
    // Get instance field reference: public System.Single MKANKHGHGGL
    [[deprecated("Use field access instead!")]] float& dyn_MKANKHGHGGL();
    // Get instance field reference: public UnityEngine.Quaternion NOFFCFFNFEK
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_NOFFCFFNFEK();
