// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MagicalActual.DynamicEvent
#include "MagicalActual/DynamicEvent.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DefendGateEvent
  class DefendGateEvent;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DefendGateEvent);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DefendGateEvent*, "MagicalActual", "DefendGateEvent");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DefendGateEvent
  // [TokenAttribute] Offset: FFFFFFFF
  class DefendGateEvent : public ::MagicalActual::DynamicEvent {
    public:
    // Writing base type padding for base size: 0x92 to desired offset: 0x94
    char ___base_padding[0x2] = {};
    public:
    // public System.Int32 NumberOfLanes
    // Size: 0x4
    // Offset: 0x94
    int NumberOfLanes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 waveSpawnInterval
    // Size: 0x4
    // Offset: 0x98
    int waveSpawnInterval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 timeToDefend
    // Size: 0x4
    // Offset: 0x9C
    int timeToDefend;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean singleLaneSpawn
    // Size: 0x1
    // Offset: 0xA0
    bool singleLaneSpawn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: singleLaneSpawn and: idleGates
    char __padding3[0x7] = {};
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> idleGates
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* idleGates;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    public:
    // Get instance field reference: public System.Int32 NumberOfLanes
    [[deprecated("Use field access instead!")]] int& dyn_NumberOfLanes();
    // Get instance field reference: public System.Int32 waveSpawnInterval
    [[deprecated("Use field access instead!")]] int& dyn_waveSpawnInterval();
    // Get instance field reference: public System.Int32 timeToDefend
    [[deprecated("Use field access instead!")]] int& dyn_timeToDefend();
    // Get instance field reference: public System.Boolean singleLaneSpawn
    [[deprecated("Use field access instead!")]] bool& dyn_singleLaneSpawn();
    // Get instance field reference: private System.Collections.Generic.List`1<UnityEngine.GameObject> idleGates
    [[deprecated("Use field access instead!")]] ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*& dyn_idleGates();
    // protected System.Void EABFHBFNLLG(System.String CAGOMPGOIPH)
    // Offset: 0x1331764
    void EABFHBFNLLG(::StringW CAGOMPGOIPH);
    // public System.Void KMPPLBBIMGJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1331B1C
    void KMPPLBBIMGJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void OEMMGAMOIHF()
    // Offset: 0x1331D4C
    void OEMMGAMOIHF();
    // public System.Void LCKDPMJKHEN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x132FE1C
    void LCKDPMJKHEN(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void DBLALCEDHIA(System.String CAGOMPGOIPH)
    // Offset: 0x1332480
    void DBLALCEDHIA(::StringW CAGOMPGOIPH);
    // protected System.Void OJOGMAONFDK()
    // Offset: 0x1332644
    void OJOGMAONFDK();
    // protected System.Void IEGGFMFFCKG()
    // Offset: 0x1332718
    void IEGGFMFFCKG();
    // protected System.Void OKMFFNKFMBP()
    // Offset: 0x1332878
    void OKMFFNKFMBP();
    // protected System.Void EKPMJBDKAOD()
    // Offset: 0x133293C
    void EKPMJBDKAOD();
    // protected System.Void CMIDGMJKFGJ(System.String CAGOMPGOIPH)
    // Offset: 0x1332A8C
    void CMIDGMJKFGJ(::StringW CAGOMPGOIPH);
    // protected System.Void HNJLNMNBLDN(System.String CAGOMPGOIPH)
    // Offset: 0x1332CC8
    void HNJLNMNBLDN(::StringW CAGOMPGOIPH);
    // public System.Void OAMOHIMHKEK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1332F04
    void OAMOHIMHKEK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void DELHNCPLGLA()
    // Offset: 0x1332F08
    void DELHNCPLGLA();
    // protected System.Void CFNHAOHJCHO(System.String CAGOMPGOIPH)
    // Offset: 0x1332FDC
    void CFNHAOHJCHO(::StringW CAGOMPGOIPH);
    // protected System.Void HDKFPHJBDIH()
    // Offset: 0x13331E8
    void HDKFPHJBDIH();
    // protected System.Void HPNALKDLLFK()
    // Offset: 0x133331C
    void HPNALKDLLFK();
    // protected System.Void HHODANFNPGN()
    // Offset: 0x133346C
    void HHODANFNPGN();
    // protected System.Void EJCMKEHBELA()
    // Offset: 0x13334F4
    void EJCMKEHBELA();
    // protected System.Void BLEKNDAFMEF()
    // Offset: 0x1333654
    void BLEKNDAFMEF();
    // protected System.Void BNANAADIKNO()
    // Offset: 0x13337EC
    void BNANAADIKNO();
    // protected System.Void NOIHMIOCMMD()
    // Offset: 0x13338B4
    void NOIHMIOCMMD();
    // protected System.Void ODHKAFKBMJF()
    // Offset: 0x133393C
    void ODHKAFKBMJF();
    // public System.Void KIDNJNOFOFF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1333A10
    void KIDNJNOFOFF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EBJDLAIJJJE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x132F738
    void EBJDLAIJJJE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HMKJKOKPOBP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x132F190
    void HMKJKOKPOBP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void KAAHALCPCBA()
    // Offset: 0x1333A14
    void KAAHALCPCBA();
    // protected System.Void CEKFIKKJAFL()
    // Offset: 0x1333AE8
    void CEKFIKKJAFL();
    // protected System.Void NGEOMFOGODO(System.String CAGOMPGOIPH)
    // Offset: 0x1333BAC
    void NGEOMFOGODO(::StringW CAGOMPGOIPH);
    // protected System.Void FLMLHDAMBEF()
    // Offset: 0x1333CC8
    void FLMLHDAMBEF();
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1333D50
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void AMBHFINDKPK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1333D54
    void AMBHFINDKPK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void OFHKFEPOFCB()
    // Offset: 0x1333DE0
    void OFHKFEPOFCB();
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x132F00C
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected override System.Void PMFPHOLFCFI(System.String CAGOMPGOIPH)
    // Offset: 0x1331EAC
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::PMFPHOLFCFI(System.String CAGOMPGOIPH)
    void PMFPHOLFCFI(::StringW CAGOMPGOIPH);
    // protected override System.Void MPOPJANOOJI(System.String CAGOMPGOIPH)
    // Offset: 0x13331A0
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::MPOPJANOOJI(System.String CAGOMPGOIPH)
    void MPOPJANOOJI(::StringW CAGOMPGOIPH);
    // public System.Void .ctor()
    // Offset: 0x132EBF4
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DefendGateEvent* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::DefendGateEvent::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DefendGateEvent*, creationType>()));
    }
    // public override System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x132F5B4
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected override System.Void EEKJFACLAJO()
    // Offset: 0x1333718
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::EEKJFACLAJO()
    void EEKJFACLAJO();
    // public override System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13338B0
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected override System.Void KFFCCALBHMA()
    // Offset: 0x1333BF4
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::KFFCCALBHMA()
    void KFFCCALBHMA();
    // protected override System.Void AKMECKCJAJF()
    // Offset: 0x1333D58
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::AKMECKCJAJF()
    void AKMECKCJAJF();
  }; // MagicalActual.DefendGateEvent
  #pragma pack(pop)
  static check_size<sizeof(DefendGateEvent), 168 + sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*)> __MagicalActual_DefendGateEventSizeCheck;
  static_assert(sizeof(DefendGateEvent) == 0xB0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::DefendGateEvent::EABFHBFNLLG
// Il2CppName: EABFHBFNLLG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DefendGateEvent::*)(::StringW)>(&MagicalActual::DefendGateEvent::EABFHBFNLLG)> {
  static const MethodInfo* get() {
    static auto* CAGOMPGOIPH = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DefendGateEvent*), "EABFHBFNLLG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CAGOMPGOIPH});
  }
};
// Writing MetadataGetter for method: MagicalActual::DefendGateEvent::KMPPLBBIMGJ
// Il2CppName: KMPPLBBIMGJ
template<>
