// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Button
  class Button;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DialogueBox
  class DialogueBox;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DialogueBox);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DialogueBox*, "MagicalActual", "DialogueBox");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DialogueBox
  // [TokenAttribute] Offset: FFFFFFFF
  class DialogueBox : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.Canvas myCanvas
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Canvas* myCanvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // public SuperTextMesh speechText
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::SuperTextMesh* speechText;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.GameObject choicePanelOne
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* choicePanelOne;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject choicePanelTwo
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* choicePanelTwo;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject choicePanelThree
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* choicePanelThree;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject choicePanelFour
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* choicePanelFour;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.UI.Text choicePanelOneText
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UI::Text* choicePanelOneText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public SuperTextMesh choicePanelOneStm
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::SuperTextMesh* choicePanelOneStm;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.UI.Button choicePanelOneButton
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::UI::Button* choicePanelOneButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Text choicePanelTwoText
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::UI::Text* choicePanelTwoText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public SuperTextMesh choicePanelTwoStm
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::SuperTextMesh* choicePanelTwoStm;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.UI.Button choicePanelTwoButton
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::UI::Button* choicePanelTwoButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Text choicePanelThreeText
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UI::Text* choicePanelThreeText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public SuperTextMesh choicePanelThreeStm
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::SuperTextMesh* choicePanelThreeStm;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.UI.Button choicePanelThreeButton
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UI::Button* choicePanelThreeButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // public UnityEngine.UI.Text choicePanelFourText
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Text* choicePanelFourText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public SuperTextMesh choicePanelFourStm
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::SuperTextMesh* choicePanelFourStm;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.UI.Button choicePanelFourButton
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UI::Button* choicePanelFourButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Canvas myCanvas
    [[deprecated("Use field access instead!")]] ::UnityEngine::Canvas*& dyn_myCanvas();
    // Get instance field reference: public SuperTextMesh speechText
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_speechText();
    // Get instance field reference: public UnityEngine.GameObject choicePanelOne
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_choicePanelOne();
    // Get instance field reference: public UnityEngine.GameObject choicePanelTwo
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_choicePanelTwo();
    // Get instance field reference: public UnityEngine.GameObject choicePanelThree
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_choicePanelThree();
    // Get instance field reference: public UnityEngine.GameObject choicePanelFour
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_choicePanelFour();
    // Get instance field reference: public UnityEngine.UI.Text choicePanelOneText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_choicePanelOneText();
    // Get instance field reference: public SuperTextMesh choicePanelOneStm
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_choicePanelOneStm();
    // Get instance field reference: public UnityEngine.UI.Button choicePanelOneButton
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Button*& dyn_choicePanelOneButton();
    // Get instance field reference: public UnityEngine.UI.Text choicePanelTwoText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_choicePanelTwoText();
    // Get instance field reference: public SuperTextMesh choicePanelTwoStm
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_choicePanelTwoStm();
    // Get instance field reference: public UnityEngine.UI.Button choicePanelTwoButton
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Button*& dyn_choicePanelTwoButton();
    // Get instance field reference: public UnityEngine.UI.Text choicePanelThreeText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_choicePanelThreeText();
    // Get instance field reference: public SuperTextMesh choicePanelThreeStm
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_choicePanelThreeStm();
    // Get instance field reference: public UnityEngine.UI.Button choicePanelThreeButton
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Button*& dyn_choicePanelThreeButton();
    // Get instance field reference: public UnityEngine.UI.Text choicePanelFourText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_choicePanelFourText();
    // Get instance field reference: public SuperTextMesh choicePanelFourStm
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_choicePanelFourStm();
    // Get instance field reference: public UnityEngine.UI.Button choicePanelFourButton
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Button*& dyn_choicePanelFourButton();
    // private System.Void NHADFEMILCC()
    // Offset: 0x1338B94
    void NHADFEMILCC();
    // private System.Void NEDFCIDMJBB()
    // Offset: 0x1338B98
    void NEDFCIDMJBB();
    // private System.Void LBIKOKCCILF()
    // Offset: 0x1338B9C
    void LBIKOKCCILF();
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x1338BA0
    void FGIFGGNGKPK();
    // private System.Void BDEDGNGMHMN()
    // Offset: 0x1338BA4
    void BDEDGNGMHMN();
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x1338BA8
    void LPLGKBGLPOK();
    // private System.Void NNDKJCJFIAK()
    // Offset: 0x1338BAC
    void NNDKJCJFIAK();
    // private System.Void IPIFMKAGODD()
    // Offset: 0x1338BB0
    void IPIFMKAGODD();
    // private System.Void ABIHCGOKNCL()
    // Offset: 0x1338BB4
    void ABIHCGOKNCL();
    // private System.Void AFIACGLCIPB()
    // Offset: 0x1338BB8
    void AFIACGLCIPB();
    // private System.Void GPFBGGFPINB()
    // Offset: 0x1338BBC
    void GPFBGGFPINB();
    // private System.Void GHLPBOJJHNG()
    // Offset: 0x1338BC0
    void GHLPBOJJHNG();
    // private System.Void JENOIOBAEPG()
    // Offset: 0x1338BC4
    void JENOIOBAEPG();
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x1338BC8
    void MLGBKBMHHLE();
    // private System.Void AKGFEENGKJD()
    // Offset: 0x1338BCC
    void AKGFEENGKJD();
    // private System.Void FNGLOIECKDG()
    // Offset: 0x1338BD0
    void FNGLOIECKDG();
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x1338BD4
    void EIIKFEMCNKM();
    // public System.Void .ctor()
    // Offset: 0x1338BD8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DialogueBox* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::DialogueBox::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DialogueBox*, creationType>()));
    }
    // private System.Void HKINNMLBMMG()
    // Offset: 0x1338BE0
    void HKINNMLBMMG();
    // private System.Void OACMGPBCPEL()
    // Offset: 0x1338BE4
    void OACMGPBCPEL();
    // private System.Void JNHNEBOHOIB()
    // Offset: 0x1338BE8
    void JNHNEBOHOIB();
    // private System.Void CBMDGNKFPIO()
    // Offset: 0x1338BEC
    void CBMDGNKFPIO();
    // private System.Void GKIOLADOCOK()
    // Offset: 0x1338BF0
    void GKIOLADOCOK();
    // private System.Void GECHLDPLPCC()
    // Offset: 0x1338BF4
    void GECHLDPLPCC();
    // private System.Void IDOCJGNLNFL()
    // Offset: 0x1338BF8
    void IDOCJGNLNFL();
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x1338BFC
    void DGJGAFKDIDK();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x1338C00
    void KBDGAPMJGLG();
    // private System.Void Start()
    // Offset: 0x1338C04
    void Start();
    // private System.Void PBEMGGBBDCK()
    // Offset: 0x1338C08
    void PBEMGGBBDCK();
    // private System.Void PFABJJGAOMM()
    // Offset: 0x1338C0C
    void PFABJJGAOMM();
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x1338C10
    void EPCHNEGNKNF();
    // private System.Void KPOAAAHLGLA()
    // Offset: 0x1338C14
    void KPOAAAHLGLA();
  }; // MagicalActual.DialogueBox
  #pragma pack(pop)
  static check_size<sizeof(DialogueBox), 160 + sizeof(::UnityEngine::UI::Button*)> __MagicalActual_DialogueBoxSizeCheck;
  static_assert(sizeof(DialogueBox) == 0xA8);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::DialogueBox::NHADFEMILCC
// Il2CppName: NHADFEMILCC
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::NHADFEMILCC)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "NHADFEMILCC", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::NEDFCIDMJBB
// Il2CppName: NEDFCIDMJBB
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::NEDFCIDMJBB)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "NEDFCIDMJBB", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::LBIKOKCCILF
// Il2CppName: LBIKOKCCILF
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::LBIKOKCCILF)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "LBIKOKCCILF", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::FGIFGGNGKPK
// Il2CppName: FGIFGGNGKPK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::FGIFGGNGKPK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "FGIFGGNGKPK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::BDEDGNGMHMN
// Il2CppName: BDEDGNGMHMN
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::BDEDGNGMHMN)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "BDEDGNGMHMN", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::LPLGKBGLPOK
// Il2CppName: LPLGKBGLPOK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::LPLGKBGLPOK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "LPLGKBGLPOK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::NNDKJCJFIAK
// Il2CppName: NNDKJCJFIAK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::NNDKJCJFIAK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "NNDKJCJFIAK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::IPIFMKAGODD
// Il2CppName: IPIFMKAGODD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::IPIFMKAGODD)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "IPIFMKAGODD", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::ABIHCGOKNCL
// Il2CppName: ABIHCGOKNCL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::ABIHCGOKNCL)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "ABIHCGOKNCL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::AFIACGLCIPB
// Il2CppName: AFIACGLCIPB
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::AFIACGLCIPB)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "AFIACGLCIPB", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::GPFBGGFPINB
// Il2CppName: GPFBGGFPINB
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::GPFBGGFPINB)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "GPFBGGFPINB", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::GHLPBOJJHNG
// Il2CppName: GHLPBOJJHNG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::GHLPBOJJHNG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "GHLPBOJJHNG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::JENOIOBAEPG
// Il2CppName: JENOIOBAEPG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::JENOIOBAEPG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "JENOIOBAEPG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::MLGBKBMHHLE
// Il2CppName: MLGBKBMHHLE
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::MLGBKBMHHLE)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "MLGBKBMHHLE", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::AKGFEENGKJD
// Il2CppName: AKGFEENGKJD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::AKGFEENGKJD)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "AKGFEENGKJD", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::FNGLOIECKDG
// Il2CppName: FNGLOIECKDG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::FNGLOIECKDG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "FNGLOIECKDG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::EIIKFEMCNKM
// Il2CppName: EIIKFEMCNKM
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::EIIKFEMCNKM)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "EIIKFEMCNKM", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: MagicalActual::DialogueBox::HKINNMLBMMG
// Il2CppName: HKINNMLBMMG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::HKINNMLBMMG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "HKINNMLBMMG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::OACMGPBCPEL
// Il2CppName: OACMGPBCPEL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::OACMGPBCPEL)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "OACMGPBCPEL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::JNHNEBOHOIB
// Il2CppName: JNHNEBOHOIB
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::JNHNEBOHOIB)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "JNHNEBOHOIB", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::CBMDGNKFPIO
// Il2CppName: CBMDGNKFPIO
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::CBMDGNKFPIO)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "CBMDGNKFPIO", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::GKIOLADOCOK
// Il2CppName: GKIOLADOCOK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::GKIOLADOCOK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "GKIOLADOCOK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::GECHLDPLPCC
// Il2CppName: GECHLDPLPCC
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::GECHLDPLPCC)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "GECHLDPLPCC", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::IDOCJGNLNFL
// Il2CppName: IDOCJGNLNFL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::IDOCJGNLNFL)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "IDOCJGNLNFL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::DGJGAFKDIDK
// Il2CppName: DGJGAFKDIDK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::DGJGAFKDIDK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "DGJGAFKDIDK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::KBDGAPMJGLG
// Il2CppName: KBDGAPMJGLG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::KBDGAPMJGLG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "KBDGAPMJGLG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::PBEMGGBBDCK
// Il2CppName: PBEMGGBBDCK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::PBEMGGBBDCK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "PBEMGGBBDCK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::PFABJJGAOMM
// Il2CppName: PFABJJGAOMM
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::PFABJJGAOMM)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "PFABJJGAOMM", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::EPCHNEGNKNF
// Il2CppName: EPCHNEGNKNF
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::EPCHNEGNKNF)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "EPCHNEGNKNF", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DialogueBox::KPOAAAHLGLA
// Il2CppName: KPOAAAHLGLA
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DialogueBox::*)()>(&MagicalActual::DialogueBox::KPOAAAHLGLA)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DialogueBox*), "KPOAAAHLGLA", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
