// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerPet
  class PlayerPet;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DragonPilot
  class DragonPilot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DragonPilot);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DragonPilot*, "MagicalActual", "DragonPilot");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x23C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DragonPilot
  // [TokenAttribute] Offset: FFFFFFFF
  class DragonPilot : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::DragonPilot::$$c
    class $$c;
    // Nested type: ::MagicalActual::DragonPilot::$DoLoseAnimation$d__65
    class $DoLoseAnimation$d__65;
    // Nested type: ::MagicalActual::DragonPilot::$DoCountDown$d__66
    class $DoCountDown$d__66;
    public:
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x28
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: IJJGNKLFGJN
    char __padding2[0x7] = {};
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.GameObject targetPositionPrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* targetPositionPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject raceTimerPrefab
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* raceTimerPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.UInt16 FNOCLFOKDFG
    // Size: 0x2
    // Offset: 0x48
    uint16_t FNOCLFOKDFG;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: FNOCLFOKDFG and: HOKKHECIAAM
    char __padding6[0x2] = {};
    // private UnityEngine.Vector3 HOKKHECIAAM
    // Size: 0xC
    // Offset: 0x4C
    ::UnityEngine::Vector3 HOKKHECIAAM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion EEMOFBPKBBA
    // Size: 0x10
    // Offset: 0x58
    ::UnityEngine::Quaternion EEMOFBPKBBA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Boolean JLALEBBMHGP
    // Size: 0x1
    // Offset: 0x68
    bool JLALEBBMHGP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JLALEBBMHGP and: LIGIFCLLNHC
    char __padding9[0x7] = {};
    // private MagicalActual.PlayerPet LIGIFCLLNHC
    // Size: 0x8
    // Offset: 0x70
    ::MagicalActual::PlayerPet* LIGIFCLLNHC;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerPet*) == 0x8);
    // private UnityEngine.GameObject JBAPNLCMIHG
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* JBAPNLCMIHG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject KCBLHEDGPMF
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* KCBLHEDGPMF;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private SuperTextMesh CBJFDNGEDJB
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::SuperTextMesh* CBJFDNGEDJB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private UnityEngine.UI.Image ANGOGEINJAM
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Image* ANGOGEINJAM;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Boolean FCJEBJONIFI
    // Size: 0x1
    // Offset: 0x98
    bool FCJEBJONIFI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean NEHNPLCFCCO
    // Size: 0x1
    // Offset: 0x99
    bool NEHNPLCFCCO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NEHNPLCFCCO and: EPPIPLHANGD
    char __padding16[0x6] = {};
    // private UnityEngine.RaycastHit[] EPPIPLHANGD
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::UnityEngine::RaycastHit> EPPIPLHANGD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Collider[] GJMNJANLAGG
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::UnityEngine::Collider*> GJMNJANLAGG;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0xB0
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single LOLLNPPPPIF
    // Size: 0x4
    // Offset: 0xB8
    float LOLLNPPPPIF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: LOLLNPPPPIF and: LNFLDMGHLCK
    char __padding20[0x4] = {};
    // private OrbusTrackedController LNFLDMGHLCK
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::OrbusTrackedController* LNFLDMGHLCK;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private OrbusTrackedController EAKICLLKLCF
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::OrbusTrackedController* EAKICLLKLCF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private ClickedEventHandler ABABKJEGKMN
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::ClickedEventHandler* ABABKJEGKMN;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler KNGDDDNBLGO
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::ClickedEventHandler* KNGDDDNBLGO;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private System.Object GPDKPJPEGDF
    // Size: 0x8
    // Offset: 0xE0
    ::Il2CppObject* GPDKPJPEGDF;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Single FIEFLFPKHIH
    // Size: 0x4
    // Offset: 0xE8
    float FIEFLFPKHIH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 BNGPIAPKBLN
    // Size: 0xC
    // Offset: 0xEC
    ::UnityEngine::Vector3 BNGPIAPKBLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion GAFPPEHJOEN
    // Size: 0x10
    // Offset: 0xF8
    ::UnityEngine::Quaternion GAFPPEHJOEN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 CJMMBFKFGKP
    // Size: 0xC
    // Offset: 0x108
    ::UnityEngine::Vector3 CJMMBFKFGKP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion IJLHLANBMNP
    // Size: 0x10
    // Offset: 0x114
    ::UnityEngine::Quaternion IJLHLANBMNP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single NAICCNPLODB
    // Size: 0x4
    // Offset: 0x124
    float NAICCNPLODB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single LKFMHJEMBAD
    // Size: 0x4
    // Offset: 0x128
    float LKFMHJEMBAD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JIEEDGGLNPF
    // Size: 0x4
    // Offset: 0x12C
    float JIEEDGGLNPF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HFFHOFHFDJC
    // Size: 0x4
    // Offset: 0x130
    float HFFHOFHFDJC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean MLJNJDFDJLO
    // Size: 0x1
    // Offset: 0x134
    bool MLJNJDFDJLO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MLJNJDFDJLO and: CNJCJKFNCEF
    char __padding35[0x3] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt CNJCJKFNCEF
    // Size: 0x19
    // Offset: 0x138
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt CNJCJKFNCEF;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: CNJCJKFNCEF and: EPMALIPDHFI
    char __padding36[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt EPMALIPDHFI
    // Size: 0x19
    // Offset: 0x158
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt EPMALIPDHFI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: EPMALIPDHFI and: JMEFIOKGBCN
    char __padding37[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt JMEFIOKGBCN
    // Size: 0x19
    // Offset: 0x178
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt JMEFIOKGBCN;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: JMEFIOKGBCN and: NOECBELMCDD
    char __padding38[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt NOECBELMCDD
    // Size: 0x19
    // Offset: 0x198
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt NOECBELMCDD;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: NOECBELMCDD and: OHPNLJFLPKB
    char __padding39[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt OHPNLJFLPKB
    // Size: 0x19
    // Offset: 0x1B8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt OHPNLJFLPKB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: OHPNLJFLPKB and: JDFNALELBDG
    char __padding40[0x7] = {};
    // private System.Single JDFNALELBDG
    // Size: 0x4
    // Offset: 0x1D8
    float JDFNALELBDG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: JDFNALELBDG and: GMPJAEPKLKG
    char __padding41[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt GMPJAEPKLKG
    // Size: 0x19
    // Offset: 0x1E0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt GMPJAEPKLKG;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: GMPJAEPKLKG and: EODEKFABMIA
    char __padding42[0x7] = {};
    // private System.String EODEKFABMIA
    // Size: 0x8
    // Offset: 0x200
    ::StringW EODEKFABMIA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject vfxLoopPickup
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::GameObject* vfxLoopPickup;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxWhirlwindPickup
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::GameObject* vfxWhirlwindPickup;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxFinish
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::GameObject* vfxFinish;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean MINKOPDEIAB
    // Size: 0x1
    // Offset: 0x220
    bool MINKOPDEIAB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean EHJOPINNGII
    // Size: 0x1
    // Offset: 0x221
    bool EHJOPINNGII;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean EICNJCGBFIC
    // Size: 0x1
    // Offset: 0x222
    bool EICNJCGBFIC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EICNJCGBFIC and: FHICMMCONAE
    char __padding49[0x5] = {};
    // private UnityEngine.Coroutine FHICMMCONAE
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::Coroutine* FHICMMCONAE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Vector3 MIHLINCIBGF
    // Size: 0xC
    // Offset: 0x230
    ::UnityEngine::Vector3 MIHLINCIBGF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.PlayerCharacter HCFELEODBLD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerCharacter*& dyn_HCFELEODBLD();
    // Get instance field reference: private MagicalActual.PlayerAvatar EENJNFDNJBD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerAvatar*& dyn_EENJNFDNJBD();
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
