// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DungeonShard
  class DungeonShard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DungeonShard);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DungeonShard*, "MagicalActual", "DungeonShard");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DungeonShard
  // [TokenAttribute] Offset: FFFFFFFF
  class DungeonShard : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.PlayerTool FKJHGIFOJKD
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerTool* FKJHGIFOJKD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    // private System.Boolean IMAFJMEOHIF
    // Size: 0x1
    // Offset: 0x20
    bool IMAFJMEOHIF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IMAFJMEOHIF and: MGIJGHBFFOO
    char __padding1[0x7] = {};
    // private UnityEngine.Transform MGIJGHBFFOO
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* MGIJGHBFFOO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.String ACNINLKMMKB
    // Size: 0x8
    // Offset: 0x38
    ::StringW ACNINLKMMKB;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject activateVfx
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* activateVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.PlayerTool FKJHGIFOJKD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerTool*& dyn_FKJHGIFOJKD();
    // Get instance field reference: private System.Boolean IMAFJMEOHIF
    [[deprecated("Use field access instead!")]] bool& dyn_IMAFJMEOHIF();
    // Get instance field reference: private UnityEngine.Transform MGIJGHBFFOO
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_MGIJGHBFFOO();
    // Get instance field reference: private UnityEngine.Collider[] JGOGJDHABHN
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Collider*>& dyn_JGOGJDHABHN();
    // Get instance field reference: private System.String ACNINLKMMKB
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ACNINLKMMKB();
    // Get instance field reference: public UnityEngine.GameObject activateVfx
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_activateVfx();
    // private System.Void OAEPHGIOHAO()
    // Offset: 0x134A4BC
    void OAEPHGIOHAO();
    // private System.Void AKGFEENGKJD()
    // Offset: 0x134A544
    void AKGFEENGKJD();
    // private System.Void IEDBMOOGDKM(System.Byte KLIPNGBEELK)
    // Offset: 0x134A718
    void IEDBMOOGDKM(uint8_t KLIPNGBEELK);
    // private System.Void PBEMGGBBDCK()
    // Offset: 0x134A8A4
    void PBEMGGBBDCK();
    // private System.Void CNBJHFMDCOE()
    // Offset: 0x134AA78
    void CNBJHFMDCOE();
    // private System.Void FixedUpdate()
    // Offset: 0x134AAD0
    void FixedUpdate();
    // private System.Void CDFDPCDCGAK()
    // Offset: 0x134AD5C
    void CDFDPCDCGAK();
    // private System.Void JCGIGLJIGOM()
    // Offset: 0x134ADE4
    void JCGIGLJIGOM();
    // private System.Void BMALDPKJJPG()
    // Offset: 0x134AE6C
    void BMALDPKJJPG();
    // private System.Void IEJMKFPGDOB(System.Byte KLIPNGBEELK)
    // Offset: 0x134AEC4
    void IEJMKFPGDOB(uint8_t KLIPNGBEELK);
    // private System.Void CAPGFLFKCLN(System.Byte KLIPNGBEELK)
    // Offset: 0x134B050
    void CAPGFLFKCLN(uint8_t KLIPNGBEELK);
    // private System.Void FMCCEHMILOP()
    // Offset: 0x134B1DC
    void FMCCEHMILOP();
    // private System.Void FNHKAIGMMLG()
    // Offset: 0x134B264
    void FNHKAIGMMLG();
    // private System.Void LACFBAIDCBK()
    // Offset: 0x134B2BC
    void LACFBAIDCBK();
    // private System.Void FLGPKPALCIO(System.Byte KLIPNGBEELK)
    // Offset: 0x134B314
    void FLGPKPALCIO(uint8_t KLIPNGBEELK);
    // private System.Void JBMANAJHKBI(System.Byte KLIPNGBEELK)
    // Offset: 0x134B4A0
    void JBMANAJHKBI(uint8_t KLIPNGBEELK);
    // private System.Void AFALAKLIBEB()
    // Offset: 0x134ACD4
    void AFALAKLIBEB();
    // private System.Void IPIFMKAGODD()
    // Offset: 0x134B62C
    void IPIFMKAGODD();
    // private System.Void Awake()
    // Offset: 0x134B800
    void Awake();
    // private System.Void JEDINCAJKLC()
    // Offset: 0x134B858
    void JEDINCAJKLC();
    // private System.Void BHBFEEJHKIH()
    // Offset: 0x134BA4C
    void BHBFEEJHKIH();
    // private System.Void OJFAEAIKFED()
    // Offset: 0x134BC44
    void OJFAEAIKFED();
    // private System.Void FBONHOOJHBG()
    // Offset: 0x134BE18
    void FBONHOOJHBG();
    // private System.Void LLBAENEGEMN()
    // Offset: 0x134BFEC
    void LLBAENEGEMN();
    // public System.Void .ctor()
    // Offset: 0x134C1F8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static DungeonShard* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::DungeonShard::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<DungeonShard*, creationType>()));
    }
    // private System.Void KILJDKHADHJ()
    // Offset: 0x134C250
    void KILJDKHADHJ();
    // private System.Void HMLPEKMDCDI(System.Byte KLIPNGBEELK)
    // Offset: 0x134C2A8
    void HMLPEKMDCDI(uint8_t KLIPNGBEELK);
    // private System.Void KKEABMBACIC()
    // Offset: 0x134C434
    void KKEABMBACIC();
    // private System.Void PFABJJGAOMM()
    // Offset: 0x134C48C
    void PFABJJGAOMM();
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x134C660
    void DGJGAFKDIDK();
    // private System.Void AMIPIMKIJMO()
    // Offset: 0x134C834
    void AMIPIMKIJMO();
    // private System.Void MELPNKHDJFN()
    // Offset: 0x134CA28
    void MELPNKHDJFN();
    // private System.Void OOKAOJFGODO()
    // Offset: 0x134CA80
    void OOKAOJFGODO();
    // private System.Void JFJCCNIMOPO()
    // Offset: 0x134CB08
    void JFJCCNIMOPO();
    // private System.Void MDGLGNKOPLD()
    // Offset: 0x134CB90
    void MDGLGNKOPLD();
    // private System.Void CAHEKCFLDHP()
    // Offset: 0x134CC18
    void CAHEKCFLDHP();
    // private System.Void HADIPALABDL(System.Byte KLIPNGBEELK)
    // Offset: 0x134CE10
    void HADIPALABDL(uint8_t KLIPNGBEELK);
    // private System.Void Start()
    // Offset: 0x134CF9C
    void Start();
    // private System.Void LLFALEBAGKG()
    // Offset: 0x134D170
    void LLFALEBAGKG();
    // private System.Void JPHEBENNLCB()
    // Offset: 0x134D1F8
    void JPHEBENNLCB();
    // private System.Void SignalReceived(System.Byte KLIPNGBEELK)
    // Offset: 0x134D3EC
    void SignalReceived(uint8_t KLIPNGBEELK);
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x134D574
    void MLGBKBMHHLE();
    // private System.Void KIPDPKEIOEO()
    // Offset: 0x134D748
    void KIPDPKEIOEO();
    // private System.Void AFGEJPPGMPE()
    // Offset: 0x134D7A0
    void AFGEJPPGMPE();
  }; // MagicalActual.DungeonShard
  #pragma pack(pop)
  static check_size<sizeof(DungeonShard), 64 + sizeof(::UnityEngine::GameObject*)> __MagicalActual_DungeonShardSizeCheck;
  static_assert(sizeof(DungeonShard) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::DungeonShard::OAEPHGIOHAO
// Il2CppName: OAEPHGIOHAO
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DungeonShard::*)()>(&MagicalActual::DungeonShard::OAEPHGIOHAO)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::DungeonShard*), "OAEPHGIOHAO", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::DungeonShard::AKGFEENGKJD
// Il2CppName: AKGFEENGKJD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::DungeonShard::*)()>(&MagicalActual::DungeonShard::AKGFEENGKJD)> {
  static const MethodInfo* get() {
