// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PublicEventTriggerObject
  class PublicEventTriggerObject;
  // Forward declaring type: PublicEventTriggerCollider
  class PublicEventTriggerCollider;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DynamicEvent
  class DynamicEvent;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DynamicEvent);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DynamicEvent*, "MagicalActual", "DynamicEvent");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x92
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DynamicEvent
  // [TokenAttribute] Offset: FFFFFFFF
  class DynamicEvent : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Int32 eventId
    // Size: 0x4
    // Offset: 0x20
    int eventId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: eventId and: IJJGNKLFGJN
    char __padding1[0x4] = {};
    // protected MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String timesToStart
    // Size: 0x8
    // Offset: 0x30
    ::StringW timesToStart;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single detailsActiveDistance
    // Size: 0x4
    // Offset: 0x38
    float detailsActiveDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: detailsActiveDistance and: DMNHBEIHGMA
    char __padding4[0x4] = {};
    // private UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single IMFJBDFJELE
    // Size: 0x4
    // Offset: 0x48
    float IMFJBDFJELE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean JHFMAIFAIMM
    // Size: 0x1
    // Offset: 0x4C
    bool JHFMAIFAIMM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JHFMAIFAIMM and: FGALNHDAJGP
    char __padding7[0x3] = {};
    // protected System.Int64 FGALNHDAJGP
    // Size: 0x8
    // Offset: 0x50
    int64_t FGALNHDAJGP;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Boolean isGroupEvent
    // Size: 0x1
    // Offset: 0x58
    bool isGroupEvent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isManuallyTriggered
    // Size: 0x1
    // Offset: 0x59
    bool isManuallyTriggered;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isManuallyTriggered and: progressNeededToTrigger
    char __padding10[0x2] = {};
    // private System.Int32 progressNeededToTrigger
    // Size: 0x4
    // Offset: 0x5C
    int progressNeededToTrigger;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Events.UnityEvent onEventSucceeded
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Events::UnityEvent* onEventSucceeded;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent onEventStarted
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Events::UnityEvent* onEventStarted;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent onEventEnded
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Events::UnityEvent* onEventEnded;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public System.String eventDescription
    // Size: 0x8
    // Offset: 0x78
    ::StringW eventDescription;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String detailLabel
    // Size: 0x8
    // Offset: 0x80
    ::StringW detailLabel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.String HLOBKOHPGKI
    // Size: 0x8
    // Offset: 0x88
    ::StringW HLOBKOHPGKI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.Boolean EHJOPINNGII
    // Size: 0x1
    // Offset: 0x90
    bool EHJOPINNGII;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean GFBOCNFIKNE
    // Size: 0x1
    // Offset: 0x91
    bool GFBOCNFIKNE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: public System.Int32 eventId
    [[deprecated("Use field access instead!")]] int& dyn_eventId();
    // Get instance field reference: protected MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public System.String timesToStart
    [[deprecated("Use field access instead!")]] ::StringW& dyn_timesToStart();
    // Get instance field reference: private System.Single detailsActiveDistance
