// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: POIMapIcon
  class POIMapIcon;
  // Forward declaring type: POIMapListedItem
  class POIMapListedItem;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: RawImage
  class RawImage;
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Button
  class Button;
  // Forward declaring type: Slider
  class Slider;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DynamicPlayerMap
  class DynamicPlayerMap;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DynamicPlayerMap);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DynamicPlayerMap*, "MagicalActual", "DynamicPlayerMap");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x198
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DynamicPlayerMap
  // [TokenAttribute] Offset: FFFFFFFF
  class DynamicPlayerMap : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::DynamicPlayerMap::ZoneID
    struct ZoneID;
    public:
    // private UnityEngine.Transform playerIconPosition
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* playerIconPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform playerMapSize
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* playerMapSize;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform scaledView
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* scaledView;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform POIListContent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* POIListContent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.UI.RawImage currentMapImage
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::UI::RawImage* currentMapImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::RawImage*) == 0x8);
    // private UnityEngine.GameObject sceneViewTab
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* sceneViewTab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject fullMap
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* fullMap;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject mapIcon
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* mapIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject pointOfInterst
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* pointOfInterst;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject activePOIObjects
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* activePOIObjects;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject POIBeacon
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* POIBeacon;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject POIListedItem
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* POIListedItem;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.UI.Text mapIconText
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::UI::Text* mapIconText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text zoneViewText
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UI::Text* zoneViewText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text overworldViewText
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UI::Text* overworldViewText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text zoneName
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Text* zoneName;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text mapDescription
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UI::Text* mapDescription;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Button worldViewButton
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UI::Button* worldViewButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button mapExpandButton
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::UI::Button* mapExpandButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.UI.Button closeMapButton
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UI::Button* closeMapButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Button*) == 0x8);
    // private UnityEngine.Animator mapTransitionAnimator
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Animator* mapTransitionAnimator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.UI.Slider zoomSlider
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::UI::Slider* zoomSlider;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Texture> mapTextures
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::UnityEngine::Texture*>* mapTextures;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Texture*>*) == 0x8);
    // private System.Boolean DKGAJGOCAAI
    // Size: 0x1
    // Offset: 0xD0
    bool DKGAJGOCAAI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean LCNNFAFPOHO
    // Size: 0x1
    // Offset: 0xD1
    bool LCNNFAFPOHO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GCAHBNFJJEP
    // Size: 0x1
    // Offset: 0xD2
    bool GCAHBNFJJEP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean FENJPIMDFKE
    // Size: 0x1
    // Offset: 0xD3
    bool FENJPIMDFKE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PLKINNGJMJG
    // Size: 0x1
    // Offset: 0xD4
    bool PLKINNGJMJG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean NAJGKECEAJL
    // Size: 0x1
    // Offset: 0xD5
    bool NAJGKECEAJL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NAJGKECEAJL and: IBBJDAEBEMG
    char __padding28[0x2] = {};
    // private System.Int32 IBBJDAEBEMG
    // Size: 0x4
    // Offset: 0xD8
    int IBBJDAEBEMG;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 BNMKPIBENBD
    // Size: 0x4
    // Offset: 0xDC
    int BNMKPIBENBD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single GGMLKJEIAEK
    // Size: 0x4
    // Offset: 0xE0
    float GGMLKJEIAEK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: GGMLKJEIAEK and: OFFNEIGCLFM
    char __padding31[0x4] = {};
    // private System.String OFFNEIGCLFM
    // Size: 0x8
    // Offset: 0xE8
    ::StringW OFFNEIGCLFM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Quaternion KCFIONICMFJ
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Quaternion KCFIONICMFJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Color DNDLAJDABDL
    // Size: 0x10
    // Offset: 0x100
    ::UnityEngine::Color DNDLAJDABDL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color LMBFFGDFBCF
    // Size: 0x10
    // Offset: 0x110
    ::UnityEngine::Color LMBFFGDFBCF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color BLJNNMLIOMP
    // Size: 0x10
    // Offset: 0x120
    ::UnityEngine::Color BLJNNMLIOMP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Collections.Generic.List`1<MagicalActual.POIMapIcon> AANBGIIHHFO
    // Size: 0x8
    // Offset: 0x130
    ::System::Collections::Generic::List_1<::MagicalActual::POIMapIcon*>* AANBGIIHHFO;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::POIMapIcon*>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.POIMapListedItem> NOJDMPFKPBJ
    // Size: 0x8
    // Offset: 0x138
    ::System::Collections::Generic::List_1<::MagicalActual::POIMapListedItem*>* NOJDMPFKPBJ;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::POIMapListedItem*>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.POIMapListedItem> DBKELOFALHK
    // Size: 0x8
    // Offset: 0x140
    ::System::Collections::Generic::List_1<::MagicalActual::POIMapListedItem*>* DBKELOFALHK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::POIMapListedItem*>*) == 0x8);
    // private UnityEngine.Vector3 KIHJIJMFPBJ
    // Size: 0xC
    // Offset: 0x148
    ::UnityEngine::Vector3 KIHJIJMFPBJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 KAAMKFFOPLA
    // Size: 0xC
    // Offset: 0x154
    ::UnityEngine::Vector3 KAAMKFFOPLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 LMBCBOEEGEN
    // Size: 0xC
    // Offset: 0x160
    ::UnityEngine::Vector3 LMBCBOEEGEN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 MFBANLBAHOB
    // Size: 0xC
    // Offset: 0x16C
    ::UnityEngine::Vector3 MFBANLBAHOB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 HNNDHNNFDED
    // Size: 0xC
    // Offset: 0x178
    ::UnityEngine::Vector3 HNNDHNNFDED;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 OAFJMEDGCEC
    // Size: 0xC
    // Offset: 0x184
    ::UnityEngine::Vector3 OAFJMEDGCEC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.GameObject HJLHBMEEIGH
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::GameObject* HJLHBMEEIGH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Transform playerIconPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_playerIconPosition();
    // Get instance field reference: private UnityEngine.Transform playerMapSize
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_playerMapSize();
    // Get instance field reference: private UnityEngine.Transform scaledView
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_scaledView();
    // Get instance field reference: private UnityEngine.Transform POIListContent
