// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: DynamicEventBeacon
  class DynamicEventBeacon;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::DynamicEventBeacon);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::DynamicEventBeacon*, "MagicalActual", "DynamicEventBeacon");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x42
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.DynamicEventBeacon
  // [TokenAttribute] Offset: FFFFFFFF
  class DynamicEventBeacon : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single NIAKDIBIBED
    // Size: 0x4
    // Offset: 0x18
    float NIAKDIBIBED;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 AOOMBHJBBPN
    // Size: 0x4
    // Offset: 0x1C
    int AOOMBHJBBPN;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.MaterialPropertyBlock DCOLNNPGNIG
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::MaterialPropertyBlock* DCOLNNPGNIG;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private System.Int32 HJGFEMELLII
    // Size: 0x4
    // Offset: 0x28
    int HJGFEMELLII;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.UInt16 eventGuid
    // Size: 0x2
    // Offset: 0x2C
    uint16_t eventGuid;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: eventGuid and: myRenderer
    char __padding4[0x2] = {};
    // private UnityEngine.MeshRenderer myRenderer
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::MeshRenderer* myRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.GameObject difficultyIndicator
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* difficultyIndicator;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean isGroupEvent
    // Size: 0x1
    // Offset: 0x40
    bool isGroupEvent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isBattlegrounds
    // Size: 0x1
    // Offset: 0x41
    bool isBattlegrounds;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single NIAKDIBIBED
    [[deprecated("Use field access instead!")]] float& dyn_NIAKDIBIBED();
    // Get instance field reference: private System.Int32 AOOMBHJBBPN
    [[deprecated("Use field access instead!")]] int& dyn_AOOMBHJBBPN();
    // Get instance field reference: private UnityEngine.MaterialPropertyBlock DCOLNNPGNIG
    [[deprecated("Use field access instead!")]] ::UnityEngine::MaterialPropertyBlock*& dyn_DCOLNNPGNIG();
    // Get instance field reference: private System.Int32 HJGFEMELLII
    [[deprecated("Use field access instead!")]] int& dyn_HJGFEMELLII();
    // Get instance field reference: public System.UInt16 eventGuid
