// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: OrbusSlider
  class OrbusSlider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: EventUIController
  class EventUIController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::EventUIController);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::EventUIController*, "MagicalActual", "EventUIController");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.EventUIController
  // [TokenAttribute] Offset: FFFFFFFF
  class EventUIController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public SuperTextMesh description
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::SuperTextMesh* description;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public SuperTextMesh detailLabel
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::SuperTextMesh* detailLabel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public SuperTextMesh detail
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::SuperTextMesh* detail;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public OrbusSlider[] sliders
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::GlobalNamespace::OrbusSlider*> sliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::OrbusSlider*>) == 0x8);
    // private System.Boolean NBKGDLPFBAB
    // Size: 0x1
    // Offset: 0x38
    bool NBKGDLPFBAB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NBKGDLPFBAB and: PPKMINOHOHM
    char __padding4[0x3] = {};
    // private System.Single PPKMINOHOHM
    // Size: 0x4
    // Offset: 0x3C
    float PPKMINOHOHM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single INKFGNDPNMC
    // Size: 0x4
    // Offset: 0x40
    float INKFGNDPNMC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FEIKMEJALBB
    // Size: 0x4
    // Offset: 0x44
    float FEIKMEJALBB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public SuperTextMesh description
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_description();
    // Get instance field reference: public SuperTextMesh detailLabel
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_detailLabel();
    // Get instance field reference: public SuperTextMesh detail
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SuperTextMesh*& dyn_detail();
    // Get instance field reference: public OrbusSlider[] sliders
    [[deprecated("Use field access instead!")]] ::ArrayW<::GlobalNamespace::OrbusSlider*>& dyn_sliders();
    // Get instance field reference: private System.Boolean NBKGDLPFBAB
