// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: VectorLine
  class VectorLine;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: FaceController
  class FaceController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::FaceController);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::FaceController*, "MagicalActual", "FaceController");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x158
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.FaceController
  // [TokenAttribute] Offset: FFFFFFFF
  class FaceController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.GameObject eyePlane
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* eyePlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Material HEOAKNNMCAM
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Material* HEOAKNNMCAM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.GameObject mouthPlane
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* mouthPlane;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Material DOIEOJLKNJK
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Material* DOIEOJLKNJK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.MeshRenderer EEJDPDNHEIP
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshRenderer* EEJDPDNHEIP;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.GameObject eyePlaneLod1
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* eyePlaneLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject mouthPlaneLod1
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* mouthPlaneLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector2 OGEEDBLCNHI
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Vector2 OGEEDBLCNHI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Vector2 FDGJNCLDIMJ
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Vector2 FDGJNCLDIMJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // private UnityEngine.Animator NBNKFBECLJG
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Animator* NBNKFBECLJG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private System.Single ABLCMIJABMB
    // Size: 0x4
    // Offset: 0x68
    float ABLCMIJABMB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 OAHAIPJJMME
    // Size: 0x10
    // Offset: 0x6C
    ::UnityEngine::Vector4 OAHAIPJJMME;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector4 GAPIGMCLOIA
    // Size: 0x10
    // Offset: 0x7C
    ::UnityEngine::Vector4 GAPIGMCLOIA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector4 PLKEDOLMCBP
    // Size: 0x10
    // Offset: 0x8C
    ::UnityEngine::Vector4 PLKEDOLMCBP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector4 LIPDOCHLBHF
    // Size: 0x10
    // Offset: 0x9C
    ::UnityEngine::Vector4 LIPDOCHLBHF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector4 IDNEILOHGAD
    // Size: 0x10
    // Offset: 0xAC
    ::UnityEngine::Vector4 IDNEILOHGAD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private UnityEngine.Vector4 CFFLOLDIFLB
    // Size: 0x10
    // Offset: 0xBC
    ::UnityEngine::Vector4 CFFLOLDIFLB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Single KDBHEEHFIAA
    // Size: 0x4
    // Offset: 0xCC
    float KDBHEEHFIAA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JIMKPMCKGKE
    // Size: 0x4
    // Offset: 0xD0
    float JIMKPMCKGKE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CDHNGJBLGJA
    // Size: 0x4
    // Offset: 0xD4
    float CDHNGJBLGJA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HBIKKNNPPJC
    // Size: 0x4
    // Offset: 0xD8
    float HBIKKNNPPJC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean EHEDAOKFDEF
    // Size: 0x1
    // Offset: 0xDC
    bool EHEDAOKFDEF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EHEDAOKFDEF and: HGPLPFCONLJ
    char __padding21[0x3] = {};
    // private System.Int32 HGPLPFCONLJ
    // Size: 0x4
    // Offset: 0xE0
    int HGPLPFCONLJ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 DIPFAEIFIFG
    // Size: 0x4
    // Offset: 0xE4
    int DIPFAEIFIFG;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single OMBOIBJCBAH
    // Size: 0x4
    // Offset: 0xE8
    float OMBOIBJCBAH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PKLGJIGAEIK
    // Size: 0x4
    // Offset: 0xEC
    float PKLGJIGAEIK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private Vectrosity.VectorLine FCMPAELLPAG
    // Size: 0x8
    // Offset: 0xF0
    ::Vectrosity::VectorLine* FCMPAELLPAG;
    // Field size check
    static_assert(sizeof(::Vectrosity::VectorLine*) == 0x8);
    // private UnityEngine.GameObject MLNMDKHIHPD
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* MLNMDKHIHPD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean OLAHKNGNEOE
    // Size: 0x1
    // Offset: 0x100
    bool OLAHKNGNEOE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean NFANAHMAOCA
    // Size: 0x1
    // Offset: 0x101
    bool NFANAHMAOCA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ABBAFALCGEJ
    // Size: 0x1
    // Offset: 0x102
    bool ABBAFALCGEJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean useCommonEyeAndMouthSets
    // Size: 0x1
    // Offset: 0x103
    bool useCommonEyeAndMouthSets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Int32 faceSet
    // Size: 0x4
    // Offset: 0x104
    int faceSet;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 eyeSet
    // Size: 0x4
    // Offset: 0x108
    int eyeSet;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Color eyebrowColor
    // Size: 0x10
    // Offset: 0x10C
    ::UnityEngine::Color eyebrowColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color eyeColor
    // Size: 0x10
    // Offset: 0x11C
    ::UnityEngine::Color eyeColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: eyeColor and: MIBPECCLLLD
    char __padding35[0x4] = {};
    // private UnityEngine.Material[] MIBPECCLLLD
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::UnityEngine::Material*> MIBPECCLLLD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // private UnityEngine.Material[] BPIIANEONKB
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::UnityEngine::Material*> BPIIANEONKB;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Material*>) == 0x8);
    // public System.Boolean isFemaleVoice
    // Size: 0x1
    // Offset: 0x140
    bool isFemaleVoice;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isFemaleVoice and: voiceSet
    char __padding38[0x3] = {};
    // public System.Int32 voiceSet
    // Size: 0x4
    // Offset: 0x144
    int voiceSet;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x148
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private UnityEngine.AudioClip[] KLICLEHPDLC
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::AudioClip*> KLICLEHPDLC;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject eyePlane
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_eyePlane();
    // Get instance field reference: private UnityEngine.Material HEOAKNNMCAM
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_HEOAKNNMCAM();
    // Get instance field reference: public UnityEngine.GameObject mouthPlane
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_mouthPlane();
    // Get instance field reference: private UnityEngine.Material DOIEOJLKNJK
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_DOIEOJLKNJK();
