// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: SphereCollider
  class SphereCollider;
  // Forward declaring type: LineRenderer
  class LineRenderer;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: FisherReel
  class FisherReel;
  // Forward declaring type: FishingRod
  class FishingRod;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: FishingLure
  class FishingLure;
  // Forward declaring type: Catenary
  class Catenary;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: LTDescr
  class LTDescr;
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Fisher
  class Fisher;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Fisher);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Fisher*, "MagicalActual", "Fisher");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x208
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Fisher
  // [TokenAttribute] Offset: FFFFFFFF
  class Fisher : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::Fisher::FishingPoleState
    struct FishingPoleState;
    // Nested type: ::MagicalActual::Fisher::$WaitForEquimentUpdate$d__83
    class $WaitForEquimentUpdate$d__83;
    // Nested type: ::MagicalActual::Fisher::$$c__DisplayClass93_0
    class $$c__DisplayClass93_0;
    // Nested type: ::MagicalActual::Fisher::$$c
    class $$c;
    // Nested type: ::MagicalActual::Fisher::$$c__DisplayClass106_0
    class $$c__DisplayClass106_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.Fisher/FishingPoleState
    // [TokenAttribute] Offset: FFFFFFFF
    struct FishingPoleState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: FishingPoleState
      constexpr FishingPoleState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.Fisher/FishingPoleState FNCIFCNLJBM
      static constexpr const int FNCIFCNLJBM = 0;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState FNCIFCNLJBM
      static ::MagicalActual::Fisher::FishingPoleState _get_FNCIFCNLJBM();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState FNCIFCNLJBM
      static void _set_FNCIFCNLJBM(::MagicalActual::Fisher::FishingPoleState value);
      // static field const value: static public MagicalActual.Fisher/FishingPoleState ALCNEPGOEOA
      static constexpr const int ALCNEPGOEOA = 1;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState ALCNEPGOEOA
      static ::MagicalActual::Fisher::FishingPoleState _get_ALCNEPGOEOA();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState ALCNEPGOEOA
      static void _set_ALCNEPGOEOA(::MagicalActual::Fisher::FishingPoleState value);
      // static field const value: static public MagicalActual.Fisher/FishingPoleState CFNALLKJIAO
      static constexpr const int CFNALLKJIAO = 2;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState CFNALLKJIAO
      static ::MagicalActual::Fisher::FishingPoleState _get_CFNALLKJIAO();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState CFNALLKJIAO
      static void _set_CFNALLKJIAO(::MagicalActual::Fisher::FishingPoleState value);
      // static field const value: static public MagicalActual.Fisher/FishingPoleState LBEPIFGAANM
      static constexpr const int LBEPIFGAANM = 4;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState LBEPIFGAANM
      static ::MagicalActual::Fisher::FishingPoleState _get_LBEPIFGAANM();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState LBEPIFGAANM
      static void _set_LBEPIFGAANM(::MagicalActual::Fisher::FishingPoleState value);
      // static field const value: static public MagicalActual.Fisher/FishingPoleState OIIANPCAKGD
      static constexpr const int OIIANPCAKGD = 8;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState OIIANPCAKGD
      static ::MagicalActual::Fisher::FishingPoleState _get_OIIANPCAKGD();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState OIIANPCAKGD
      static void _set_OIIANPCAKGD(::MagicalActual::Fisher::FishingPoleState value);
      // static field const value: static public MagicalActual.Fisher/FishingPoleState HAFHPFKBAIJ
      static constexpr const int HAFHPFKBAIJ = 16;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState HAFHPFKBAIJ
      static ::MagicalActual::Fisher::FishingPoleState _get_HAFHPFKBAIJ();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState HAFHPFKBAIJ
      static void _set_HAFHPFKBAIJ(::MagicalActual::Fisher::FishingPoleState value);
      // static field const value: static public MagicalActual.Fisher/FishingPoleState IOBMAJKPGJG
      static constexpr const int IOBMAJKPGJG = 32;
      // Get static field: static public MagicalActual.Fisher/FishingPoleState IOBMAJKPGJG
      static ::MagicalActual::Fisher::FishingPoleState _get_IOBMAJKPGJG();
      // Set static field: static public MagicalActual.Fisher/FishingPoleState IOBMAJKPGJG
      static void _set_IOBMAJKPGJG(::MagicalActual::Fisher::FishingPoleState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.Fisher/FishingPoleState
    #pragma pack(pop)
    static check_size<sizeof(Fisher::FishingPoleState), 0 + sizeof(int)> __MagicalActual_Fisher_FishingPoleStateSizeCheck;
    static_assert(sizeof(Fisher::FishingPoleState) == 0x4);
    public:
    // public MagicalActual.Fisher/FishingPoleState currentState
    // Size: 0x4
    // Offset: 0x18
    ::MagicalActual::Fisher::FishingPoleState currentState;
    // Field size check
    static_assert(sizeof(::MagicalActual::Fisher::FishingPoleState) == 0x4);
    // Padding between fields: currentState and: fishingPole
    char __padding0[0x4] = {};
    // public UnityEngine.GameObject fishingPole
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* fishingPole;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject fishingLurePrefab
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* fishingLurePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.FisherReel MHEMPMANJGK
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::FisherReel* MHEMPMANJGK;
    // Field size check
    static_assert(sizeof(::MagicalActual::FisherReel*) == 0x8);
    // private MagicalActual.FishingRod LMDOLLFMAEG
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::FishingRod* LMDOLLFMAEG;
    // Field size check
    static_assert(sizeof(::MagicalActual::FishingRod*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private OrbusTrackedController DFCJLOAJNBF
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::OrbusTrackedController* DFCJLOAJNBF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // public UnityEngine.GameObject vfxBobberSplash
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* vfxBobberSplash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject poleTip
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* poleTip;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bobberPrefab
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* bobberPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Material lineRendererMaterial
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* lineRendererMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public MagicalActual.FishingLure myLure
    // Size: 0x8
    // Offset: 0x78
    ::MagicalActual::FishingLure* myLure;
    // Field size check
    static_assert(sizeof(::MagicalActual::FishingLure*) == 0x8);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x80
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0x81
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IMNDEEOEOKA and: currentBobber
    char __padding14[0x6] = {};
    // public UnityEngine.GameObject currentBobber
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* currentBobber;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bobberHook
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* bobberHook;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.SphereCollider DKAKFGLNMJO
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::SphereCollider* DKAKFGLNMJO;
    // Field size check
    static_assert(sizeof(::UnityEngine::SphereCollider*) == 0x8);
    // private System.UInt16 FHNLNPJECIJ
    // Size: 0x2
    // Offset: 0xA0
    uint16_t FHNLNPJECIJ;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: FHNLNPJECIJ and: BLBCOEFNBGC
    char __padding18[0x2] = {};
    // private System.Int32 BLBCOEFNBGC
    // Size: 0x4
    // Offset: 0xA4
    int BLBCOEFNBGC;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single AHHJNJGIBHO
    // Size: 0x4
    // Offset: 0xA8
    float AHHJNJGIBHO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DMJHMPDIOMG
    // Size: 0x4
    // Offset: 0xAC
    float DMJHMPDIOMG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MDBFGANEIMG
    // Size: 0x4
    // Offset: 0xB0
    float MDBFGANEIMG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HHMKAJMMBIA
    // Size: 0x4
    // Offset: 0xB4
    float HHMKAJMMBIA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 DFECNPDIIIF
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::Vector3 DFECNPDIIIF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single FEJJMKDFFMB
    // Size: 0x4
    // Offset: 0xC4
    float FEJJMKDFFMB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ODBIGPONDOI
    // Size: 0x4
    // Offset: 0xC8
    float ODBIGPONDOI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DPMOBAHKICI
    // Size: 0x4
    // Offset: 0xCC
    float DPMOBAHKICI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HIOPPBIDJKI
    // Size: 0x4
    // Offset: 0xD0
    float HIOPPBIDJKI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OBNFFGGOPKL
    // Size: 0x4
    // Offset: 0xD4
    float OBNFFGGOPKL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt HFOEIFGCKLH
    // Size: 0x19
    // Offset: 0xD8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt HFOEIFGCKLH;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: HFOEIFGCKLH and: CGGGOGJLHBI
    char __padding30[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt CGGGOGJLHBI
    // Size: 0x19
    // Offset: 0xF8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt CGGGOGJLHBI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: CGGGOGJLHBI and: NFGMKIOJBKC
    char __padding31[0x7] = {};
    // private System.Boolean NFGMKIOJBKC
    // Size: 0x1
    // Offset: 0x118
    bool NFGMKIOJBKC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NFGMKIOJBKC and: EFHINJKJIOK
    char __padding32[0x3] = {};
    // private System.Single EFHINJKJIOK
    // Size: 0x4
    // Offset: 0x11C
    float EFHINJKJIOK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MOABAHBDHKD
    // Size: 0x4
    // Offset: 0x120
    float MOABAHBDHKD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: MOABAHBDHKD and: KKGJPMDJOMJ
    char __padding34[0x4] = {};
    // private UnityEngine.Vector3[] KKGJPMDJOMJ
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::UnityEngine::Vector3> KKGJPMDJOMJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.LineRenderer ADMMPKAAILI
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::LineRenderer* ADMMPKAAILI;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // public UnityEngine.GameObject teleportLineHolder
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* teleportLineHolder;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.Catenary GKAGLCILGBD
    // Size: 0x8
    // Offset: 0x140
    ::MagicalActual::Catenary* GKAGLCILGBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::Catenary*) == 0x8);
    // private System.Single EGOGPGKIELK
    // Size: 0x4
    // Offset: 0x148
    float EGOGPGKIELK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MEKAJJADOCO
    // Size: 0x4
    // Offset: 0x14C
    float MEKAJJADOCO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ADHBAFBEBHF
    // Size: 0x4
    // Offset: 0x150
    float ADHBAFBEBHF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 CFMENBDECDM
    // Size: 0xC
    // Offset: 0x154
    ::UnityEngine::Vector3 CFMENBDECDM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 PCHEPFCPKJF
    // Size: 0xC
    // Offset: 0x160
    ::UnityEngine::Vector3 PCHEPFCPKJF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single MGPPKAPDKMI
    // Size: 0x4
    // Offset: 0x16C
    float MGPPKAPDKMI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HIGCJMLLCNC
    // Size: 0x4
    // Offset: 0x170
    float HIGCJMLLCNC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KHIAEEEGBEH
    // Size: 0x4
    // Offset: 0x174
    float KHIAEEEGBEH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OAPAOPJMKKO
    // Size: 0x4
    // Offset: 0x178
    float OAPAOPJMKKO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BEEEDGANDCL
    // Size: 0x4
    // Offset: 0x17C
    float BEEEDGANDCL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HMCFPMPIDCG
    // Size: 0x4
    // Offset: 0x180
    float HMCFPMPIDCG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MFENOKCCEPP
    // Size: 0x4
    // Offset: 0x184
    float MFENOKCCEPP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OJLFDAEHOEP
    // Size: 0x4
    // Offset: 0x188
    float OJLFDAEHOEP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IKAAIBELCFM
    // Size: 0x4
    // Offset: 0x18C
    float IKAAIBELCFM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HHPOEDJMBKD
    // Size: 0x4
    // Offset: 0x190
    float HHPOEDJMBKD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JMEAOGNBKJK
    // Size: 0x4
    // Offset: 0x194
    float JMEAOGNBKJK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JKFBEOKJGHB
    // Size: 0x4
    // Offset: 0x198
    float JKFBEOKJGHB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: JKFBEOKJGHB and: fishToCatch
    char __padding55[0x4] = {};
    // public UnityEngine.GameObject fishToCatch
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::GameObject* fishToCatch;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject EBBNPLJEFEA
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::GameObject* EBBNPLJEFEA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private LTDescr HMGLOPFFNPP
    // Size: 0x8
    // Offset: 0x1B0
    ::GlobalNamespace::LTDescr* HMGLOPFFNPP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LTDescr*) == 0x8);
    // public System.Boolean isLocallyControlled
    // Size: 0x1
    // Offset: 0x1B8
    bool isLocallyControlled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLocallyControlled and: poleStatusText
    char __padding59[0x7] = {};
    // public SuperTextMesh poleStatusText
    // Size: 0x8
    // Offset: 0x1C0
    ::GlobalNamespace::SuperTextMesh* poleStatusText;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x1C8
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x1D0
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE33C0
    // private UnityEngine.GameObject <FFOEPKJAFFC>k__BackingField
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::GameObject* FFOEPKJAFFC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE33D0
    // private UnityEngine.GameObject <LIGKEMHOHLC>k__BackingField
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::GameObject* LIGKEMHOHLC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OrbusTrackedController IKCANGJCBED
    // Size: 0x8
    // Offset: 0x1E8
    ::GlobalNamespace::OrbusTrackedController* IKCANGJCBED;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private OrbusTrackedController HKFGNKJKLPH
    // Size: 0x8
    // Offset: 0x1F0
    ::GlobalNamespace::OrbusTrackedController* HKFGNKJKLPH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private ClickedEventHandler AACCFGBENDD
    // Size: 0x8
    // Offset: 0x1F8
    ::GlobalNamespace::ClickedEventHandler* AACCFGBENDD;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler HPCILNMEOPH
    // Size: 0x8
    // Offset: 0x200
    ::GlobalNamespace::ClickedEventHandler* HPCILNMEOPH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.Fisher/FishingPoleState currentState
    [[deprecated("Use field access instead!")]] ::MagicalActual::Fisher::FishingPoleState& dyn_currentState();
    // Get instance field reference: public UnityEngine.GameObject fishingPole
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_fishingPole();
    // Get instance field reference: public UnityEngine.GameObject fishingLurePrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_fishingLurePrefab();
    // Get instance field reference: private MagicalActual.FisherReel MHEMPMANJGK
