// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Fisher
  class Fisher;
  // Forward declaring type: FisherReel
  class FisherReel;
  // Forward declaring type: PlayerTool
  class PlayerTool;
  // Forward declaring type: DynamicPlayerMap
  class DynamicPlayerMap;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: FishingRod
  class FishingRod;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::FishingRod);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::FishingRod*, "MagicalActual", "FishingRod");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.FishingRod
  // [TokenAttribute] Offset: FFFFFFFF
  class FishingRod : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public MagicalActual.Fisher myFisher
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Fisher* myFisher;
    // Field size check
    static_assert(sizeof(::MagicalActual::Fisher*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE33F0
    // private MagicalActual.FisherReel <HPDMEHEEGHG>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::FisherReel* HPDMEHEEGHG;
    // Field size check
    static_assert(sizeof(::MagicalActual::FisherReel*) == 0x8);
    // private MagicalActual.PlayerTool FKJHGIFOJKD
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::PlayerTool* FKJHGIFOJKD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    // private UnityEngine.GameObject hipRod
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* hipRod;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject heldRod
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* heldRod;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform poleStatus
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* poleStatus;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean isHeld
    // Size: 0x1
    // Offset: 0x48
    bool isHeld;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isAlreadyHidden
    // Size: 0x1
    // Offset: 0x49
    bool isAlreadyHidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isInit
    // Size: 0x1
    // Offset: 0x4A
    bool isInit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isInit and: OOAIOOMLGHB
    char __padding8[0x5] = {};
    // private MagicalActual.DynamicPlayerMap OOAIOOMLGHB
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::DynamicPlayerMap* OOAIOOMLGHB;
    // Field size check
    static_assert(sizeof(::MagicalActual::DynamicPlayerMap*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.Fisher myFisher
    [[deprecated("Use field access instead!")]] ::MagicalActual::Fisher*& dyn_myFisher();
    // Get instance field reference: private MagicalActual.FisherReel <HPDMEHEEGHG>k__BackingField
    [[deprecated("Use field access instead!")]] ::MagicalActual::FisherReel*& dyn_$HPDMEHEEGHG$k__BackingField();
    // Get instance field reference: private MagicalActual.PlayerTool FKJHGIFOJKD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerTool*& dyn_FKJHGIFOJKD();
    // Get instance field reference: private UnityEngine.GameObject hipRod
