// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: FogChange
  class FogChange;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::FogChange);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::FogChange*, "MagicalActual", "FogChange");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.FogChange
  // [TokenAttribute] Offset: FFFFFFFF
  class FogChange : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Boolean doNotChangeFogColor
    // Size: 0x1
    // Offset: 0x18
    bool doNotChangeFogColor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doNotChangeFogColor and: fogColor
    char __padding0[0x3] = {};
    // public UnityEngine.Color fogColor
    // Size: 0x10
    // Offset: 0x1C
    ::UnityEngine::Color fogColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single fogDensity
    // Size: 0x4
    // Offset: 0x2C
    float fogDensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lerpTime
    // Size: 0x4
    // Offset: 0x30
    float lerpTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CAJOGEKCPGL
    // Size: 0x4
    // Offset: 0x34
    float CAJOGEKCPGL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CHMMAFLLJBA
    // Size: 0x4
    // Offset: 0x38
    float CHMMAFLLJBA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color LJLNAAAAIND
    // Size: 0x10
    // Offset: 0x3C
    ::UnityEngine::Color LJLNAAAAIND;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color MKILAANKBLF
    // Size: 0x10
    // Offset: 0x4C
    ::UnityEngine::Color MKILAANKBLF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single NACAIOIMNBK
    // Size: 0x4
    // Offset: 0x5C
    float NACAIOIMNBK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DNKOKEIOGFJ
    // Size: 0x4
    // Offset: 0x60
    float DNKOKEIOGFJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean BLOBNEEIBON
    // Size: 0x1
    // Offset: 0x64
    bool BLOBNEEIBON;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean BCHLKACHIOC
    // Size: 0x1
    // Offset: 0x65
    bool BCHLKACHIOC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean JIODMGKMDNL
    // Size: 0x1
    // Offset: 0x66
    bool JIODMGKMDNL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IEAINLLJHOD
    // Size: 0x1
    // Offset: 0x67
    bool IEAINLLJHOD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single OKKAKDLGJKE
    // Size: 0x4
    // Offset: 0x68
    float OKKAKDLGJKE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: OKKAKDLGJKE and: BHHGMPLHEDC
    char __padding14[0x4] = {};
    // private System.String BHHGMPLHEDC
    // Size: 0x8
    // Offset: 0x70
    ::StringW BHHGMPLHEDC;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Collider BBOMOHLELBB
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Collider* BBOMOHLELBB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Boolean doNotChangeFogColor
    [[deprecated("Use field access instead!")]] bool& dyn_doNotChangeFogColor();
    // Get instance field reference: public UnityEngine.Color fogColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_fogColor();
    // Get instance field reference: public System.Single fogDensity
    [[deprecated("Use field access instead!")]] float& dyn_fogDensity();
    // Get instance field reference: public System.Single lerpTime
    [[deprecated("Use field access instead!")]] float& dyn_lerpTime();
    // Get instance field reference: private System.Single CAJOGEKCPGL
