// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObInt
#include "CodeStage/AntiCheat/ObscuredTypes/ObInt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: Grabber
  class Grabber;
  // Forward declaring type: GamblerDeck
  class GamblerDeck;
  // Forward declaring type: GamblerDrawnCard
  class GamblerDrawnCard;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Gambler
  class Gambler;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Gambler);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Gambler*, "MagicalActual", "Gambler");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x2B5
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Gambler
  // [TokenAttribute] Offset: FFFFFFFF
  class Gambler : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Gambler::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::Gambler::orbusIncomingMethodIdx
    struct orbusIncomingMethodIdx;
    // Nested type: ::MagicalActual::Gambler::$$c__DisplayClass74_0
    class $$c__DisplayClass74_0;
    // Nested type: ::MagicalActual::Gambler::$$c__DisplayClass86_0
    class $$c__DisplayClass86_0;
    // Nested type: ::MagicalActual::Gambler::$$c
    class $$c;
    // Nested type: ::MagicalActual::Gambler::$$c__DisplayClass100_0
    class $$c__DisplayClass100_0;
    // Nested type: ::MagicalActual::Gambler::$$c__DisplayClass101_0
    class $$c__DisplayClass101_0;
    // Nested type: ::MagicalActual::Gambler::$$c__DisplayClass106_0
    class $$c__DisplayClass106_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x28
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: FNINBDEICCD
    char __padding2[0x7] = {};
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private OrbusTrackedController NAFKPBDAGKG
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::OrbusTrackedController* NAFKPBDAGKG;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private MagicalActual.Grabber KENJKDFDJHA
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::Grabber* KENJKDFDJHA;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private System.Int32 KHIKJLICKKF
    // Size: 0x4
    // Offset: 0x68
    int KHIKJLICKKF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 FJPBNPLIKHA
    // Size: 0x4
    // Offset: 0x6C
    int FJPBNPLIKHA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.GameObject gun
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* gun;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bowFirePoint
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* bowFirePoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject superVfx
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* superVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bulletPrefab
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* bulletPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bulletTrail
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* bulletTrail;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.AudioClip gunFireSfx
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::AudioClip* gunFireSfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.GameObject gunFireVfx
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* gunFireVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.AudioSource BPFOFPNPABM
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::AudioSource* BPFOFPNPABM;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.GameObject vfxBlood
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* vfxBlood;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxCardHit
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* vfxCardHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject chamber
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* chamber;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.GamblerDeck myDeck
    // Size: 0x8
    // Offset: 0xD0
    ::MagicalActual::GamblerDeck* myDeck;
    // Field size check
    static_assert(sizeof(::MagicalActual::GamblerDeck*) == 0x8);
    // private UnityEngine.GameObject JAJMGECJGGA
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* JAJMGECJGGA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 GJJDIJAFLGA
    // Size: 0x4
    // Offset: 0xE0
    int GJJDIJAFLGA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean BNFNNGFCKBK
    // Size: 0x1
    // Offset: 0xE4
    bool BNFNNGFCKBK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0xE5
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0xE6
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0xE7
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0xE8
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IMNDEEOEOKA and: IAIBPCPKDJE
    char __padding31[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt IAIBPCPKDJE
    // Size: 0x19
    // Offset: 0xF0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt IAIBPCPKDJE;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: IAIBPCPKDJE and: FABKFLBCALA
    char __padding32[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt FABKFLBCALA
    // Size: 0x19
    // Offset: 0x110
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt FABKFLBCALA;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: FABKFLBCALA and: DFNIAPKNIDI
    char __padding33[0x7] = {};
    // private System.Boolean DFNIAPKNIDI
    // Size: 0x1
    // Offset: 0x130
    bool DFNIAPKNIDI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DFNIAPKNIDI and: drawnCardPrototype
    char __padding34[0x7] = {};
    // public MagicalActual.GamblerDrawnCard drawnCardPrototype
    // Size: 0x8
    // Offset: 0x138
    ::MagicalActual::GamblerDrawnCard* drawnCardPrototype;
    // Field size check
    static_assert(sizeof(::MagicalActual::GamblerDrawnCard*) == 0x8);
    // public UnityEngine.Sprite[] cardTypes
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::UnityEngine::Sprite*> cardTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Sprite*>) == 0x8);
    // private MagicalActual.GamblerDrawnCard MJCEMDFFHGH
    // Size: 0x8
    // Offset: 0x148
    ::MagicalActual::GamblerDrawnCard* MJCEMDFFHGH;
    // Field size check
    static_assert(sizeof(::MagicalActual::GamblerDrawnCard*) == 0x8);
    // public UnityEngine.UI.Image cardsLeftIndicator
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::UI::Image* cardsLeftIndicator;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public SuperTextMesh cardsLeftNumber
    // Size: 0x8
    // Offset: 0x158
    ::GlobalNamespace::SuperTextMesh* cardsLeftNumber;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.GameObject[] pendingEmpowerments
    // Size: 0x8
    // Offset: 0x160
    ::ArrayW<::UnityEngine::GameObject*> pendingEmpowerments;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.SpriteRenderer pendingCardSprite
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::SpriteRenderer* pendingCardSprite;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpriteRenderer*) == 0x8);
    // public UnityEngine.GameObject cardBurnVfx
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::GameObject* cardBurnVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public SuperTextMesh gamblerShotRatingPrefab
    // Size: 0x8
    // Offset: 0x178
    ::GlobalNamespace::SuperTextMesh* gamblerShotRatingPrefab;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.GameObject cardHolder
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::GameObject* cardHolder;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.RaycastHit[] EHLLMIKFMJG
    // Size: 0x8
    // Offset: 0x188
    ::ArrayW<::UnityEngine::RaycastHit> EHLLMIKFMJG;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObInt PLNKNIDGBAG
    // Size: 0x11
    // Offset: 0x190
    ::CodeStage::AntiCheat::ObscuredTypes::ObInt PLNKNIDGBAG;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObInt) == 0x11);
    // Padding between fields: PLNKNIDGBAG and: FDPKCHPKNIG
    char __padding46[0x3] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObInt FDPKCHPKNIG
    // Size: 0x11
    // Offset: 0x1A4
    ::CodeStage::AntiCheat::ObscuredTypes::ObInt FDPKCHPKNIG;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObInt) == 0x11);
    // Padding between fields: FDPKCHPKNIG and: BDAOHHGGFDJ
    char __padding47[0x3] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt BDAOHHGGFDJ
    // Size: 0x19
    // Offset: 0x1B8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt BDAOHHGGFDJ;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: BDAOHHGGFDJ and: EEIPIJAHOEB
    char __padding48[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt EEIPIJAHOEB
    // Size: 0x19
    // Offset: 0x1D8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt EEIPIJAHOEB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: EEIPIJAHOEB and: CBMBPFKNJPE
    char __padding49[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt CBMBPFKNJPE
    // Size: 0x19
    // Offset: 0x1F8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt CBMBPFKNJPE;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: CBMBPFKNJPE and: HDFPINPAIHK
    char __padding50[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt HDFPINPAIHK
    // Size: 0x19
    // Offset: 0x218
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt HDFPINPAIHK;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: HDFPINPAIHK and: DFNHAODJMDD
    char __padding51[0x7] = {};
    // private System.Single DFNHAODJMDD
    // Size: 0x4
    // Offset: 0x238
    float DFNHAODJMDD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IOGAAAHCPGM
    // Size: 0x4
    // Offset: 0x23C
    float IOGAAAHCPGM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private CodeStage.AntiCheat.ObscuredTypes.ObInt BMMJKBEFLCA
    // Size: 0x11
    // Offset: 0x240
    ::CodeStage::AntiCheat::ObscuredTypes::ObInt BMMJKBEFLCA;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObInt) == 0x11);
    // Padding between fields: BMMJKBEFLCA and: EMPPOAILJNM
    char __padding54[0x3] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObInt EMPPOAILJNM
    // Size: 0x11
    // Offset: 0x254
    ::CodeStage::AntiCheat::ObscuredTypes::ObInt EMPPOAILJNM;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObInt) == 0x11);
    // Padding between fields: EMPPOAILJNM and: chargeUpVFX
    char __padding55[0x3] = {};
    // private UnityEngine.GameObject chargeUpVFX
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::GameObject* chargeUpVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 CKKFDCEMMKE
    // Size: 0xC
    // Offset: 0x270
    ::UnityEngine::Vector3 CKKFDCEMMKE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: CKKFDCEMMKE and: HBOOKAFBIEP
    char __padding57[0x4] = {};
    // private ClickedEventHandler HBOOKAFBIEP
    // Size: 0x8
    // Offset: 0x280
    ::GlobalNamespace::ClickedEventHandler* HBOOKAFBIEP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler CNLIOBNKIEO
    // Size: 0x8
    // Offset: 0x288
    ::GlobalNamespace::ClickedEventHandler* CNLIOBNKIEO;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler HCJEOHLOMGB
    // Size: 0x8
    // Offset: 0x290
    ::GlobalNamespace::ClickedEventHandler* HCJEOHLOMGB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler BMPJOEDPLCH
    // Size: 0x8
    // Offset: 0x298
    ::GlobalNamespace::ClickedEventHandler* BMPJOEDPLCH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler BHLDGAKLBLB
    // Size: 0x8
    // Offset: 0x2A0
    ::GlobalNamespace::ClickedEventHandler* BHLDGAKLBLB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler MDEBIKPCABE
    // Size: 0x8
    // Offset: 0x2A8
    ::GlobalNamespace::ClickedEventHandler* MDEBIKPCABE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private System.Byte BFJNJBICBND
    // Size: 0x1
    // Offset: 0x2B0
    uint8_t BFJNJBICBND;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte JNHGILGMIOM
    // Size: 0x1
    // Offset: 0x2B1
    uint8_t JNHGILGMIOM;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte IPKMHOFLDJN
    // Size: 0x1
    // Offset: 0x2B2
    uint8_t IPKMHOFLDJN;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte AFIIKPFAKLG
    // Size: 0x1
    // Offset: 0x2B3
    uint8_t AFIIKPFAKLG;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean EOGGPPBNCMM
    // Size: 0x1
    // Offset: 0x2B4
    bool EOGGPPBNCMM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
