// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Gambler
  class Gambler;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: GamblerDrawnCard
  class GamblerDrawnCard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::GamblerDrawnCard);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::GamblerDrawnCard*, "MagicalActual", "GamblerDrawnCard");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.GamblerDrawnCard
  // [TokenAttribute] Offset: FFFFFFFF
  class GamblerDrawnCard : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public MagicalActual.Gambler myGambler
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Gambler* myGambler;
    // Field size check
    static_assert(sizeof(::MagicalActual::Gambler*) == 0x8);
    // public System.Byte cardType
    // Size: 0x1
    // Offset: 0x20
    uint8_t cardType;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Boolean hasBeenHit
    // Size: 0x1
    // Offset: 0x21
    bool hasBeenHit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasBeenHit and: BCMGPEHLBKJ
    char __padding2[0x6] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3480
    // private UnityEngine.SpriteRenderer <BCMGPEHLBKJ>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::SpriteRenderer* BCMGPEHLBKJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpriteRenderer*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3490
    // private PhysicsInteractable <NPOPILONGLE>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PhysicsInteractable* NPOPILONGLE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Boolean IGDOJCIJOLB
    // Size: 0x1
    // Offset: 0x40
    bool IGDOJCIJOLB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DCOAFHOIHKO
    // Size: 0x1
    // Offset: 0x41
    bool DCOAFHOIHKO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean EBNPENMPIPB
    // Size: 0x1
    // Offset: 0x42
    bool EBNPENMPIPB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MCOLPGEJCLO
    // Size: 0x1
    // Offset: 0x43
    bool MCOLPGEJCLO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MCOLPGEJCLO and: EIPMBKLODIJ
    char __padding9[0x4] = {};
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.Gambler myGambler
    [[deprecated("Use field access instead!")]] ::MagicalActual::Gambler*& dyn_myGambler();
    // Get instance field reference: public System.Byte cardType
    [[deprecated("Use field access instead!")]] uint8_t& dyn_cardType();
    // Get instance field reference: public System.Boolean hasBeenHit
    [[deprecated("Use field access instead!")]] bool& dyn_hasBeenHit();
    // Get instance field reference: private UnityEngine.SpriteRenderer <BCMGPEHLBKJ>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::SpriteRenderer*& dyn_$BCMGPEHLBKJ$k__BackingField();
