// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: InteractableEntity
  class InteractableEntity;
  // Forward declaring type: ToolController
  class ToolController;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: GoldenEgg
  class GoldenEgg;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::GoldenEgg);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::GoldenEgg*, "MagicalActual", "GoldenEgg");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xBC
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.GoldenEgg
  // [TokenAttribute] Offset: FFFFFFFF
  class GoldenEgg : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.InteractableEntity interactable
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::InteractableEntity* interactable;
    // Field size check
    static_assert(sizeof(::MagicalActual::InteractableEntity*) == 0x8);
    // private MagicalActual.ToolController toolController
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::ToolController* toolController;
    // Field size check
    static_assert(sizeof(::MagicalActual::ToolController*) == 0x8);
    // private UnityEngine.AudioSource burnSound
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::AudioSource* burnSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private System.Single GKIKBKKOJBM
    // Size: 0x4
    // Offset: 0x40
    float GKIKBKKOJBM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: GKIKBKKOJBM and: warningSound
    char __padding5[0x4] = {};
    // private UnityEngine.AudioSource warningSound
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioSource* warningSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.ParticleSystem warningRing
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::ParticleSystem* warningRing;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.ParticleSystem ball
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::ParticleSystem* ball;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.ParticleSystem wave
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::ParticleSystem* wave;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.Color EINFBAGALDO
    // Size: 0x10
    // Offset: 0x68
    ::UnityEngine::Color EINFBAGALDO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color warningColor
    // Size: 0x10
    // Offset: 0x78
    ::UnityEngine::Color warningColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single FBCOCEIMAJA
    // Size: 0x4
    // Offset: 0x88
    float FBCOCEIMAJA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single JGNCDEKLFBE
    // Size: 0x4
    // Offset: 0x8C
    float JGNCDEKLFBE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NFGKOMJKEIE
    // Size: 0x4
    // Offset: 0x90
    float NFGKOMJKEIE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DPPMKPJJBOE
    // Size: 0x4
    // Offset: 0x94
    float DPPMKPJJBOE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean OKGNEKOLAIB
    // Size: 0x1
    // Offset: 0x98
    bool OKGNEKOLAIB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OKGNEKOLAIB and: OBHLMJGLCPH
    char __padding16[0x3] = {};
    // private System.Single OBHLMJGLCPH
    // Size: 0x4
    // Offset: 0x9C
    float OBHLMJGLCPH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean JHIFBLLODML
    // Size: 0x1
    // Offset: 0xA0
    bool JHIFBLLODML;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean LELFEHGOOBK
    // Size: 0x1
    // Offset: 0xA1
    bool LELFEHGOOBK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LELFEHGOOBK and: KPEBFGPKMNC
    char __padding19[0x6] = {};
    // private MagicalActual.Grabber KPEBFGPKMNC
    // Size: 0x8
    // Offset: 0xA8
    ::MagicalActual::Grabber* KPEBFGPKMNC;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private UnityEngine.Vector3 DGABHDNNGFG
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 DGABHDNNGFG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.InteractableEntity interactable
    [[deprecated("Use field access instead!")]] ::MagicalActual::InteractableEntity*& dyn_interactable();
    // Get instance field reference: private MagicalActual.ToolController toolController
