// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: DynamicPlayerMap
  class DynamicPlayerMap;
  // Forward declaring type: ObjectHighlighter
  class ObjectHighlighter;
  // Forward declaring type: LaserPointer
  class LaserPointer;
  // Forward declaring type: ScrollableContent
  class ScrollableContent;
  // Forward declaring type: Teleporter
  class Teleporter;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Joint
  class Joint;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: HandStateExample
  class HandStateExample;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: Wacki
namespace Wacki {
  // Forward declaring type: ViveUILaserPointer
  class ViveUILaserPointer;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Grabber);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Grabber*, "MagicalActual", "Grabber");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x1B8
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Grabber
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD42EC
  class Grabber : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public MagicalActual.PlayerCharacter myPlayer
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerCharacter* myPlayer;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private UnityEngine.Rigidbody AELLKEKMOBG
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rigidbody* AELLKEKMOBG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE45C8
    // private UnityEngine.GameObject <NODJCBIAPIJ>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* NODJCBIAPIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 DMLIFGJBPPO
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 DMLIFGJBPPO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: DMLIFGJBPPO and: AKEBLHKHKKJ
    char __padding4[0x4] = {};
    // private UnityEngine.Joint AKEBLHKHKKJ
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Joint* AKEBLHKHKKJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Joint*) == 0x8);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.RaycastHit[] EPPIPLHANGD
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::RaycastHit> EPPIPLHANGD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private PhysicsInteractable DNJJJIADIMO
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::PhysicsInteractable* DNJJJIADIMO;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.GameObject NOGBECPGMJD
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* NOGBECPGMJD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject IFOOKACPBFJ
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* IFOOKACPBFJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single EIJBECJKGOE
    // Size: 0x4
    // Offset: 0x78
    float EIJBECJKGOE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HLGKCFLDEJA
    // Size: 0x4
    // Offset: 0x7C
    float HLGKCFLDEJA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.GameObject PGFDHLNBEJA
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* PGFDHLNBEJA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.SkinnedMeshRenderer AIECMEBGGLF
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::SkinnedMeshRenderer* AIECMEBGGLF;
    // Field size check
    static_assert(sizeof(::UnityEngine::SkinnedMeshRenderer*) == 0x8);
    // private MagicalActual.DynamicPlayerMap OOAIOOMLGHB
    // Size: 0x8
    // Offset: 0x90
    ::MagicalActual::DynamicPlayerMap* OOAIOOMLGHB;
    // Field size check
    static_assert(sizeof(::MagicalActual::DynamicPlayerMap*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE45D8
    // private OrbusTrackedController <KGFAIGMNEEO>k__BackingField
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::OrbusTrackedController* KGFAIGMNEEO;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE45E8
    // private UnityEngine.Animator <ELMDALDBDHI>k__BackingField
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Animator* ELMDALDBDHI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE45F8
    // private UnityEngine.GameObject <CENFJGLHKIG>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* CENFJGLHKIG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean HKNJOCPFNLJ
    // Size: 0x1
    // Offset: 0xB0
    bool HKNJOCPFNLJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE4608
    // private System.Boolean <JMFCFKAKKAE>k__BackingField
    // Size: 0x1
    // Offset: 0xB1
    bool JMFCFKAKKAE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean OENBJMHADOG
    // Size: 0x1
    // Offset: 0xB2
    bool OENBJMHADOG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean CDNAMHDHPMB
    // Size: 0x1
    // Offset: 0xB3
    bool CDNAMHDHPMB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CDNAMHDHPMB and: FCAHOAJICIN
    char __padding22[0x4] = {};
    // private UnityEngine.GameObject FCAHOAJICIN
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* FCAHOAJICIN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single FJGFKHPDFME
    // Size: 0x4
    // Offset: 0xC0
    float FJGFKHPDFME;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EAGOHEPMIBO
    // Size: 0x4
    // Offset: 0xC4
    float EAGOHEPMIBO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.ObjectHighlighter LEKLDADMNJL
    // Size: 0x8
    // Offset: 0xC8
    ::MagicalActual::ObjectHighlighter* LEKLDADMNJL;
    // Field size check
    static_assert(sizeof(::MagicalActual::ObjectHighlighter*) == 0x8);
    // private UnityEngine.RaycastHit EIEFDCNCGKG
    // Size: 0x2C
    // Offset: 0xD0
    ::UnityEngine::RaycastHit EIEFDCNCGKG;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.RaycastHit NCOBDMAHGHP
    // Size: 0x2C
    // Offset: 0xFC
    ::UnityEngine::RaycastHit NCOBDMAHGHP;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private PhysicsInteractable CJLHOHLDMLF
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::PhysicsInteractable* CJLHOHLDMLF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private System.Boolean LEAFBKGGCGA
    // Size: 0x1
    // Offset: 0x130
    bool LEAFBKGGCGA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IBOHKKNCLPP
    // Size: 0x1
    // Offset: 0x131
    bool IBOHKKNCLPP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IBOHKKNCLPP and: LIANHDNBHAA
    char __padding31[0x6] = {};
    // private MagicalActual.LaserPointer LIANHDNBHAA
    // Size: 0x8
    // Offset: 0x138
    ::MagicalActual::LaserPointer* LIANHDNBHAA;
    // Field size check
    static_assert(sizeof(::MagicalActual::LaserPointer*) == 0x8);
    // private System.Boolean EOCNFKLKEGP
    // Size: 0x1
    // Offset: 0x140
    bool EOCNFKLKEGP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EOCNFKLKEGP and: climbStartPosition
    char __padding33[0x3] = {};
    // public UnityEngine.Vector3 climbStartPosition
    // Size: 0xC
    // Offset: 0x144
    ::UnityEngine::Vector3 climbStartPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 LKNADBOKHDN
    // Size: 0xC
    // Offset: 0x150
    ::UnityEngine::Vector3 LKNADBOKHDN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 NLALIPPOFMM
    // Size: 0xC
    // Offset: 0x15C
    ::UnityEngine::Vector3 NLALIPPOFMM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single HCKHGIHLAJN
    // Size: 0x4
    // Offset: 0x168
    float HCKHGIHLAJN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BAGPJPCPDND
    // Size: 0x4
    // Offset: 0x16C
    float BAGPJPCPDND;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE4628
    // private Wacki.ViveUILaserPointer <IKIOMGPLICB>k__BackingField
    // Size: 0x8
    // Offset: 0x170
    ::Wacki::ViveUILaserPointer* IKIOMGPLICB;
    // Field size check
    static_assert(sizeof(::Wacki::ViveUILaserPointer*) == 0x8);
    // private System.Boolean GDMPJACINGF
    // Size: 0x1
    // Offset: 0x178
    bool GDMPJACINGF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean POIBNEFJEJO
    // Size: 0x1
    // Offset: 0x179
    bool POIBNEFJEJO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isHandHidden
    // Size: 0x1
    // Offset: 0x17A
    bool isHandHidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isHandHidden and: meshToHideWhenHandHidden
    char __padding42[0x5] = {};
    // public UnityEngine.Renderer[] meshToHideWhenHandHidden
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::UnityEngine::Renderer*> meshToHideWhenHandHidden;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Renderer*>) == 0x8);
    // public OrbusTrackedController OrbusController
    // Size: 0x8
    // Offset: 0x188
    ::GlobalNamespace::OrbusTrackedController* OrbusController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private UnityEngine.GameObject HILPMDCOFFK
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::GameObject* HILPMDCOFFK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.ScrollableContent EMBCFKPENFC
    // Size: 0x8
    // Offset: 0x198
    ::MagicalActual::ScrollableContent* EMBCFKPENFC;
    // Field size check
    static_assert(sizeof(::MagicalActual::ScrollableContent*) == 0x8);
    // private MagicalActual.Teleporter OCEICGAHAAG
    // Size: 0x8
    // Offset: 0x1A0
    ::MagicalActual::Teleporter* OCEICGAHAAG;
    // Field size check
    static_assert(sizeof(::MagicalActual::Teleporter*) == 0x8);
    // private System.Single NPLKLBJMFJB
    // Size: 0x4
    // Offset: 0x1A8
    float NPLKLBJMFJB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KKNFBMNOJII
    // Size: 0x4
    // Offset: 0x1AC
    float KKNFBMNOJII;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public HandStateExample myHandStateManager
    // Size: 0x8
    // Offset: 0x1B0
    ::GlobalNamespace::HandStateExample* myHandStateManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::HandStateExample*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.PlayerCharacter myPlayer
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerCharacter*& dyn_myPlayer();
    // Get instance field reference: private MagicalActual.PlayerAvatar EENJNFDNJBD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerAvatar*& dyn_EENJNFDNJBD();
    // Get instance field reference: private UnityEngine.Rigidbody AELLKEKMOBG
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_AELLKEKMOBG();
    // Get instance field reference: private UnityEngine.GameObject <NODJCBIAPIJ>k__BackingField
