// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: HandleMovedEvent
  class HandleMovedEvent;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: HandleController
  class HandleController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::HandleController);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::HandleController*, "MagicalActual", "HandleController");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x8D
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.HandleController
  // [TokenAttribute] Offset: FFFFFFFF
  class HandleController : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::HandleController::CooldownType
    struct CooldownType;
    // Nested type: ::MagicalActual::HandleController::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.HandleController/CooldownType
    // [TokenAttribute] Offset: FFFFFFFF
    struct CooldownType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: CooldownType
      constexpr CooldownType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.HandleController/CooldownType OHBLLENCJHB
      static constexpr const int OHBLLENCJHB = 0;
      // Get static field: static public MagicalActual.HandleController/CooldownType OHBLLENCJHB
      static ::MagicalActual::HandleController::CooldownType _get_OHBLLENCJHB();
      // Set static field: static public MagicalActual.HandleController/CooldownType OHBLLENCJHB
      static void _set_OHBLLENCJHB(::MagicalActual::HandleController::CooldownType value);
      // static field const value: static public MagicalActual.HandleController/CooldownType GAOGLAGLNFN
      static constexpr const int GAOGLAGLNFN = 1;
      // Get static field: static public MagicalActual.HandleController/CooldownType GAOGLAGLNFN
      static ::MagicalActual::HandleController::CooldownType _get_GAOGLAGLNFN();
      // Set static field: static public MagicalActual.HandleController/CooldownType GAOGLAGLNFN
      static void _set_GAOGLAGLNFN(::MagicalActual::HandleController::CooldownType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.HandleController/CooldownType
    #pragma pack(pop)
    static check_size<sizeof(HandleController::CooldownType), 0 + sizeof(int)> __MagicalActual_HandleController_CooldownTypeSizeCheck;
    static_assert(sizeof(HandleController::CooldownType) == 0x4);
    public:
    // public MagicalActual.HandleController/CooldownType cooldownType
    // Size: 0x4
    // Offset: 0x18
    ::MagicalActual::HandleController::CooldownType cooldownType;
    // Field size check
    static_assert(sizeof(::MagicalActual::HandleController::CooldownType) == 0x4);
    // public System.Single defaultCooldown
    // Size: 0x4
    // Offset: 0x1C
    float defaultCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean isPlayerInteractable
    // Size: 0x1
    // Offset: 0x20
    bool isPlayerInteractable;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPlayerInteractable and: OrbusNetComponent
    char __padding2[0x7] = {};
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.Transform handleTransform
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* handleTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform hinge
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* hinge;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single angleDistanceToTrigger
    // Size: 0x4
    // Offset: 0x48
    float angleDistanceToTrigger;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: angleDistanceToTrigger and: OnHandleTriggered
    char __padding7[0x4] = {};
    // public UnityEngine.Events.UnityEvent OnHandleTriggered
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Events::UnityEvent* OnHandleTriggered;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public MagicalActual.HandleMovedEvent OnHandleMoved
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::HandleMovedEvent* OnHandleMoved;
    // Field size check
    static_assert(sizeof(::MagicalActual::HandleMovedEvent*) == 0x8);
    // private MagicalActual.Grabber CLHMLLOPNJM
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::Grabber* CLHMLLOPNJM;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private UnityEngine.Vector3 NIMBDKNEPOK
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 NIMBDKNEPOK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single DKFENFBLLCP
    // Size: 0x4
    // Offset: 0x74
    float DKFENFBLLCP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean BBIECHILMPI
    // Size: 0x1
    // Offset: 0x78
    bool BBIECHILMPI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BBIECHILMPI and: EKCACJLABKI
    char __padding13[0x3] = {};
    // private System.Single EKCACJLABKI
    // Size: 0x4
    // Offset: 0x7C
    float EKCACJLABKI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single APIDJMHJILI
    // Size: 0x4
    // Offset: 0x80
    float APIDJMHJILI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EKIJDEHLIJB
    // Size: 0x4
    // Offset: 0x84
    float EKIJDEHLIJB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BGKLNOMANPF
    // Size: 0x4
    // Offset: 0x88
    float BGKLNOMANPF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean HKIEFJCNGOO
    // Size: 0x1
    // Offset: 0x8C
    bool HKIEFJCNGOO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.HandleController/CooldownType cooldownType
    [[deprecated("Use field access instead!")]] ::MagicalActual::HandleController::CooldownType& dyn_cooldownType();
    // Get instance field reference: public System.Single defaultCooldown
    [[deprecated("Use field access instead!")]] float& dyn_defaultCooldown();
    // Get instance field reference: public System.Boolean isPlayerInteractable
    [[deprecated("Use field access instead!")]] bool& dyn_isPlayerInteractable();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
