// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Hatcher
  class Hatcher;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Hatcher);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Hatcher*, "MagicalActual", "Hatcher");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Hatcher
  // [TokenAttribute] Offset: FFFFFFFF
  class Hatcher : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.String hatchling
    // Size: 0x8
    // Offset: 0x28
    ::StringW hatchling;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single hatchTime
    // Size: 0x4
    // Offset: 0x30
    float hatchTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hatchAnimationTime
    // Size: 0x4
    // Offset: 0x34
    float hatchAnimationTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Animator NBNKFBECLJG
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Animator* NBNKFBECLJG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.String hatchling
    [[deprecated("Use field access instead!")]] ::StringW& dyn_hatchling();
    // Get instance field reference: private System.Single hatchTime
    [[deprecated("Use field access instead!")]] float& dyn_hatchTime();
    // Get instance field reference: private System.Single hatchAnimationTime
    [[deprecated("Use field access instead!")]] float& dyn_hatchAnimationTime();
    // Get instance field reference: private UnityEngine.Animator NBNKFBECLJG
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_NBNKFBECLJG();
    // private System.Void CLNMKBPKGDN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x18872D0
    void CLNMKBPKGDN(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1887334
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KKBEOCKIBGI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x188740C
    void KKBEOCKIBGI(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void DFCOAPEIKLN()
    // Offset: 0x1887470
    void DFCOAPEIKLN();
    // public System.Void AGKHMBHBNFM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x18874C8
    void AGKHMBHBNFM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void DPFCHCEODPP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x18875A0
    void DPFCHCEODPP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KPOAAAHLGLA()
    // Offset: 0x1887678
    void KPOAAAHLGLA();
    // private System.Void GDDMNDHBECL(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x18876D0
    void GDDMNDHBECL(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void JOGPGAPOBBK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1887734
    void JOGPGAPOBBK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AKGFEENGKJD()
    // Offset: 0x188780C
    void AKGFEENGKJD();
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1887864
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AEDBMBNPNLF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x188793C
    void AEDBMBNPNLF(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void NBECKBMFDLK(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x18879A0
    void NBECKBMFDLK(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1887A04
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void OMPJCNEMJHG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1887ADC
    void OMPJCNEMJHG(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void NOLENMEIGLN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1887B40
    void NOLENMEIGLN(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1887C18
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x1887CF0
    void AHPDCIGFMJI();
    // private System.Void GJIMMCPKPMD(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1887D48
    void GJIMMCPKPMD(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GEIGDOGOODM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1887DAC
    void GEIGDOGOODM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void PLFIKFNPKDI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1887E10
    void PLFIKFNPKDI(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void BDEDGNGMHMN()
    // Offset: 0x1887E74
    void BDEDGNGMHMN();
    // public System.Void .ctor()
    // Offset: 0x1887ECC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Hatcher* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::Hatcher::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Hatcher*, creationType>()));
    }
    // private System.Void APIMIOELFAJ()
    // Offset: 0x1887F24
    void APIMIOELFAJ();
    // private System.Void CELBFCFNKAO(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1887F7C
    void CELBFCFNKAO(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void FAEOKNNLGMH(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1887FE0
    void FAEOKNNLGMH(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x1888044
    void FGIFGGNGKPK();
    // private System.Void ECHJFHBMMOM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x188809C
    void ECHJFHBMMOM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void IPIFMKAGODD()
    // Offset: 0x1888100
    void IPIFMKAGODD();
    // private System.Void FLBDFAHFMEL(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1888158
    void FLBDFAHFMEL(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void BBMOOPGEBIA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x18881BC
    void BBMOOPGEBIA(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void Start()
    // Offset: 0x1888220
    void Start();
    // public System.Void EIHONBBKDNH(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1888278
    void EIHONBBKDNH(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BFDBIONEKIA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1888350
    void BFDBIONEKIA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void JOCIAJOCGNM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x18883B4
    void JOCIAJOCGNM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x188848C
    void DGJGAFKDIDK();
    // private System.Void DKJFPDMDIAA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x18884E4
    void DKJFPDMDIAA(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void OJFAEAIKFED()
    // Offset: 0x1888548
    void OJFAEAIKFED();
    // private System.Void NBNKDMCCNJE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x18885A0
    void NBNKDMCCNJE(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void FMEPBEDDFEM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1888604
    void FMEPBEDDFEM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void EPKPFPGJCBD(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1888668
    void EPKPFPGJCBD(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void IKDGLCBOCJG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x18886CC
    void IKDGLCBOCJG(::MagicalActual::NetEntity* CMLIHJCOINC);
  }; // MagicalActual.Hatcher
  #pragma pack(pop)
  static check_size<sizeof(Hatcher), 56 + sizeof(::UnityEngine::Animator*)> __MagicalActual_HatcherSizeCheck;
  static_assert(sizeof(Hatcher) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::Hatcher::CLNMKBPKGDN
// Il2CppName: CLNMKBPKGDN
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::Hatcher::*)(::System::Collections::ArrayList*)>(&MagicalActual::Hatcher::CLNMKBPKGDN)> {
  static const MethodInfo* get() {
    static auto* HPEANAHIBAH = &::il2cpp_utils::GetClassFromName("System.Collections", "ArrayList")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::Hatcher*), "CLNMKBPKGDN", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{HPEANAHIBAH});
  }
};
// Writing MetadataGetter for method: MagicalActual::Hatcher::orbusNetInit
// Il2CppName: orbusNetInit
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::Hatcher::*)(::MagicalActual::NetEntity*)>(&MagicalActual::Hatcher::orbusNetInit)> {
