// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Grabber
  class Grabber;
  // Forward declaring type: PhysicsObject
  class PhysicsObject;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: InteractableEntity
  class InteractableEntity;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::InteractableEntity);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::InteractableEntity*, "MagicalActual", "InteractableEntity");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x71
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.InteractableEntity
  // [TokenAttribute] Offset: FFFFFFFF
  class InteractableEntity : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::InteractableEntity::$$c
    class $$c;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.GameObject interactableObject
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* interactableObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single positionResetTime
    // Size: 0x4
    // Offset: 0x30
    float positionResetTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: positionResetTime and: GFAJNDECHEH
    char __padding3[0x4] = {};
    // private UnityEngine.Rigidbody GFAJNDECHEH
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Rigidbody* GFAJNDECHEH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3550
    // private MagicalActual.Grabber <IFHNJOADBDH>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::Grabber* IFHNJOADBDH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private MagicalActual.PhysicsObject DHBKBGCCEGD
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::PhysicsObject* DHBKBGCCEGD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PhysicsObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3560
    // private PhysicsInteractable <PHKBNECCACN>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::PhysicsInteractable* PHKBNECCACN;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // public System.Boolean ignoreGripEvents
    // Size: 0x1
    // Offset: 0x58
    bool ignoreGripEvents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ignoreGripEvents and: MKOAFPEDEGF
    char __padding8[0x3] = {};
    // private System.Single MKOAFPEDEGF
    // Size: 0x4
    // Offset: 0x5C
    float MKOAFPEDEGF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MLJONPGDIPL
    // Size: 0x4
    // Offset: 0x60
    float MLJONPGDIPL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean NHHDLNNDKOB
    // Size: 0x1
    // Offset: 0x64
    bool NHHDLNNDKOB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NHHDLNNDKOB and: FOOIJBAJDIG
    char __padding11[0x3] = {};
    // private System.UInt16[] FOOIJBAJDIG
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<uint16_t> FOOIJBAJDIG;
    // Field size check
    static_assert(sizeof(::ArrayW<uint16_t>) == 0x8);
    // private System.Boolean FINEHHIFJIG
    // Size: 0x1
    // Offset: 0x70
    bool FINEHHIFJIG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.GameObject interactableObject
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_interactableObject();
    // Get instance field reference: private System.Single positionResetTime
    [[deprecated("Use field access instead!")]] float& dyn_positionResetTime();
