// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ItemContainer
  class ItemContainer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ItemContainer);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ItemContainer*, "MagicalActual", "ItemContainer");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x64
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ItemContainer
  // [TokenAttribute] Offset: FFFFFFFF
  class ItemContainer : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::ItemContainer::$$c
    class $$c;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4738
    // private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* JANFCAJMFMP;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String findByType
    // Size: 0x8
    // Offset: 0x28
    ::StringW findByType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String findById
    // Size: 0x8
    // Offset: 0x30
    ::StringW findById;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String onlyAcceptType
    // Size: 0x8
    // Offset: 0x38
    ::StringW onlyAcceptType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String onlyAcceptClass
    // Size: 0x8
    // Offset: 0x40
    ::StringW onlyAcceptClass;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // protected System.Boolean HELEHMONNAD
    // Size: 0x1
    // Offset: 0x48
    bool HELEHMONNAD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HELEHMONNAD and: PBOPBMCGMNP
    char __padding6[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE4748
    // private ExtUI.InventoryItemInstance[] <PBOPBMCGMNP>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::ExtUI::InventoryItemInstance*> PBOPBMCGMNP;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // private System.String LIKAPAKJMDJ
    // Size: 0x8
    // Offset: 0x58
    ::StringW LIKAPAKJMDJ;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4758
    // private System.Int32 <EOCNKIFGIEG>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    int EOCNKIFGIEG;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_$JANFCAJMFMP$k__BackingField();
    // Get instance field reference: public System.String findByType
    [[deprecated("Use field access instead!")]] ::StringW& dyn_findByType();
    // Get instance field reference: public System.String findById
    [[deprecated("Use field access instead!")]] ::StringW& dyn_findById();
    // Get instance field reference: public System.String onlyAcceptType
