// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PointerEventHandler
  class PointerEventHandler;
  // Forward declaring type: PointerEventArgs
  struct PointerEventArgs;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: LaserPointer
  class LaserPointer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::LaserPointer);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::LaserPointer*, "MagicalActual", "LaserPointer");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.LaserPointer
  // [TokenAttribute] Offset: FFFFFFFF
  class LaserPointer : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Boolean active
    // Size: 0x1
    // Offset: 0x18
    bool active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: active and: color
    char __padding0[0x3] = {};
    // public UnityEngine.Color color
    // Size: 0x10
    // Offset: 0x1C
    ::UnityEngine::Color color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Single thickness
    // Size: 0x4
    // Offset: 0x2C
    float thickness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Transform directionReferenceTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* directionReferenceTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject holder
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* holder;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject pointer
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* pointer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean EHJOPINNGII
    // Size: 0x1
    // Offset: 0x48
    bool EHJOPINNGII;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean addRigidBody
    // Size: 0x1
    // Offset: 0x49
    bool addRigidBody;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: addRigidBody and: LPABOOMFPOO
    char __padding7[0x6] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE4788
    // private MagicalActual.PointerEventHandler LPABOOMFPOO
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::PointerEventHandler* LPABOOMFPOO;
    // Field size check
    static_assert(sizeof(::MagicalActual::PointerEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4798
    // private MagicalActual.PointerEventHandler BCIDFKEECDD
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::PointerEventHandler* BCIDFKEECDD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PointerEventHandler*) == 0x8);
    // public System.Int32 targetLayer
    // Size: 0x4
    // Offset: 0x60
    int targetLayer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 layerMask
    // Size: 0x4
    // Offset: 0x64
    int layerMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Material ICBMBJHOBNH
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Material* ICBMBJHOBNH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material EABNLGNKMOA
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* EABNLGNKMOA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.MeshRenderer DCNNPMFFLNB
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::MeshRenderer* DCNNPMFFLNB;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.Transform previousContact
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* previousContact;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Vector3 contactPoint
    // Size: 0xC
    // Offset: 0x88
    ::UnityEngine::Vector3 contactPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single previousDistance
    // Size: 0x4
    // Offset: 0x94
    float previousDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Boolean active
    [[deprecated("Use field access instead!")]] bool& dyn_active();
    // Get instance field reference: public UnityEngine.Color color
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_color();
    // Get instance field reference: public System.Single thickness
    [[deprecated("Use field access instead!")]] float& dyn_thickness();
    // Get instance field reference: public UnityEngine.Transform directionReferenceTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_directionReferenceTransform();
    // Get instance field reference: public UnityEngine.GameObject holder
