// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPooling
#include "GlobalNamespace/IPooling.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: WorldMenu
  class WorldMenu;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Loot
  class Loot;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Loot);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Loot*, "MagicalActual", "Loot");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Loot
  // [TokenAttribute] Offset: FFFFFFFF
  class Loot : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPooling*/ {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private ExtUI.InventoryItemInstance[] LIKAPAKJMDJ
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::ExtUI::InventoryItemInstance*> LIKAPAKJMDJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // private PhysicsInteractable NENLBJKDCFP
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PhysicsInteractable* NENLBJKDCFP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.BoxCollider LHNPLONAELA
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::BoxCollider* LHNPLONAELA;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Boolean EIDDGDBKLJG
    // Size: 0x1
    // Offset: 0x40
    bool EIDDGDBKLJG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DNBJEMJMAJC
    // Size: 0x1
    // Offset: 0x41
    bool DNBJEMJMAJC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DNBJEMJMAJC and: NLLHIAJLHCO
    char __padding6[0x6] = {};
    // private MagicalActual.WorldMenu NLLHIAJLHCO
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::WorldMenu* NLLHIAJLHCO;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // public UnityEngine.GameObject bagModel
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* bagModel;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject backpackModel
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* backpackModel;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.Grabber CJFDOLCPAJO
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::Grabber* CJFDOLCPAJO;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private System.Byte FIKCNKDKIDP
    // Size: 0x1
    // Offset: 0x68
    uint8_t FIKCNKDKIDP;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: FIKCNKDKIDP and: FBGKGPFEACM
    char __padding11[0x7] = {};
    // private System.String FBGKGPFEACM
    // Size: 0x8
    // Offset: 0x70
    ::StringW FBGKGPFEACM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String ENFEGBJMHBA
    // Size: 0x8
    // Offset: 0x78
    ::StringW ENFEGBJMHBA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.GameObject UncommonGlow
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* UncommonGlow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject RareGlow
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* RareGlow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject EpicGlow
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* EpicGlow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject LegendaryGlow
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* LegendaryGlow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPooling
    operator ::GlobalNamespace::IPooling() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPooling*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private ExtUI.InventoryItemInstance[] LIKAPAKJMDJ
