// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: FishingLure
  class FishingLure;
  // Forward declaring type: GenericChest
  class GenericChest;
  // Forward declaring type: WorldMenu
  class WorldMenu;
  // Forward declaring type: ItemContainer
  class ItemContainer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: LureCraftingStation
  class LureCraftingStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::LureCraftingStation);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::LureCraftingStation*, "MagicalActual", "LureCraftingStation");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.LureCraftingStation
  // [TokenAttribute] Offset: FFFFFFFF
  class LureCraftingStation : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::LureCraftingStation::$WaitForLureToGenerate$d__25
    class $WaitForLureToGenerate$d__25;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.FishingLure DKNMADHELBI
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::FishingLure* DKNMADHELBI;
    // Field size check
    static_assert(sizeof(::MagicalActual::FishingLure*) == 0x8);
    // public UnityEngine.GameObject fishingLurePrefab
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* fishingLurePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject ingredientPrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* ingredientPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform fishingLureSlot
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* fishingLureSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject[] ingredientSlots
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::GameObject*> ingredientSlots;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public MagicalActual.GenericChest myChest
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::GenericChest* myChest;
    // Field size check
    static_assert(sizeof(::MagicalActual::GenericChest*) == 0x8);
    // private ExtUI.InventoryItemInstance[] CNCDEHCLCGP
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::ExtUI::InventoryItemInstance*> CNCDEHCLCGP;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.Vector3 IGOEOPNBIGI
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 IGOEOPNBIGI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: IGOEOPNBIGI and: LJENOPNHDFI
    char __padding10[0x4] = {};
    // private System.Collections.Generic.List`1<System.String> LJENOPNHDFI
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::StringW>* LJENOPNHDFI;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private MagicalActual.WorldMenu KNCKPELAKBH
    // Size: 0x8
    // Offset: 0x80
    ::MagicalActual::WorldMenu* KNCKPELAKBH;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // private System.Boolean BCMGLAKDLKM
    // Size: 0x1
    // Offset: 0x88
    bool BCMGLAKDLKM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BCMGLAKDLKM and: menuPoint
    char __padding13[0x7] = {};
    // public UnityEngine.GameObject menuPoint
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* menuPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.ItemContainer LNABACFKNBA
    // Size: 0x8
    // Offset: 0x98
    ::MagicalActual::ItemContainer* LNABACFKNBA;
    // Field size check
    static_assert(sizeof(::MagicalActual::ItemContainer*) == 0x8);
    // public UnityEngine.GameObject vfxCraftSuccess
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GameObject* vfxCraftSuccess;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.FishingLure DKNMADHELBI
    [[deprecated("Use field access instead!")]] ::MagicalActual::FishingLure*& dyn_DKNMADHELBI();
    // Get instance field reference: public UnityEngine.GameObject fishingLurePrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_fishingLurePrefab();
