// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_EliteGoat
  class M_EliteGoat;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_EliteGoat);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_EliteGoat*, "MagicalActual", "M_EliteGoat");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_EliteGoat
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD4570
  class M_EliteGoat : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::M_EliteGoat::$$c__DisplayClass16_0
    class $$c__DisplayClass16_0;
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxLineTrail
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxLineTrail;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject localScaler
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* localScaler;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x38
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean EAIGIJFGLHK
    // Size: 0x1
    // Offset: 0x40
    bool EAIGIJFGLHK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EAIGIJFGLHK and: KCOKPGCNCLA
    char __padding5[0x3] = {};
    // private UnityEngine.Vector3 KCOKPGCNCLA
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 KCOKPGCNCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 HMDMGGFFOGD
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 HMDMGGFFOGD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single JLJLOCMFBKA
    // Size: 0x4
    // Offset: 0x5C
    float JLJLOCMFBKA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ANPNFLJBCNI
    // Size: 0x4
    // Offset: 0x60
    float ANPNFLJBCNI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: ANPNFLJBCNI and: goat
    char __padding9[0x4] = {};
    // private UnityEngine.Transform goat
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* goat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x70
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxLineTrail
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxLineTrail();
    // Get instance field reference: public UnityEngine.GameObject localScaler
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_localScaler();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
