// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_ForestGolem
  class M_ForestGolem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_ForestGolem);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_ForestGolem*, "MagicalActual", "M_ForestGolem");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_ForestGolem
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD50C0
  class M_ForestGolem : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::M_ForestGolem::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::M_ForestGolem::$$c__DisplayClass8_0
    class $$c__DisplayClass8_0;
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxHeal
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* vfxHeal;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x30
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.GameObject CMLGFACMOLD
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* CMLGFACMOLD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public UnityEngine.GameObject vfxHeal
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxHeal();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.GameObject CMLGFACMOLD
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_CMLGFACMOLD();
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24BD724
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void IKPPCPJADAD(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BD828
    void IKPPCPJADAD(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void Start()
    // Offset: 0x24BDA58
    void Start();
    // private System.Void BLDNGKHOIID(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BDAB0
    void BLDNGKHOIID(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24BDCE0
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FEKKICOJOOF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BDDE4
    void FEKKICOJOOF(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void ILLHMMCNGOG()
    // Offset: 0x24BE014
    void ILLHMMCNGOG();
    // private System.Void DGIKKMCHFGM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BE66C
    void DGIKKMCHFGM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void PGCEBGGIDMA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BE898
    void PGCEBGGIDMA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void JFKKFKNHPFI()
    // Offset: 0x24BEAC8
    void JFKKFKNHPFI();
    // private System.Void OCALNOEEPJK(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BF114
    void OCALNOEEPJK(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void NLCJEBPPACH(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BF344
    void NLCJEBPPACH(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void FBONHOOJHBG()
    // Offset: 0x24BF574
    void FBONHOOJHBG();
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x24BF5CC
    void AHPDCIGFMJI();
    // private System.Void EOLDAJOCPHE()
    // Offset: 0x24BF624
    void EOLDAJOCPHE();
    // private System.Void MHPHFENOEHO()
    // Offset: 0x24BF698
    void MHPHFENOEHO();
    // public System.Void JFBOMHHGFDN()
    // Offset: 0x24BF70C
    void JFBOMHHGFDN();
    // private System.Void OHJOGJPPNLI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24BFD5C
    void OHJOGJPPNLI(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24BFF8C
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void .ctor()
    // Offset: 0x24C0090
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static M_ForestGolem* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::M_ForestGolem::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<M_ForestGolem*, creationType>()));
    }
    // public System.Void KIDNJNOFOFF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24C00E8
    void KIDNJNOFOFF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void PMOJCEANELA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24C01EC
    void PMOJCEANELA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void IBMKENLAMGB()
    // Offset: 0x24C041C
    void IBMKENLAMGB();
    // private System.Void NEDFCIDMJBB()
    // Offset: 0x24C0A6C
    void NEDFCIDMJBB();
    // public System.Void DIDADMBDAAK()
    // Offset: 0x24C0AC4
    void DIDADMBDAAK();
    // public System.Void JFDEDDEJJPK()
    // Offset: 0x24C1114
    void JFDEDDEJJPK();
    // private System.Void PPOALOOMAKD()
    // Offset: 0x24C1760
    void PPOALOOMAKD();
    // private System.Void NNDCJJKFOLD()
    // Offset: 0x24C17D4
    void NNDCJJKFOLD();
    // private System.Void CNPNCBFALMB()
    // Offset: 0x24C1848
    void CNPNCBFALMB();
    // public System.Void KLPLAHINIGH()
    // Offset: 0x24C18BC
    void KLPLAHINIGH();
    // public System.Void Slash()
    // Offset: 0x24C1F0C
    void Slash();
    // private System.Void DEGCMEJJNJI()
    // Offset: 0x24C254C
    void DEGCMEJJNJI();
    // private System.Void LKDBEJJKJBG()
    // Offset: 0x24C25A4
    void LKDBEJJKJBG();
    // public System.Void PKINMLEHJFB()
    // Offset: 0x24C2618
    void PKINMLEHJFB();
    // private System.Void MKBJMLMCLBP()
    // Offset: 0x24C2C68
    void MKBJMLMCLBP();
    // private System.Void GHLPBOJJHNG()
    // Offset: 0x24C2CDC
    void GHLPBOJJHNG();
    // private System.Void EHGHLOMCBAG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24C2D34
    void EHGHLOMCBAG(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void JNFEEDCNFMH(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24C2F64
    void JNFEEDCNFMH(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void AGKHMBHBNFM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24C3194
    void AGKHMBHBNFM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void OGALJHFFLHP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24C3298
    void OGALJHFFLHP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void NHADFEMILCC()
    // Offset: 0x24C339C
    void NHADFEMILCC();
    // private System.Void DDABEPJBPMN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24C33F4
    void DDABEPJBPMN(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void AFIACGLCIPB()
    // Offset: 0x24C3624
    void AFIACGLCIPB();
    // public System.Void EBKMGINMPPJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24C367C
    void EBKMGINMPPJ(::MagicalActual::NetEntity* CMLIHJCOINC);
  }; // MagicalActual.M_ForestGolem
  #pragma pack(pop)
  static check_size<sizeof(M_ForestGolem), 64 + sizeof(::UnityEngine::GameObject*)> __MagicalActual_M_ForestGolemSizeCheck;
  static_assert(sizeof(M_ForestGolem) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::M_ForestGolem::LCMLLJGPKEM
// Il2CppName: LCMLLJGPKEM
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_ForestGolem::*)(::MagicalActual::NetEntity*)>(&MagicalActual::M_ForestGolem::LCMLLJGPKEM)> {
  static const MethodInfo* get() {
    static auto* CMLIHJCOINC = &::il2cpp_utils::GetClassFromName("MagicalActual", "NetEntity")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::M_ForestGolem*), "LCMLLJGPKEM", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CMLIHJCOINC});
  }
};
// Writing MetadataGetter for method: MagicalActual::M_ForestGolem::IKPPCPJADAD
// Il2CppName: IKPPCPJADAD
template<>
