// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_LightableBrazier
  class M_LightableBrazier;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_LightableBrazier);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_LightableBrazier*, "MagicalActual", "M_LightableBrazier");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_LightableBrazier
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD46AC
  class M_LightableBrazier : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String reactsToSpell
    // Size: 0x8
    // Offset: 0x30
    ::StringW reactsToSpell;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean OKLBOLAFDEH
    // Size: 0x1
    // Offset: 0x38
    bool OKLBOLAFDEH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OKLBOLAFDEH and: vfxFire
    char __padding4[0x7] = {};
    // public UnityEngine.GameObject vfxFire
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* vfxFire;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: public System.String reactsToSpell
    [[deprecated("Use field access instead!")]] ::StringW& dyn_reactsToSpell();
    // Get instance field reference: private System.Boolean OKLBOLAFDEH
    [[deprecated("Use field access instead!")]] bool& dyn_OKLBOLAFDEH();
    // Get instance field reference: public UnityEngine.GameObject vfxFire
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxFire();
    // private System.Void LLAFBMEBMEN(System.Object OMLPNCLFFMJ)
    // Offset: 0x243725C
    void LLAFBMEBMEN(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24372FC
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void ADHCBIJICHJ()
    // Offset: 0x24372C8
    void ADHCBIJICHJ();
    // public System.Void AGKHMBHBNFM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24373B0
    void AGKHMBHBNFM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FBONHOOJHBG()
    // Offset: 0x2437464
    void FBONHOOJHBG();
    // private System.Void BECBLPDEELP(System.Object OMLPNCLFFMJ)
    // Offset: 0x24374BC
    void BECBLPDEELP(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void JMKPALEOOIM()
    // Offset: 0x243755C
    void JMKPALEOOIM();
    // public System.Void JOCIAJOCGNM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2437590
    void JOCIAJOCGNM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void Start()
    // Offset: 0x2437644
    void Start();
    // private System.Void PBEMGGBBDCK()
    // Offset: 0x243769C
    void PBEMGGBBDCK();
    // private System.Void GFKLACKEKJJ()
    // Offset: 0x24376F4
    void GFKLACKEKJJ();
    // private System.Void OKDJKOGJHMB(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437740
    void OKDJKOGJHMB(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24377E0
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EIHONBBKDNH(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2437894
    void EIHONBBKDNH(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DPIEDEJGDAB()
    // Offset: 0x2437528
    void DPIEDEJGDAB();
    // public System.Void NOLENMEIGLN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2437948
    void NOLENMEIGLN(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void IEAHKNMINMA()
    // Offset: 0x24379FC
    void IEAHKNMINMA();
    // public System.Void .ctor()
    // Offset: 0x2437A30
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static M_LightableBrazier* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::M_LightableBrazier::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<M_LightableBrazier*, creationType>()));
    }
    // public System.Void KEGEKFNLCJD(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2437A98
    void KEGEKFNLCJD(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void JFLFHMLBCBG(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437B4C
    void JFLFHMLBCBG(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void DNBNLKHIKBC()
    // Offset: 0x2437BB8
    void DNBNLKHIKBC();
    // private System.Void ICEBNGBFCLL(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437BEC
    void ICEBNGBFCLL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void MHMKOJGKHKE(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437C58
    void MHMKOJGKHKE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void NNDKJCJFIAK()
    // Offset: 0x2437CC4
    void NNDKJCJFIAK();
    // private System.Void GAOFEAPPLNN(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437D1C
    void GAOFEAPPLNN(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void DGIHGGKOAJC(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437DD4
    void DGIHGGKOAJC(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void KPOAAAHLGLA()
    // Offset: 0x2437E8C
    void KPOAAAHLGLA();
    // private System.Void LBIDGDKEGEH()
    // Offset: 0x2437E40
    void LBIDGDKEGEH();
    // private System.Void CKMDKCEDECO(System.Object OMLPNCLFFMJ)
    // Offset: 0x2437EE4
    void CKMDKCEDECO(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2437F50
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FPJBAGNKEMH()
    // Offset: 0x2438004
    void FPJBAGNKEMH();
    // private System.Void DFCOAPEIKLN()
    // Offset: 0x2438050
    void DFCOAPEIKLN();
    // private System.Void DBCODAOENIP()
    // Offset: 0x2437D88
    void DBCODAOENIP();
    // private System.Void FBNBNLALDGI(System.Object OMLPNCLFFMJ)
    // Offset: 0x24380A8
    void FBNBNLALDGI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void CBKHJDHOBFL()
    // Offset: 0x24377AC
    void CBKHJDHOBFL();
    // public System.Void NMPGLDGDDNL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2438114
    void NMPGLDGDDNL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GPCPAJPCIJJ(System.Object OMLPNCLFFMJ)
    // Offset: 0x24381C8
    void GPCPAJPCIJJ(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void AFIACGLCIPB()
    // Offset: 0x2438234
    void AFIACGLCIPB();
    // private System.Void IPIFMKAGODD()
    // Offset: 0x243828C
    void IPIFMKAGODD();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x24382E4
    void KBDGAPMJGLG();
    // private System.Void NMBFEFIPONE(System.Object OMLPNCLFFMJ)
    // Offset: 0x243833C
    void NMBFEFIPONE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x24383A8
    void LPLGKBGLPOK();
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x2438400
    void DGJGAFKDIDK();
  }; // MagicalActual.M_LightableBrazier
  #pragma pack(pop)
  static check_size<sizeof(M_LightableBrazier), 64 + sizeof(::UnityEngine::GameObject*)> __MagicalActual_M_LightableBrazierSizeCheck;
  static_assert(sizeof(M_LightableBrazier) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::M_LightableBrazier::LLAFBMEBMEN
// Il2CppName: LLAFBMEBMEN
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_LightableBrazier::*)(::Il2CppObject*)>(&MagicalActual::M_LightableBrazier::LLAFBMEBMEN)> {
  static const MethodInfo* get() {
    static auto* OMLPNCLFFMJ = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::M_LightableBrazier*), "LLAFBMEBMEN", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{OMLPNCLFFMJ});
  }
};
// Writing MetadataGetter for method: MagicalActual::M_LightableBrazier::IEDNIMMEJBL
// Il2CppName: IEDNIMMEJBL
template<>
