// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_LizardMan
  class M_LizardMan;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_LizardMan);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_LizardMan*, "MagicalActual", "M_LizardMan");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_LizardMan
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD54C8
  class M_LizardMan : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public System.Int32 typeNum
    // Size: 0x4
    // Offset: 0x20
    int typeNum;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: typeNum and: vfxSlash
    char __padding1[0x4] = {};
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x30
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public System.Int32 typeNum
    [[deprecated("Use field access instead!")]] int& dyn_typeNum();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // public System.Void HJADIOCKECN()
    // Offset: 0x243A518
    void HJADIOCKECN();
    // private System.Void HDMHEDEGDFD()
    // Offset: 0x243A73C
    void HDMHEDEGDFD();
    // public System.Void MMGEIKLBBOH()
    // Offset: 0x243A794
    void MMGEIKLBBOH();
    // public System.Void Slash()
    // Offset: 0x243A9B8
    void Slash();
    // public System.Void BIIPJEPNIBH()
    // Offset: 0x243ABD0
    void BIIPJEPNIBH();
    // private System.Void CLNMKBPKGDN(System.Object OMLPNCLFFMJ)
    // Offset: 0x243ADF4
    void CLNMKBPKGDN(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void DKJFPDMDIAA(System.Object OMLPNCLFFMJ)
    // Offset: 0x243AE90
    void DKJFPDMDIAA(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void POBHDELDOOI(System.Object OMLPNCLFFMJ)
    // Offset: 0x243AF2C
    void POBHDELDOOI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void OOIBGFECGHL(System.Object OMLPNCLFFMJ)
    // Offset: 0x243AFC8
    void OOIBGFECGHL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FLBDFAHFMEL(System.Object OMLPNCLFFMJ)
    // Offset: 0x243B064
    void FLBDFAHFMEL(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JMPBEJDKDGJ()
    // Offset: 0x243B100
    void JMPBEJDKDGJ();
    // public System.Void DKDBFFDLADP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243B324
    void DKDBFFDLADP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KKBEOCKIBGI(System.Object OMLPNCLFFMJ)
    // Offset: 0x243B3D8
    void KKBEOCKIBGI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void PKJIPANDKLL(System.Object OMLPNCLFFMJ)
    // Offset: 0x243B474
    void PKJIPANDKLL(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243B510
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void PLFIKFNPKDI(System.Object OMLPNCLFFMJ)
    // Offset: 0x243B5C4
    void PLFIKFNPKDI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void NBNKDMCCNJE(System.Object OMLPNCLFFMJ)
    // Offset: 0x243B660
    void NBNKDMCCNJE(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void .ctor()
    // Offset: 0x243B6FC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static M_LizardMan* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::M_LizardMan::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<M_LizardMan*, creationType>()));
    }
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243B754
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void EDJIILEFNPD()
    // Offset: 0x243B808
    void EDJIILEFNPD();
    // public System.Void AMBHFINDKPK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243B860
    void AMBHFINDKPK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HLGKLABMHHD()
    // Offset: 0x243B914
    void HLGKLABMHHD();
    // public System.Void IBMKENLAMGB()
    // Offset: 0x243BB38
    void IBMKENLAMGB();
    // private System.Void FBHLJMIDKDO(System.Object OMLPNCLFFMJ)
    // Offset: 0x243BD5C
    void FBHLJMIDKDO(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void HFGELBNCOLM(System.Object OMLPNCLFFMJ)
    // Offset: 0x243BDF8
    void HFGELBNCOLM(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void BJAKPGDONDJ()
    // Offset: 0x243BE94
    void BJAKPGDONDJ();
    // private System.Void OKCGDOEIOGA()
    // Offset: 0x243C0B8
    void OKCGDOEIOGA();
    // public System.Void NEMKNLGDEAK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243C110
    void NEMKNLGDEAK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KEGEKFNLCJD(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243C1C4
    void KEGEKFNLCJD(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KGKKNFEMGAM()
    // Offset: 0x243C278
    void KGKKNFEMGAM();
    // private System.Void LACFBAIDCBK()
    // Offset: 0x243C2D0
    void LACFBAIDCBK();
    // private System.Void ALNIJOPENCE(System.Object OMLPNCLFFMJ)
    // Offset: 0x243C328
    void ALNIJOPENCE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void Awake()
    // Offset: 0x243C3C4
    void Awake();
    // private System.Void FMEPBEDDFEM(System.Object OMLPNCLFFMJ)
    // Offset: 0x243C41C
    void FMEPBEDDFEM(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void CCOODLILKJD()
    // Offset: 0x243C4B8
    void CCOODLILKJD();
    // public System.Void JFBOMHHGFDN()
    // Offset: 0x243C6DC
    void JFBOMHHGFDN();
    // private System.Void JHPMDNJLGJA(System.Object OMLPNCLFFMJ)
    // Offset: 0x243C900
    void JHPMDNJLGJA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JEDKGLFGEKK()
    // Offset: 0x243C99C
    void JEDKGLFGEKK();
    // private System.Void BFDBIONEKIA(System.Object OMLPNCLFFMJ)
    // Offset: 0x243CBC0
    void BFDBIONEKIA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JFKKFKNHPFI()
    // Offset: 0x243CC5C
    void JFKKFKNHPFI();
    // public System.Void NMPGLDGDDNL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243CE80
    void NMPGLDGDDNL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EIHONBBKDNH(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243CF34
    void EIHONBBKDNH(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void ECHJFHBMMOM(System.Object OMLPNCLFFMJ)
    // Offset: 0x243CFE8
    void ECHJFHBMMOM(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void KIBDAOLFNJM()
    // Offset: 0x243D084
    void KIBDAOLFNJM();
    // public System.Void OGALJHFFLHP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x243D2A8
    void OGALJHFFLHP(::MagicalActual::NetEntity* CMLIHJCOINC);
  }; // MagicalActual.M_LizardMan
  #pragma pack(pop)
  static check_size<sizeof(M_LizardMan), 56 + sizeof(::MagicalActual::NetEntity*)> __MagicalActual_M_LizardManSizeCheck;
  static_assert(sizeof(M_LizardMan) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::M_LizardMan::HJADIOCKECN
// Il2CppName: HJADIOCKECN
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_LizardMan::*)()>(&MagicalActual::M_LizardMan::HJADIOCKECN)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::M_LizardMan*), "HJADIOCKECN", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::M_LizardMan::HDMHEDEGDFD
// Il2CppName: HDMHEDEGDFD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_LizardMan::*)()>(&MagicalActual::M_LizardMan::HDMHEDEGDFD)> {
  static const MethodInfo* get() {
