// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Monster
  class Monster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_MagicWolf
  class M_MagicWolf;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_MagicWolf);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_MagicWolf*, "MagicalActual", "M_MagicWolf");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_MagicWolf
  // [TokenAttribute] Offset: FFFFFFFF
  class M_MagicWolf : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxHeal
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* vfxHeal;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxDecurse
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* vfxDecurse;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.NetEntity GCMKMKBKGLG
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::NetEntity* GCMKMKBKGLG;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Byte IIJDGDOPMEA
    // Size: 0x1
    // Offset: 0x40
    uint8_t IIJDGDOPMEA;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: IIJDGDOPMEA and: OrbusNetComponent
    char __padding5[0x7] = {};
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x48
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxHeal
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxHeal();
    // Get instance field reference: public UnityEngine.GameObject vfxDecurse
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxDecurse();
    // Get instance field reference: private MagicalActual.NetEntity GCMKMKBKGLG
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_GCMKMKBKGLG();
    // Get instance field reference: private System.Byte IIJDGDOPMEA
    [[deprecated("Use field access instead!")]] uint8_t& dyn_IIJDGDOPMEA();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x2446A3C
    void EIIKFEMCNKM();
    // private System.Void CBONELJOGDI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2446A94
    void CBONELJOGDI(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void IECFGOIEBPA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2446C0C
    void IECFGOIEBPA(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void Start()
    // Offset: 0x2446D84
    void Start();
    // private System.Void PBEMGGBBDCK()
    // Offset: 0x2446DDC
    void PBEMGGBBDCK();
    // private System.Void FNGLOIECKDG()
    // Offset: 0x2446E34
    void FNGLOIECKDG();
    // private System.Void OACMGPBCPEL()
    // Offset: 0x2446E8C
    void OACMGPBCPEL();
    // private System.Void CBMDGNKFPIO()
    // Offset: 0x2446EE4
    void CBMDGNKFPIO();
    // private System.Void JEDLABBFELC()
    // Offset: 0x2446F3C
    void JEDLABBFELC();
    // private System.Void APECFOKOAGG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2447250
    void APECFOKOAGG(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GNLJPBIKLNL()
    // Offset: 0x24473C8
    void GNLJPBIKLNL();
    // private System.Void PBCIICOKDGM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24476DC
    void PBCIICOKDGM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void FMBPKKIEOJF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2447854
    void FMBPKKIEOJF(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void MFBFFBOCFOB(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x24479CC
    void MFBFFBOCFOB(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void CHEDOGHFDLO()
    // Offset: 0x2447B44
    void CHEDOGHFDLO();
    // private System.Void GPFBGGFPINB()
    // Offset: 0x2447E58
    void GPFBGGFPINB();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2447EB0
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void ELPKOLBFKKH(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2448000
    void ELPKOLBFKKH(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void INBJAJOECPA()
    // Offset: 0x2448178
    void INBJAJOECPA();
    // private System.Void NCCCOHHKFOJ()
    // Offset: 0x2448488
    void NCCCOHHKFOJ();
    // public System.Void .ctor()
    // Offset: 0x244879C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static M_MagicWolf* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::M_MagicWolf::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<M_MagicWolf*, creationType>()));
    }
    // public System.Void EBKMGINMPPJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24487F4
    void EBKMGINMPPJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void MDHBNHLHENF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x2448944
    void MDHBNHLHENF(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void FNMKMDHHFDG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2448AB8
    void FNMKMDHHFDG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JHPGGLDGNMG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2448C08
    void JHPGGLDGNMG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void ACHLPBFONGA()
    // Offset: 0x2448D58
    void ACHLPBFONGA();
    // private System.Void PCMGEOEBHNM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x244906C
    void PCMGEOEBHNM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x24491E4
    void LPLGKBGLPOK();
    // private System.Void IAMCPHECLNB()
    // Offset: 0x244923C
    void IAMCPHECLNB();
    // private System.Void JFKOGFKKDNB()
    // Offset: 0x244954C
    void JFKOGFKKDNB();
    // private System.Void KPJEIHMNOIC(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x244985C
    void KPJEIHMNOIC(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x24499D4
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void HealTarget()
    // Offset: 0x2449B24
    void HealTarget();
    // public System.Void KIDNJNOFOFF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2449D98
    void KIDNJNOFOFF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void NNDKJCJFIAK()
    // Offset: 0x2449EE8
    void NNDKJCJFIAK();
    // public System.Void OAMOHIMHKEK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2449F40
    void OAMOHIMHKEK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void LAOCCBHKHLO()
    // Offset: 0x244A090
    void LAOCCBHKHLO();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x244A3A4
    void KBDGAPMJGLG();
    // private System.Void IPFIFLMBJCE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x244A3FC
    void IPFIFLMBJCE(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void EPIJKOOFEOG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x244A574
    void EPIJKOOFEOG(::System::Collections::ArrayList* HPEANAHIBAH);
  }; // MagicalActual.M_MagicWolf
  #pragma pack(pop)
  static check_size<sizeof(M_MagicWolf), 72 + sizeof(::StringW)> __MagicalActual_M_MagicWolfSizeCheck;
  static_assert(sizeof(M_MagicWolf) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::M_MagicWolf::EIIKFEMCNKM
// Il2CppName: EIIKFEMCNKM
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_MagicWolf::*)()>(&MagicalActual::M_MagicWolf::EIIKFEMCNKM)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::M_MagicWolf*), "EIIKFEMCNKM", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::M_MagicWolf::CBONELJOGDI
// Il2CppName: CBONELJOGDI
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_MagicWolf::*)(::System::Collections::ArrayList*)>(&MagicalActual::M_MagicWolf::CBONELJOGDI)> {
  static const MethodInfo* get() {
