// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Catenary
  class Catenary;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_NPCBowUser
  class M_NPCBowUser;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_NPCBowUser);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_NPCBowUser*, "MagicalActual", "M_NPCBowUser");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x74
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_NPCBowUser
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD4774
  class M_NPCBowUser : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.Catenary GKAGLCILGBD
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::Catenary* GKAGLCILGBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::Catenary*) == 0x8);
    // public UnityEngine.GameObject vfxFlyingArrowPrefab
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* vfxFlyingArrowPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3[] APCMLHLDJBO
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::Vector3> APCMLHLDJBO;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Int32 DGIPABIPLIA
    // Size: 0x4
    // Offset: 0x40
    int DGIPABIPLIA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean JKLPGJKLJEK
    // Size: 0x1
    // Offset: 0x44
    bool JKLPGJKLJEK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JKLPGJKLJEK and: KDOBIPNAOGA
    char __padding6[0x3] = {};
    // private UnityEngine.GameObject KDOBIPNAOGA
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* KDOBIPNAOGA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 PPHJBPKCMBF
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 PPHJBPKCMBF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single BAGIMOCPKAP
    // Size: 0x4
    // Offset: 0x5C
    float BAGIMOCPKAP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single GAMJGJDLIFC
    // Size: 0x4
    // Offset: 0x60
    float GAMJGJDLIFC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BIHAGHDLPDE
    // Size: 0x4
    // Offset: 0x64
    float BIHAGHDLPDE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 NMOGMDHIONO
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 NMOGMDHIONO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.Catenary GKAGLCILGBD
    [[deprecated("Use field access instead!")]] ::MagicalActual::Catenary*& dyn_GKAGLCILGBD();
    // Get instance field reference: public UnityEngine.GameObject vfxFlyingArrowPrefab
