// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_RootManMini
  class M_RootManMini;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_RootManMini);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_RootManMini*, "MagicalActual", "M_RootManMini");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_RootManMini
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD5D0C
  class M_RootManMini : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x30
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean MNMNGGLAFPF
    // Size: 0x1
    // Offset: 0x38
    bool MNMNGGLAFPF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private System.Boolean MNMNGGLAFPF
    [[deprecated("Use field access instead!")]] bool& dyn_MNMNGGLAFPF();
    // private System.Void LCFONHJONFL(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FE12C
    void LCFONHJONFL(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FE1D4
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void GILLJBIMGNJ()
    // Offset: 0x25FE288
    void GILLJBIMGNJ();
    // private System.Void LLAFBMEBMEN(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FE4AC
    void LLAFBMEBMEN(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JOGPGAPOBBK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FE554
    void JOGPGAPOBBK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GHLPBOJJHNG()
    // Offset: 0x25FE608
    void GHLPBOJJHNG();
    // public System.Void BJAKPGDONDJ()
    // Offset: 0x25FE688
    void BJAKPGDONDJ();
    // public System.Void BLBKOOGJNBB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FE8AC
    void BLBKOOGJNBB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void NOLENMEIGLN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FE960
    void NOLENMEIGLN(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GCCCCNPGHAK(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FEA14
    void GCCCCNPGHAK(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void OIPLBADJHFI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FEABC
    void OIPLBADJHFI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DMDBBBHCPMG(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FEB70
    void DMDBBBHCPMG(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void HMIDAAAHFCB()
    // Offset: 0x25FEC18
    void HMIDAAAHFCB();
    // public System.Void EBKMGINMPPJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FEE3C
    void EBKMGINMPPJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void .ctor()
    // Offset: 0x25FEEF0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static M_RootManMini* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::M_RootManMini::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<M_RootManMini*, creationType>()));
    }
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FEF50
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void FNAJKCKMHHJ()
    // Offset: 0x25FF004
    void FNAJKCKMHHJ();
    // private System.Void Start()
    // Offset: 0x25FF228
    void Start();
    // private System.Void NKLOKJIOACM()
    // Offset: 0x25FF2A8
    void NKLOKJIOACM();
    // private System.Void NCCOFNKCBDB(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FF300
    void NCCOFNKCBDB(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void KLPLAHINIGH()
    // Offset: 0x25FF3A8
    void KLPLAHINIGH();
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x25FF5CC
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x25FF680
    void EPCHNEGNKNF();
    // public System.Void JMPBEJDKDGJ()
    // Offset: 0x25FF700
    void JMPBEJDKDGJ();
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x25FF924
    void AHPDCIGFMJI();
    // private System.Void BMALDPKJJPG()
    // Offset: 0x25FF9A4
    void BMALDPKJJPG();
    // public System.Void Slash()
    // Offset: 0x25FF9FC
    void Slash();
    // private System.Void ENEHGKIMBFK(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FFC14
    void ENEHGKIMBFK(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void BOABNOIDPLA(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FFCBC
    void BOABNOIDPLA(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void BHGJNBNBPBJ(System.Object OMLPNCLFFMJ)
    // Offset: 0x25FFD64
    void BHGJNBNBPBJ(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void ADLGPKAIPAA()
    // Offset: 0x25FFE0C
    void ADLGPKAIPAA();
    // public System.Void CCOODLILKJD()
    // Offset: 0x25FFE64
    void CCOODLILKJD();
    // private System.Void FNABBDIKCIE(System.Object OMLPNCLFFMJ)
    // Offset: 0x2600088
    void FNABBDIKCIE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void MIPEOCANMMO()
    // Offset: 0x2600130
    void MIPEOCANMMO();
    // private System.Void Awake()
    // Offset: 0x2600188
    void Awake();
    // public System.Void DIDADMBDAAK()
    // Offset: 0x26001E0
    void DIDADMBDAAK();
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2600404
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void JMPPPHNKAFG()
    // Offset: 0x26004B8
    void JMPPPHNKAFG();
    // private System.Void DMGLIODNKOG(System.Object OMLPNCLFFMJ)
    // Offset: 0x2600510
    void DMGLIODNKOG(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void BECBLPDEELP(System.Object OMLPNCLFFMJ)
    // Offset: 0x26005B8
    void BECBLPDEELP(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void HLGKLABMHHD()
    // Offset: 0x2600660
    void HLGKLABMHHD();
    // public System.Void KEGEKFNLCJD(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x2600884
    void KEGEKFNLCJD(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GAOFEAPPLNN(System.Object OMLPNCLFFMJ)
    // Offset: 0x2600938
    void GAOFEAPPLNN(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void MENDPLCEJOP(System.Object OMLPNCLFFMJ)
    // Offset: 0x26009E0
    void MENDPLCEJOP(::Il2CppObject* OMLPNCLFFMJ);
  }; // MagicalActual.M_RootManMini
  #pragma pack(pop)
  static check_size<sizeof(M_RootManMini), 56 + sizeof(bool)> __MagicalActual_M_RootManMiniSizeCheck;
  static_assert(sizeof(M_RootManMini) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::M_RootManMini::LCFONHJONFL
// Il2CppName: LCFONHJONFL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_RootManMini::*)(::Il2CppObject*)>(&MagicalActual::M_RootManMini::LCFONHJONFL)> {
  static const MethodInfo* get() {
    static auto* OMLPNCLFFMJ = &::il2cpp_utils::GetClassFromName("System", "Object")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::M_RootManMini*), "LCFONHJONFL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{OMLPNCLFFMJ});
  }
};
// Writing MetadataGetter for method: MagicalActual::M_RootManMini::orbusNetInit
// Il2CppName: orbusNetInit
template<>
