// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: M_Wyvern
  class M_Wyvern;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::M_Wyvern);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::M_Wyvern*, "MagicalActual", "M_Wyvern");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.M_Wyvern
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD7798
  class M_Wyvern : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxBreath
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* vfxBreath;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxPoison
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* vfxPoison;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x38
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public UnityEngine.GameObject vfxBreath
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxBreath();
    // Get instance field reference: public UnityEngine.GameObject vfxPoison
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxPoison();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // public System.Void PBHPHJAACCF()
    // Offset: 0x13E5F8C
    void PBHPHJAACCF();
    // public System.Void KJPEMIOCNMK()
    // Offset: 0x13E606C
    void KJPEMIOCNMK();
    // public System.Void DDAHJCDGIEC()
    // Offset: 0x13E6158
    void DDAHJCDGIEC();
    // public System.Void .ctor()
    // Offset: 0x13E6244
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static M_Wyvern* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::M_Wyvern::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<M_Wyvern*, creationType>()));
    }
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x13E629C
    void KBDGAPMJGLG();
    // public System.Void KIAENCCMIBD()
    // Offset: 0x13E62F4
    void KIAENCCMIBD();
    // public System.Void Slash()
    // Offset: 0x13E63E0
    void Slash();
    // public System.Void NMMEMGBBPJF()
    // Offset: 0x13E65F8
    void NMMEMGBBPJF();
    // public System.Void HJADIOCKECN()
    // Offset: 0x13E662C
    void HJADIOCKECN();
    // public System.Void MDFCKOAALED()
    // Offset: 0x13E6850
    void MDFCKOAALED();
    // public System.Void NCENCBAKLEA()
    // Offset: 0x13E6930
    void NCENCBAKLEA();
    // public System.Void NGIBPNEKLEK()
    // Offset: 0x13E6A10
    void NGIBPNEKLEK();
    // public System.Void HLAHAIBPLMO()
    // Offset: 0x13E6AF0
    void HLAHAIBPLMO();
    // public System.Void JCNOPBIDKNO()
    // Offset: 0x13E6B24
    void JCNOPBIDKNO();
    // public System.Void FMFOGAKFJGJ()
    // Offset: 0x13E6B58
    void FMFOGAKFJGJ();
    // public System.Void OFIEBLCNJKE()
    // Offset: 0x13E6D7C
    void OFIEBLCNJKE();
    // public System.Void FinishBreath()
    // Offset: 0x13E6E5C
    void FinishBreath();
    // public System.Void KIBDAOLFNJM()
    // Offset: 0x13E6F48
    void KIBDAOLFNJM();
    // public System.Void JHBABBEJDLJ()
    // Offset: 0x13E716C
    void JHBABBEJDLJ();
    // public System.Void PONOHNKNKDK()
    // Offset: 0x13E7258
    void PONOHNKNKDK();
    // public System.Void BIIPJEPNIBH()
    // Offset: 0x13E7338
    void BIIPJEPNIBH();
    // public System.Void MMEDHCAOIIF()
    // Offset: 0x13E755C
    void MMEDHCAOIIF();
    // public System.Void GLBNDKOELFK()
    // Offset: 0x13E7590
    void GLBNDKOELFK();
    // public System.Void PBAFPJHBDNN()
    // Offset: 0x13E767C
    void PBAFPJHBDNN();
    // public System.Void FCAPIDKMHBM()
    // Offset: 0x13E76B0
    void FCAPIDKMHBM();
    // private System.Void APIMIOELFAJ()
    // Offset: 0x13E76E4
    void APIMIOELFAJ();
    // public System.Void ELMPELMJFMC()
    // Offset: 0x13E773C
    void ELMPELMJFMC();
    // public System.Void NHHIIEHJCFA()
    // Offset: 0x13E7770
    void NHHIIEHJCFA();
    // public System.Void OCKGBDEFIDI()
    // Offset: 0x13E7994
    void OCKGBDEFIDI();
    // public System.Void BreathStart()
    // Offset: 0x13E79C8
    void BreathStart();
    // public System.Void PEFHGEOBLEI()
    // Offset: 0x13E79FC
    void PEFHGEOBLEI();
    // private System.Void CBMDGNKFPIO()
    // Offset: 0x13E7A30
    void CBMDGNKFPIO();
    // public System.Void PoisonStart()
    // Offset: 0x13E7A88
    void PoisonStart();
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x13E7ABC
    void AHPDCIGFMJI();
    // public System.Void GILLJBIMGNJ()
    // Offset: 0x13E7B14
    void GILLJBIMGNJ();
    // public System.Void KJDOLIEDHJP()
    // Offset: 0x13E7D38
    void KJDOLIEDHJP();
    // public System.Void PoisonStop()
    // Offset: 0x13E7E24
    void PoisonStop();
    // public System.Void EDNINKGGELH()
    // Offset: 0x13E7E58
    void EDNINKGGELH();
    // public System.Void ADGJMNNMLJG()
    // Offset: 0x13E7F38
    void ADGJMNNMLJG();
    // public System.Void BreathStop()
    // Offset: 0x13E7F6C
    void BreathStop();
    // public System.Void LKCOMMKDIBJ()
    // Offset: 0x13E8048
    void LKCOMMKDIBJ();
    // public System.Void JAJCKGBGFFI()
    // Offset: 0x13E807C
    void JAJCKGBGFFI();
    // private System.Void Start()
    // Offset: 0x13E80B0
    void Start();
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x13E8108
    void FGIFGGNGKPK();
    // public System.Void MKAECMFKIEN()
    // Offset: 0x13E8160
    void MKAECMFKIEN();
    // private System.Void AFIACGLCIPB()
    // Offset: 0x13E8384
    void AFIACGLCIPB();
    // public System.Void ECDMAAAMPCD()
    // Offset: 0x13E83DC
    void ECDMAAAMPCD();
    // public System.Void JADMIPCIHHF()
    // Offset: 0x13E8410
    void JADMIPCIHHF();
  }; // MagicalActual.M_Wyvern
  #pragma pack(pop)
  static check_size<sizeof(M_Wyvern), 56 + sizeof(::StringW)> __MagicalActual_M_WyvernSizeCheck;
  static_assert(sizeof(M_Wyvern) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::M_Wyvern::PBHPHJAACCF
// Il2CppName: PBHPHJAACCF
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_Wyvern::*)()>(&MagicalActual::M_Wyvern::PBHPHJAACCF)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::M_Wyvern*), "PBHPHJAACCF", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::M_Wyvern::KJPEMIOCNMK
// Il2CppName: KJPEMIOCNMK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::M_Wyvern::*)()>(&MagicalActual::M_Wyvern::KJPEMIOCNMK)> {
  static const MethodInfo* get() {
