// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Monster
  class Monster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: MedusaBoss
  class MedusaBoss;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::MedusaBoss);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::MedusaBoss*, "MagicalActual", "MedusaBoss");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.MedusaBoss
  // [TokenAttribute] Offset: FFFFFFFF
  class MedusaBoss : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::MedusaBoss::$ScaleChargeEffect$d__9
    class $ScaleChargeEffect$d__9;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private UnityEngine.ParticleSystem chargeEffect
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::ParticleSystem* chargeEffect;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.ParticleSystem glareEffect
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::ParticleSystem* glareEffect;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.AudioSource chargeSound
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioSource* chargeSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource glareSound
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioSource* glareSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private UnityEngine.ParticleSystem chargeEffect
    [[deprecated("Use field access instead!")]] ::UnityEngine::ParticleSystem*& dyn_chargeEffect();
    // Get instance field reference: private UnityEngine.ParticleSystem glareEffect
    [[deprecated("Use field access instead!")]] ::UnityEngine::ParticleSystem*& dyn_glareEffect();
    // Get instance field reference: private UnityEngine.AudioSource chargeSound
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_chargeSound();
    // Get instance field reference: private UnityEngine.AudioSource glareSound
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_glareSound();
    // public System.Void OPNDMJMONNL()
    // Offset: 0x13E9BD4
    void OPNDMJMONNL();
    // private System.Void LHBPCEDIDBB(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13E9BD8
    void LHBPCEDIDBB(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void LBIKOKCCILF()
    // Offset: 0x13E9C60
    void LBIKOKCCILF();
    // public System.Void .ctor()
    // Offset: 0x13E9CB8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MedusaBoss* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::MedusaBoss::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MedusaBoss*, creationType>()));
    }
    // private System.Collections.IEnumerator DHKIJMIFCLC(System.Single MIMKAJAIHFB)
    // Offset: 0x13E9D10
    ::System::Collections::IEnumerator* DHKIJMIFCLC(float MIMKAJAIHFB);
    // public System.Void Shoot()
    // Offset: 0x13E9DD4
    void Shoot();
    // private System.Void EJPBJNNMKNN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13E9DD8
    void EJPBJNNMKNN(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Collections.IEnumerator PDDHCDDHEEG(System.Single MIMKAJAIHFB)
    // Offset: 0x13E9E60
    ::System::Collections::IEnumerator* PDDHCDDHEEG(float MIMKAJAIHFB);
    // private System.Void CKGJLBNDDMK(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13E9EF8
    void CKGJLBNDDMK(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void IDOCJGNLNFL()
    // Offset: 0x13E9F80
    void IDOCJGNLNFL();
    // public System.Void CKLMMKLOEFA()
    // Offset: 0x13E9FD8
    void CKLMMKLOEFA();
    // private System.Void KFKMNAAOFFH(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13E9FDC
    void KFKMNAAOFFH(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Collections.IEnumerator HDIEIFAGMAJ(System.Single MIMKAJAIHFB)
    // Offset: 0x13EA168
    ::System::Collections::IEnumerator* HDIEIFAGMAJ(float MIMKAJAIHFB);
    // private System.Void OMNFJALHMCM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EA204
    void OMNFJALHMCM(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Collections.IEnumerator DCDEFDMCLNF(System.Single MIMKAJAIHFB)
    // Offset: 0x13EA28C
    ::System::Collections::IEnumerator* DCDEFDMCLNF(float MIMKAJAIHFB);
    // private System.Void NFEJEIAPMFL(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EA328
    void NFEJEIAPMFL(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void AFIACGLCIPB()
    // Offset: 0x13EA3B0
    void AFIACGLCIPB();
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13EA408
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BNFOMMDPLGC(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EA580
    void BNFOMMDPLGC(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void HAOCADCIOAD(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EA608
    void HAOCADCIOAD(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void DMGLIODNKOG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EA690
    void DMGLIODNKOG(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void OJOELPJLJFN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EA784
    void OJOELPJLJFN(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13EA80C
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x13EA984
    void FGIFGGNGKPK();
    // public System.Void JHPGGLDGNMG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13EA9DC
    void JHPGGLDGNMG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void JNHNEBOHOIB()
    // Offset: 0x13EAB54
    void JNHNEBOHOIB();
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13EABAC
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Collections.IEnumerator HPMKCJPFPBB(System.Single MIMKAJAIHFB)
    // Offset: 0x13EAD24
    ::System::Collections::IEnumerator* HPMKCJPFPBB(float MIMKAJAIHFB);
    // private System.Void AKJPGGNFNJE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EADBC
    void AKJPGGNFNJE(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Collections.IEnumerator ODKFCJFCEJA(System.Single MIMKAJAIHFB)
    // Offset: 0x13EAE44
    ::System::Collections::IEnumerator* ODKFCJFCEJA(float MIMKAJAIHFB);
    // public System.Void OGALJHFFLHP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13EAEDC
    void OGALJHFFLHP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void PBEMGGBBDCK()
    // Offset: 0x13EB054
    void PBEMGGBBDCK();
    // private System.Void Start()
    // Offset: 0x13EB0AC
    void Start();
    // private System.Collections.IEnumerator MMAFOBHHCJG(System.Single MIMKAJAIHFB)
    // Offset: 0x13EA0D0
    ::System::Collections::IEnumerator* MMAFOBHHCJG(float MIMKAJAIHFB);
    // private System.Void AMIGPBKBDCG(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EB104
    void AMIGPBKBDCG(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GPCPAJPCIJJ(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EB18C
    void GPCPAJPCIJJ(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void GENFHKNJHNF()
    // Offset: 0x13EB280
    void GENFHKNJHNF();
    // private System.Void GHLPBOJJHNG()
    // Offset: 0x13EB284
    void GHLPBOJJHNG();
    // private System.Collections.IEnumerator GBNJDNHMEIG(System.Single MIMKAJAIHFB)
    // Offset: 0x13EB2DC
    ::System::Collections::IEnumerator* GBNJDNHMEIG(float MIMKAJAIHFB);
    // private System.Void JPGPNKPFJOC(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EB374
    void JPGPNKPFJOC(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GAOFEAPPLNN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EB3FC
    void GAOFEAPPLNN(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void LNMMKFLJLKJ(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13EB4EC
    void LNMMKFLJLKJ(::System::Collections::ArrayList* HPEANAHIBAH);
  }; // MagicalActual.MedusaBoss
  #pragma pack(pop)
  static check_size<sizeof(MedusaBoss), 72 + sizeof(::UnityEngine::AudioSource*)> __MagicalActual_MedusaBossSizeCheck;
  static_assert(sizeof(MedusaBoss) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::MedusaBoss::OPNDMJMONNL
// Il2CppName: OPNDMJMONNL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::MedusaBoss::*)()>(&MagicalActual::MedusaBoss::OPNDMJMONNL)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::MedusaBoss*), "OPNDMJMONNL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::MedusaBoss::LHBPCEDIDBB
// Il2CppName: LHBPCEDIDBB
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::MedusaBoss::*)(::System::Collections::ArrayList*)>(&MagicalActual::MedusaBoss::LHBPCEDIDBB)> {
  static const MethodInfo* get() {
