// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: MomentaryDanger
  class MomentaryDanger;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::MomentaryDanger);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::MomentaryDanger*, "MagicalActual", "MomentaryDanger");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x48
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.MomentaryDanger
  // [TokenAttribute] Offset: FFFFFFFF
  class MomentaryDanger : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.GameObject IKANFIAFBKH
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* IKANFIAFBKH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GIKDCEOHCGA
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* GIKDCEOHCGA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject missileTrackDown
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* missileTrackDown;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject endExplosion
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* endExplosion;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private UnityEngine.GameObject IKANFIAFBKH
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_IKANFIAFBKH();
    // Get instance field reference: private UnityEngine.GameObject GIKDCEOHCGA
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_GIKDCEOHCGA();
    // Get instance field reference: public UnityEngine.GameObject missileTrackDown
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_missileTrackDown();
    // Get instance field reference: public UnityEngine.GameObject endExplosion
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_endExplosion();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // private System.Void MGIGOOFELCH(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13F5070
    void MGIGOOFELCH(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void EBJDLAIJJJE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F5448
    void EBJDLAIJJJE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BDDEJINMNFP()
    // Offset: 0x13F55BC
    void BDDEJINMNFP();
    // private System.Void NEBLIMKHLJA()
    // Offset: 0x13F56EC
    void NEBLIMKHLJA();
    // public System.Void showSphereTelegraph(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F581C
    void showSphereTelegraph(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // private System.Void JAFGOEJPIII()
    // Offset: 0x13F598C
    void JAFGOEJPIII();
    // private System.Void CFNANLEAMNN()
    // Offset: 0x13F5ABC
    void CFNANLEAMNN();
    // public System.Void OIPLBADJHFI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F5BEC
    void OIPLBADJHFI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void AGPLHFNOACP(UnityEngine.Vector3 INGBFFBEGJC, UnityEngine.Vector3 HIJNLFBCAOK, System.Single COFEDKKLNEI)
    // Offset: 0x13F5D60
    void AGPLHFNOACP(::UnityEngine::Vector3 INGBFFBEGJC, ::UnityEngine::Vector3 HIJNLFBCAOK, float COFEDKKLNEI);
    // private System.Void NPIMENJLIJE()
    // Offset: 0x13F5EAC
    void NPIMENJLIJE();
    // public System.Void PJCLELBFGOD(UnityEngine.Vector3 INGBFFBEGJC, UnityEngine.Vector3 HIJNLFBCAOK, System.Single COFEDKKLNEI)
    // Offset: 0x13F52FC
    void PJCLELBFGOD(::UnityEngine::Vector3 INGBFFBEGJC, ::UnityEngine::Vector3 HIJNLFBCAOK, float COFEDKKLNEI);
    // public System.Void HLINCONMMME(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F5FDC
    void HLINCONMMME(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F6164
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void INNHDAAHFIO()
    // Offset: 0x13F62D8
    void INNHDAAHFIO();
    // private System.Void DGIKKMCHFGM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13F6408
    void DGIKKMCHFGM(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void PCBHGDLPPLC(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F67DC
    void PCBHGDLPPLC(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // public System.Void .ctor()
    // Offset: 0x13F6964
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static MomentaryDanger* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::MomentaryDanger::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<MomentaryDanger*, creationType>()));
    }
    // public System.Void KMPPLBBIMGJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F69BC
    void KMPPLBBIMGJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DPJJHPHGGGB(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13F6B30
    void DPJJHPHGGGB(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void AMBHFINDKPK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F6DBC
    void AMBHFINDKPK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void OCCKPNICOAF()
    // Offset: 0x13F6F30
    void OCCKPNICOAF();
    // private System.Void PFABJJGAOMM()
    // Offset: 0x13F7060
    void PFABJJGAOMM();
    // private System.Void OIIBEHMPIHH()
    // Offset: 0x13F7194
    void OIIBEHMPIHH();
    // public System.Void showTelegraph(UnityEngine.Vector3 INGBFFBEGJC, UnityEngine.Vector3 HIJNLFBCAOK, System.Single COFEDKKLNEI)
    // Offset: 0x13F6690
    void showTelegraph(::UnityEngine::Vector3 INGBFFBEGJC, ::UnityEngine::Vector3 HIJNLFBCAOK, float COFEDKKLNEI);
    // public System.Void EBCAOCHGDCC(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F72C4
    void EBCAOCHGDCC(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F7444
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EGAFILBLCOP(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F75B8
    void EGAFILBLCOP(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // private System.Void Start()
    // Offset: 0x13F7740
    void Start();
    // private System.Void OACMGPBCPEL()
    // Offset: 0x13F7874
    void OACMGPBCPEL();
    // public System.Void HONOKCGNDEF(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F79A8
    void HONOKCGNDEF(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // private System.Void LBIKOKCCILF()
    // Offset: 0x13F7B30
    void LBIKOKCCILF();
    // private System.Void NHADFEMILCC()
    // Offset: 0x13F7C64
    void NHADFEMILCC();
    // private System.Void PGCEBGGIDMA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13F7D98
    void PGCEBGGIDMA(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void OECDNIMAEHE()
    // Offset: 0x13F8024
    void OECDNIMAEHE();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F8154
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void PMOJCEANELA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x13F82C8
    void PMOJCEANELA(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void JOGPGAPOBBK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x13F8554
    void JOGPGAPOBBK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void HPIMMEHNPJM()
    // Offset: 0x13F86C8
    void HPIMMEHNPJM();
    // public System.Void MPNFHIBEOGE(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F87F8
    void MPNFHIBEOGE(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
    // public System.Void PJCFMKOMBNK(UnityEngine.Vector3 INGBFFBEGJC, System.Single GEBMCFKLLOB, System.Single COFEDKKLNEI)
    // Offset: 0x13F8980
    void PJCFMKOMBNK(::UnityEngine::Vector3 INGBFFBEGJC, float GEBMCFKLLOB, float COFEDKKLNEI);
  }; // MagicalActual.MomentaryDanger
  #pragma pack(pop)
  static check_size<sizeof(MomentaryDanger), 64 + sizeof(::MagicalActual::NetEntity*)> __MagicalActual_MomentaryDangerSizeCheck;
  static_assert(sizeof(MomentaryDanger) == 0x48);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::MomentaryDanger::MGIGOOFELCH
// Il2CppName: MGIGOOFELCH
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::MomentaryDanger::*)(::System::Collections::ArrayList*)>(&MagicalActual::MomentaryDanger::MGIGOOFELCH)> {
  static const MethodInfo* get() {
    static auto* HPEANAHIBAH = &::il2cpp_utils::GetClassFromName("System.Collections", "ArrayList")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::MomentaryDanger*), "MGIGOOFELCH", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{HPEANAHIBAH});
  }
};
// Writing MetadataGetter for method: MagicalActual::MomentaryDanger::EBJDLAIJJJE
// Il2CppName: EBJDLAIJJJE
template<>
