// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPooling
#include "GlobalNamespace/IPooling.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbusHealthBar
  class OrbusHealthBar;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: StatusEffect
  class StatusEffect;
  // Forward declaring type: HealthChangedEvent
  class HealthChangedEvent;
  // Forward declaring type: ObjectHighlighter
  class ObjectHighlighter;
  // Forward declaring type: WarriorCollisionBox
  class WarriorCollisionBox;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ProgressBarPro
  class ProgressBarPro;
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: QuickProjectileManager
  class QuickProjectileManager;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Monster);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Monster*, "MagicalActual", "Monster");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x142
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Monster
  // [TokenAttribute] Offset: FFFFFFFF
  class Monster : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPooling*/ {
    public:
    // Nested type: ::MagicalActual::Monster::$Shrink$d__92
    class $Shrink$d__92;
    // Nested type: ::MagicalActual::Monster::$$c__DisplayClass93_0
    class $$c__DisplayClass93_0;
    public:
    // public MagicalActual.OrbusHealthBar healthBar
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::OrbusHealthBar* healthBar;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusHealthBar*) == 0x8);
    // public UnityEngine.Animator animator
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Animator* animator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4818
    // private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* JANFCAJMFMP;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.Int32 hitPointsReadOnly
    // Size: 0x4
    // Offset: 0x38
    int hitPointsReadOnly;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean isDead
    // Size: 0x1
    // Offset: 0x3C
    bool isDead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isMyPlayer
    // Size: 0x1
    // Offset: 0x3D
    bool isMyPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isMyPlayer and: sfxNames
    char __padding6[0x2] = {};
    // public System.Collections.Generic.List`1<System.String> sfxNames
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::StringW>* sfxNames;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public UnityEngine.AudioClip[] sfxFiles
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::AudioClip*> sfxFiles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // private UnityEngine.AudioSource FPMFLCCJLMB
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AudioSource* FPMFLCCJLMB;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> vfxNames
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::StringW>* vfxNames;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public UnityEngine.GameObject[] vfxObjs
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::UnityEngine::GameObject*> vfxObjs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector4> elementalResistances
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::UnityEngine::Vector4>* elementalResistances;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector4>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.Single,MagicalActual.StatusEffect> statusEffects
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::Dictionary_2<float, ::MagicalActual::StatusEffect*>* statusEffects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<float, ::MagicalActual::StatusEffect*>*) == 0x8);
    // public MagicalActual.NetEntity currentTrackingTargetEntity
    // Size: 0x8
    // Offset: 0x78
    ::MagicalActual::NetEntity* currentTrackingTargetEntity;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.Transform currentTrackingTargetAvatarTransform
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* currentTrackingTargetAvatarTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public MagicalActual.HealthChangedEvent onHealthChanged
    // Size: 0x8
    // Offset: 0x88
    ::MagicalActual::HealthChangedEvent* onHealthChanged;
    // Field size check
    static_assert(sizeof(::MagicalActual::HealthChangedEvent*) == 0x8);
    // private UnityEngine.GameObject IKANFIAFBKH
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* IKANFIAFBKH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GIKDCEOHCGA
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* GIKDCEOHCGA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private ProgressBarPro ODFMDJNIKNJ
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::ProgressBarPro* ODFMDJNIKNJ;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // private SuperTextMesh BDKCLFBECPK
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::SuperTextMesh* BDKCLFBECPK;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private ProgressBarPro MEKBPGKBGCF
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::ProgressBarPro* MEKBPGKBGCF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // private UnityEngine.GameObject BIOMGAOEFGP
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* BIOMGAOEFGP;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject CFLHBNBNAMB
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* CFLHBNBNAMB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single CNAPHEPCBBF
    // Size: 0x4
    // Offset: 0xC8
    float CNAPHEPCBBF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KNJJJMBDGLM
    // Size: 0x4
    // Offset: 0xCC
    float KNJJJMBDGLM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean OJMMNOELIGK
    // Size: 0x1
    // Offset: 0xD0
    bool OJMMNOELIGK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasNavAgent
    // Size: 0x1
    // Offset: 0xD1
    bool hasNavAgent;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasNavAgent and: overrideHitPoints
    char __padding27[0x2] = {};
    // public System.Int32 overrideHitPoints
    // Size: 0x4
    // Offset: 0xD4
    int overrideHitPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean isElite
    // Size: 0x1
    // Offset: 0xD8
    bool isElite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isBoss
    // Size: 0x1
    // Offset: 0xD9
    bool isBoss;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isPlayer
    // Size: 0x1
    // Offset: 0xDA
    bool isPlayer;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isPlayer and: monsterTypes
    char __padding31[0x5] = {};
    // public System.String monsterTypes
    // Size: 0x8
    // Offset: 0xE0
    ::StringW monsterTypes;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean dontAllowSwordRush
    // Size: 0x1
    // Offset: 0xE8
    bool dontAllowSwordRush;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean cowerInCombat
    // Size: 0x1
    // Offset: 0xE9
    bool cowerInCombat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cowerInCombat and: quickProjectileManager
    char __padding34[0x6] = {};
    // public QuickProjectileManager quickProjectileManager
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::QuickProjectileManager* quickProjectileManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::QuickProjectileManager*) == 0x8);
    // private System.Single OHJDNHHIFHK
    // Size: 0x4
    // Offset: 0xF8
    float OHJDNHHIFHK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ADBBAIDJACG
    // Size: 0x4
    // Offset: 0xFC
    float ADBBAIDJACG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.ObjectHighlighter MCBDFEDENMG
    // Size: 0x8
    // Offset: 0x100
    ::MagicalActual::ObjectHighlighter* MCBDFEDENMG;
    // Field size check
    static_assert(sizeof(::MagicalActual::ObjectHighlighter*) == 0x8);
    // private System.Byte JPDILBEOHAL
    // Size: 0x1
    // Offset: 0x108
    uint8_t JPDILBEOHAL;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: JPDILBEOHAL and: OKOHIIPBADD
    char __padding39[0x7] = {};
    // private MagicalActual.WarriorCollisionBox OKOHIIPBADD
    // Size: 0x8
    // Offset: 0x110
    ::MagicalActual::WarriorCollisionBox* OKOHIIPBADD;
    // Field size check
    static_assert(sizeof(::MagicalActual::WarriorCollisionBox*) == 0x8);
    // public System.Int32 hitPoints
    // Size: 0x4
    // Offset: 0x118
    int hitPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 maxHitPoints
    // Size: 0x4
    // Offset: 0x11C
    int maxHitPoints;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single NIANOECADMH
    // Size: 0x4
    // Offset: 0x120
    float NIANOECADMH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.UInt16 currentTrackingTargetGuid
    // Size: 0x2
    // Offset: 0x124
    uint16_t currentTrackingTargetGuid;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: currentTrackingTargetGuid and: willLevel
    char __padding44[0x2] = {};
    // public System.Int32 willLevel
    // Size: 0x4
    // Offset: 0x128
    int willLevel;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean inCombat
    // Size: 0x1
    // Offset: 0x12C
    bool inCombat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inCombat and: monsterName
    char __padding46[0x3] = {};
    // public System.String monsterName
    // Size: 0x8
    // Offset: 0x130
    ::StringW monsterName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String monsterType
    // Size: 0x8
    // Offset: 0x138
    ::StringW monsterType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4918
    // private System.Boolean <NENDEFCJJIG>k__BackingField
    // Size: 0x1
    // Offset: 0x140
    bool NENDEFCJJIG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isBlocking
    // Size: 0x1
    // Offset: 0x141
    bool isBlocking;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPooling
    operator ::GlobalNamespace::IPooling() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPooling*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.OrbusHealthBar healthBar
    [[deprecated("Use field access instead!")]] ::MagicalActual::OrbusHealthBar*& dyn_healthBar();
    // Get instance field reference: public UnityEngine.Animator animator
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_animator();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
