// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: ComponentListener
  class ComponentListener;
  // Forward declaring type: NetSyncListener
  class NetSyncListener;
  // Forward declaring type: OrbusNetManager
  class OrbusNetManager;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
  // Forward declaring type: BinaryReader
  class BinaryReader;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::NetEntity);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::NetEntity*, "MagicalActual", "NetEntity");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xC9
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.NetEntity
  // [TokenAttribute] Offset: FFFFFFFF
  class NetEntity : public ::Il2CppObject {
    public:
    // Nested type: ::MagicalActual::NetEntity::$$c__DisplayClass29_0
    class $$c__DisplayClass29_0;
    // Nested type: ::MagicalActual::NetEntity::$$c__DisplayClass29_1
    class $$c__DisplayClass29_1;
    // Nested type: ::MagicalActual::NetEntity::$$c__DisplayClass33_0
    class $$c__DisplayClass33_0;
    // Nested type: ::MagicalActual::NetEntity::$$c__DisplayClass35_0
    class $$c__DisplayClass35_0;
    public:
    // public System.UInt16 JGFIJDCMHDB
    // Size: 0x2
    // Offset: 0x10
    uint16_t JGFIJDCMHDB;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: JGFIJDCMHDB and: BOHGAPNLIPA
    char __padding0[0x6] = {};
    // public UnityEngine.GameObject BOHGAPNLIPA
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* BOHGAPNLIPA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.Monster LMKAEKNPBAG
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::Monster* LMKAEKNPBAG;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public System.Boolean NKLEBGJJFME
    // Size: 0x1
    // Offset: 0x28
    bool NKLEBGJJFME;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean OMBJCGOPKNN
    // Size: 0x1
    // Offset: 0x29
    bool OMBJCGOPKNN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OMBJCGOPKNN and: OMBHDEFLBEE
    char __padding4[0x2] = {};
    // protected UnityEngine.Vector3 OMBHDEFLBEE
    // Size: 0xC
    // Offset: 0x2C
    ::UnityEngine::Vector3 OMBHDEFLBEE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Vector3 HJAJPOEGCJK
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 HJAJPOEGCJK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 JCHJPCLHMAH
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 JCHJPCLHMAH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 LKDOCJLPLKG
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 LKDOCJLPLKG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected UnityEngine.Quaternion NOFFCFFNFEK
    // Size: 0x10
    // Offset: 0x5C
    ::UnityEngine::Quaternion NOFFCFFNFEK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // protected UnityEngine.Quaternion NMKNHDJPJIF
    // Size: 0x10
    // Offset: 0x6C
    ::UnityEngine::Quaternion NMKNHDJPJIF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // protected System.Single ICMHFDCBDPJ
    // Size: 0x4
    // Offset: 0x7C
    float ICMHFDCBDPJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FNCJBACJEID
    // Size: 0x4
    // Offset: 0x80
    float FNCJBACJEID;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean IFJAMMDKCCM
    // Size: 0x1
    // Offset: 0x84
    bool IFJAMMDKCCM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IFJAMMDKCCM and: MKANKHGHGGL
    char __padding13[0x3] = {};
    // protected System.Single MKANKHGHGGL
    // Size: 0x4
    // Offset: 0x88
    float MKANKHGHGGL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: MKANKHGHGGL and: JHCDEANLCKP
    char __padding14[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<MagicalActual.ComponentListener>> JHCDEANLCKP
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::MagicalActual::ComponentListener*>*>* JHCDEANLCKP;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::MagicalActual::ComponentListener*>*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<MagicalActual.NetSyncListener>> HJLNCDDCHPD
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::MagicalActual::NetSyncListener*>*>* HJLNCDDCHPD;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::MagicalActual::NetSyncListener*>*>*) == 0x8);
    // public MagicalActual.OrbusNetManager KPMLFHPFLBL
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::OrbusNetManager* KPMLFHPFLBL;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusNetManager*) == 0x8);
    // private UnityEngine.Vector3 KOBBPFFEIHC
    // Size: 0xC
    // Offset: 0xA8
    ::UnityEngine::Vector3 KOBBPFFEIHC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 BJCDGCMALGE
    // Size: 0xC
    // Offset: 0xB4
    ::UnityEngine::Vector3 BJCDGCMALGE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.String MEKIMDBFLED
    // Size: 0x8
    // Offset: 0xC0
    ::StringW MEKIMDBFLED;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean APMMJNAIODI
    // Size: 0x1
    // Offset: 0xC8
    bool APMMJNAIODI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public System.UInt16 JGFIJDCMHDB
    [[deprecated("Use field access instead!")]] uint16_t& dyn_JGFIJDCMHDB();
    // Get instance field reference: public UnityEngine.GameObject BOHGAPNLIPA
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_BOHGAPNLIPA();
    // Get instance field reference: public MagicalActual.Monster LMKAEKNPBAG
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_LMKAEKNPBAG();
    // Get instance field reference: public System.Boolean NKLEBGJJFME
    [[deprecated("Use field access instead!")]] bool& dyn_NKLEBGJJFME();
    // Get instance field reference: public System.Boolean OMBJCGOPKNN
    [[deprecated("Use field access instead!")]] bool& dyn_OMBJCGOPKNN();
    // Get instance field reference: protected UnityEngine.Vector3 OMBHDEFLBEE
