// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: CreatureController
  class CreatureController;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetGunGameNode
  class NetGunGameNode;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::NetGunGameNode);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::NetGunGameNode*, "MagicalActual", "NetGunGameNode");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.NetGunGameNode
  // [TokenAttribute] Offset: FFFFFFFF
  class NetGunGameNode : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::NetGunGameNode::$SpawnCreatures$d__11
    class $SpawnCreatures$d__11;
    // Nested type: ::MagicalActual::NetGunGameNode::$$c__DisplayClass12_0
    class $$c__DisplayClass12_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.GameObject[] poopTypes
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::GameObject*> poopTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] creatureTypes
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::GameObject*> creatureTypes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject sack
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* sack;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Byte FOJPGIAHCLO
    // Size: 0x1
    // Offset: 0x40
    uint8_t FOJPGIAHCLO;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: FOJPGIAHCLO and: IBPLIOLMPDJ
    char __padding5[0x7] = {};
    // private UnityEngine.GameObject IBPLIOLMPDJ
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* IBPLIOLMPDJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 CNJCOLEJGPE
    // Size: 0x4
    // Offset: 0x50
    int CNJCOLEJGPE;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: CNJCOLEJGPE and: IJIOFNEPGEA
    char __padding7[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> IJIOFNEPGEA
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* IJIOFNEPGEA;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public UnityEngine.GameObject[] poopTypes
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_poopTypes();
    // Get instance field reference: public UnityEngine.GameObject[] creatureTypes
