// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: WorldMenu
  class WorldMenu;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: FaceController
  class FaceController;
  // Forward declaring type: DialogueBox
  class DialogueBox;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Npc
  class Npc;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Npc);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Npc*, "MagicalActual", "Npc");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Npc
  // [TokenAttribute] Offset: FFFFFFFF
  class Npc : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::Npc::orbusIncomingMethodIdx
    struct orbusIncomingMethodIdx;
    // Nested type: ::MagicalActual::Npc::$$c__DisplayClass28_0
    class $$c__DisplayClass28_0;
    // Nested type: ::MagicalActual::Npc::$$c__DisplayClass28_1
    class $$c__DisplayClass28_1;
    // Nested type: ::MagicalActual::Npc::$$c__DisplayClass38_0
    class $$c__DisplayClass38_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean OLAHKNGNEOE
    // Size: 0x1
    // Offset: 0x28
    bool OLAHKNGNEOE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OLAHKNGNEOE and: MLNMDKHIHPD
    char __padding2[0x7] = {};
    // private UnityEngine.GameObject MLNMDKHIHPD
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* MLNMDKHIHPD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject OKMOBKCEDJG
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* OKMOBKCEDJG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.WorldMenu PFJDDCPLNNI
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::WorldMenu* PFJDDCPLNNI;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // private MagicalActual.PlayerCharacter IPAMENHJLIL
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::PlayerCharacter* IPAMENHJLIL;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.FaceController OLFMGEBAGIH
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::FaceController* OLFMGEBAGIH;
    // Field size check
    static_assert(sizeof(::MagicalActual::FaceController*) == 0x8);
    // private UnityEngine.Vector3 CLHAIFFHBBL
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 CLHAIFFHBBL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: CLHAIFFHBBL and: IPLFAMAFDNM
    char __padding8[0x4] = {};
    // private System.Action`1<System.Int32> IPLFAMAFDNM
    // Size: 0x8
    // Offset: 0x68
    ::System::Action_1<int>* IPLFAMAFDNM;
    // Field size check
    static_assert(sizeof(::System::Action_1<int>*) == 0x8);
    // public SuperTextMesh dialogIndicator
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::SuperTextMesh* dialogIndicator;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private System.Byte CHHGNDBNEHK
    // Size: 0x1
    // Offset: 0x78
    uint8_t CHHGNDBNEHK;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: CHHGNDBNEHK and: MEJMLEINEIG
    char __padding11[0x3] = {};
    // private System.Single MEJMLEINEIG
    // Size: 0x4
    // Offset: 0x7C
    float MEJMLEINEIG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String PFHOAFAHAPD
    // Size: 0x8
    // Offset: 0x80
    ::StringW PFHOAFAHAPD;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String EDBBNNDLHJM
    // Size: 0x8
    // Offset: 0x88
    ::StringW EDBBNNDLHJM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String GPLIAJJBENC
    // Size: 0x8
    // Offset: 0x90
    ::StringW GPLIAJJBENC;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String PINEHOCMJLL
    // Size: 0x8
    // Offset: 0x98
    ::StringW PINEHOCMJLL;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.DialogueBox LNHBCAEIDAG
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::DialogueBox* LNHBCAEIDAG;
    // Field size check
    static_assert(sizeof(::MagicalActual::DialogueBox*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean OLAHKNGNEOE
    [[deprecated("Use field access instead!")]] bool& dyn_OLAHKNGNEOE();
    // Get instance field reference: private UnityEngine.GameObject MLNMDKHIHPD
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_MLNMDKHIHPD();
