// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NpcFollowPath
  class NpcFollowPath;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::NpcFollowPath);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::NpcFollowPath*, "MagicalActual", "NpcFollowPath");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.NpcFollowPath
  // [TokenAttribute] Offset: FFFFFFFF
  class NpcFollowPath : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public MagicalActual.NetEntity myEntity
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::NetEntity* myEntity;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x20
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String flagRequired
    // Size: 0x8
    // Offset: 0x28
    ::StringW flagRequired;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String setQuestFlagAtEnd
    // Size: 0x8
    // Offset: 0x30
    ::StringW setQuestFlagAtEnd;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean aggroMonsters
    // Size: 0x1
    // Offset: 0x38
    bool aggroMonsters;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: aggroMonsters and: animator
    char __padding4[0x7] = {};
    // public UnityEngine.Animator animator
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Animator* animator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.Vector3[] followPoints
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::Vector3> followPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.NetEntity myEntity
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_myEntity();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: public System.String flagRequired
    [[deprecated("Use field access instead!")]] ::StringW& dyn_flagRequired();
    // Get instance field reference: public System.String setQuestFlagAtEnd
    [[deprecated("Use field access instead!")]] ::StringW& dyn_setQuestFlagAtEnd();
    // Get instance field reference: public System.Boolean aggroMonsters
    [[deprecated("Use field access instead!")]] bool& dyn_aggroMonsters();
    // Get instance field reference: public UnityEngine.Animator animator
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_animator();
    // Get instance field reference: private UnityEngine.Vector3[] followPoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector3>& dyn_followPoints();
    // public System.Int32 KLJAPOJDPNC()
    // Offset: 0xEDE6F4
    int KLJAPOJDPNC();
    // public System.Void LLPHPEOCKIK(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDE70C
    void LLPHPEOCKIK(int FEHDKJKGNCE);
    // public System.Int32 IPAEMMPJKCM()
    // Offset: 0xEDE9B8
    int IPAEMMPJKCM();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEDE9D0
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Int32 LGDJGIJMMJM()
    // Offset: 0xEDEA84
    int LGDJGIJMMJM();
    // public System.Void MPOLAEGIJKL()
    // Offset: 0xEDEA9C
    void MPOLAEGIJKL();
    // public System.Int32 AHHAHIOODDF()
    // Offset: 0xEDEDD4
    int AHHAHIOODDF();
    // private System.Void MKLLPPCPHNM(System.Object OMLPNCLFFMJ)
    // Offset: 0xEDEDEC
    void MKLLPPCPHNM(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void .ctor()
    // Offset: 0xEDEE7C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static NpcFollowPath* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::NpcFollowPath::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<NpcFollowPath*, creationType>()));
    }
    // public UnityEngine.Vector3 GFFEDIPNJEG(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDEEEC
    ::UnityEngine::Vector3 GFFEDIPNJEG(int FEHDKJKGNCE);
    // public System.Int32 DNCGBOLABKE()
    // Offset: 0xEDEF48
    int DNCGBOLABKE();
    // public UnityEngine.Vector3 NHBJAFBLPLB(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDEF60
    ::UnityEngine::Vector3 NHBJAFBLPLB(int FEHDKJKGNCE);
    // public System.Void IEDHMJPCLII(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEDEFBC
    void IEDHMJPCLII(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public System.Int32 AIAALBIIPMH()
    // Offset: 0xEDF034
    int AIAALBIIPMH();
    // public System.Void AddPoint()
    // Offset: 0xEDF04C
    void AddPoint();
    // public System.Void MHCFCNBHECA(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEDF374
    void MHCFCNBHECA(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public System.Void AddSpawner(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDF3EC
    void AddSpawner(int FEHDKJKGNCE);
    // public System.Void DKDBFFDLADP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEDF698
    void DKDBFFDLADP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HMHOGKNKPAE(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEDF74C
    void HMHOGKNKPAE(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public System.Void SetPoint(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEDF7C4
    void SetPoint(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public System.Int32 get_ControlPointCount()
    // Offset: 0xEDF83C
    int get_ControlPointCount();
    // public UnityEngine.Vector3 FCDDLFAEHON(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDF854
    ::UnityEngine::Vector3 FCDDLFAEHON(int FEHDKJKGNCE);
    // public System.Void HIGOGJPMBNK(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEDF8B0
    void HIGOGJPMBNK(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public UnityEngine.Vector3 EENHNJAKIMH(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDF928
    ::UnityEngine::Vector3 EENHNJAKIMH(int FEHDKJKGNCE);
    // private System.Void JICHFPHFFEK(System.Object OMLPNCLFFMJ)
    // Offset: 0xEDF984
    void JICHFPHFFEK(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void BLBKOOGJNBB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEDFA14
    void BLBKOOGJNBB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void PGFKANPIHMP(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDFAC8
    void PGFKANPIHMP(int FEHDKJKGNCE);
    // public UnityEngine.Vector3 GetPoint(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDFD74
    ::UnityEngine::Vector3 GetPoint(int FEHDKJKGNCE);
    // public UnityEngine.Vector3 EGLCBHENOFO(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDFDD0
    ::UnityEngine::Vector3 EGLCBHENOFO(int FEHDKJKGNCE);
    // public System.Void EBKMGINMPPJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEDFE2C
    void EBKMGINMPPJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public UnityEngine.Vector3 HNHPFDJFLFP(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDFEE0
    ::UnityEngine::Vector3 HNHPFDJFLFP(int FEHDKJKGNCE);
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEDFF3C
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void LPPBCJBKINI(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEDFFF0
    void LPPBCJBKINI(int FEHDKJKGNCE);
    // private System.Void FIOBKDFBFML(System.Object OMLPNCLFFMJ)
    // Offset: 0xEE029C
    void FIOBKDFBFML(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void NNLLPOGDAKG()
    // Offset: 0xEE032C
    void NNLLPOGDAKG();
    // public System.Int32 JNALBMJCNHP()
    // Offset: 0xEE0668
    int JNALBMJCNHP();
    // public System.Void OAMOHIMHKEK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEE0680
    void OAMOHIMHKEK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AMBJHIJANNP(System.Object OMLPNCLFFMJ)
    // Offset: 0xEE0734
    void AMBJHIJANNP(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void AKHONBKJOHN(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEE07C4
    void AKHONBKJOHN(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public System.Void ELJLPGNGBOL(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEE083C
    void ELJLPGNGBOL(int FEHDKJKGNCE);
    // public System.Void EAANCLBACGG(System.Int32 FEHDKJKGNCE, UnityEngine.Vector3 PCJKGCJBKBL)
    // Offset: 0xEE0AE8
    void EAANCLBACGG(int FEHDKJKGNCE, ::UnityEngine::Vector3 PCJKGCJBKBL);
    // public System.Void OFDMFGNMEOP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEE0B60
    void OFDMFGNMEOP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Int32 GOOHGCOCLFE()
    // Offset: 0xEE0C14
    int GOOHGCOCLFE();
    // public System.Void NEMKNLGDEAK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xEE0C2C
    void NEMKNLGDEAK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void GBMNDLEKDHP(System.Int32 FEHDKJKGNCE)
    // Offset: 0xEE0CE0
    void GBMNDLEKDHP(int FEHDKJKGNCE);
    // public System.Void GJHBHJMLKOL()
    // Offset: 0xEE0F8C
    void GJHBHJMLKOL();
  }; // MagicalActual.NpcFollowPath
  #pragma pack(pop)
  static check_size<sizeof(NpcFollowPath), 72 + sizeof(::ArrayW<::UnityEngine::Vector3>)> __MagicalActual_NpcFollowPathSizeCheck;
  static_assert(sizeof(NpcFollowPath) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::NpcFollowPath::KLJAPOJDPNC
// Il2CppName: KLJAPOJDPNC
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<int (MagicalActual::NpcFollowPath::*)()>(&MagicalActual::NpcFollowPath::KLJAPOJDPNC)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::NpcFollowPath*), "KLJAPOJDPNC", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::NpcFollowPath::LLPHPEOCKIK
// Il2CppName: LLPHPEOCKIK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::NpcFollowPath::*)(int)>(&MagicalActual::NpcFollowPath::LLPHPEOCKIK)> {
  static const MethodInfo* get() {
    static auto* FEHDKJKGNCE = &::il2cpp_utils::GetClassFromName("System", "Int32")->byval_arg;
