// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: SkinnedMeshRenderer
  class SkinnedMeshRenderer;
  // Forward declaring type: MaterialPropertyBlock
  class MaterialPropertyBlock;
}
// Forward declaring namespace: HighlightPlus
namespace HighlightPlus {
  // Forward declaring type: HighlightEffect
  class HighlightEffect;
}
// Forward declaring namespace: HighlightingSystem
namespace HighlightingSystem {
  // Forward declaring type: Highlighter
  class Highlighter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ObjectHighlighter
  class ObjectHighlighter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ObjectHighlighter);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ObjectHighlighter*, "MagicalActual", "ObjectHighlighter");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x5A
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ObjectHighlighter
  // [TokenAttribute] Offset: FFFFFFFF
  class ObjectHighlighter : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.SkinnedMeshRenderer[] FKBJLMBGFPG
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::SkinnedMeshRenderer*> FKBJLMBGFPG;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::SkinnedMeshRenderer*>) == 0x8);
    // private UnityEngine.MaterialPropertyBlock NLMLMHFNNMA
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::MaterialPropertyBlock* NLMLMHFNNMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::MaterialPropertyBlock*) == 0x8);
    // private HighlightPlus.HighlightEffect LOOICHAMAIG
    // Size: 0x8
    // Offset: 0x28
    ::HighlightPlus::HighlightEffect* LOOICHAMAIG;
    // Field size check
    static_assert(sizeof(::HighlightPlus::HighlightEffect*) == 0x8);
    // private UnityEngine.Color BELKMLNGENC
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color BELKMLNGENC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private HighlightingSystem.Highlighter LEKLDADMNJL
    // Size: 0x8
    // Offset: 0x40
    ::HighlightingSystem::Highlighter* LEKLDADMNJL;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::Highlighter*) == 0x8);
    // public UnityEngine.Color defaultColor
    // Size: 0x10
    // Offset: 0x48
    ::UnityEngine::Color defaultColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean seeThroughObjects
    // Size: 0x1
    // Offset: 0x58
    bool seeThroughObjects;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE4978
    // private System.Boolean <CEJPKJPGCBN>k__BackingField
    // Size: 0x1
    // Offset: 0x59
    bool CEJPKJPGCBN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.SkinnedMeshRenderer[] FKBJLMBGFPG
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::SkinnedMeshRenderer*>& dyn_FKBJLMBGFPG();
    // Get instance field reference: private UnityEngine.MaterialPropertyBlock NLMLMHFNNMA
    [[deprecated("Use field access instead!")]] ::UnityEngine::MaterialPropertyBlock*& dyn_NLMLMHFNNMA();
    // Get instance field reference: private HighlightPlus.HighlightEffect LOOICHAMAIG
    [[deprecated("Use field access instead!")]] ::HighlightPlus::HighlightEffect*& dyn_LOOICHAMAIG();
    // Get instance field reference: private UnityEngine.Color BELKMLNGENC
