// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Orbhealer
  class Orbhealer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbhealerArrow
  class OrbhealerArrow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::OrbhealerArrow);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::OrbhealerArrow*, "MagicalActual", "OrbhealerArrow");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x9C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.OrbhealerArrow
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbhealerArrow : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Boolean fired
    // Size: 0x1
    // Offset: 0x18
    bool fired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fired and: arrowFireDirection
    char __padding0[0x3] = {};
    // public UnityEngine.Vector3 arrowFireDirection
    // Size: 0xC
    // Offset: 0x1C
    ::UnityEngine::Vector3 arrowFireDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single ENPHHEMGIML
    // Size: 0x4
    // Offset: 0x28
    float ENPHHEMGIML;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KNPCNCAKAIO
    // Size: 0x4
    // Offset: 0x2C
    float KNPCNCAKAIO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ANDDIBNAPMK
    // Size: 0x4
    // Offset: 0x30
    float ANDDIBNAPMK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Byte FDFKBNCDJHA
    // Size: 0x1
    // Offset: 0x34
    uint8_t FDFKBNCDJHA;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: FDFKBNCDJHA and: myOrbhealer
    char __padding5[0x3] = {};
    // public MagicalActual.Orbhealer myOrbhealer
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::Orbhealer* myOrbhealer;
    // Field size check
    static_assert(sizeof(::MagicalActual::Orbhealer*) == 0x8);
    // private UnityEngine.RaycastHit[] EHLLMIKFMJG
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::RaycastHit> EHLLMIKFMJG;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // public System.Int32 arrowId
    // Size: 0x4
    // Offset: 0x48
    int arrowId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: arrowId and: EJOPLGBIFOE
    char __padding8[0x4] = {};
    // private UnityEngine.GameObject EJOPLGBIFOE
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* EJOPLGBIFOE;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject LLBGLHHNFMF
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* LLBGLHHNFMF;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject KPLIFIKPALK
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* KPLIFIKPALK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject JGOFFEILMGH
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* JGOFFEILMGH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject OAJNJKIFADL
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* OAJNJKIFADL;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject NIDCMOIHMOM
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* NIDCMOIHMOM;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject DOHMPMHMFKD
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* DOHMPMHMFKD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject BPFBKNBPJNG
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* BPFBKNBPJNG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 JCDFLLLGDLH
    // Size: 0xC
    // Offset: 0x90
    ::UnityEngine::Vector3 JCDFLLLGDLH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Boolean fired
    [[deprecated("Use field access instead!")]] bool& dyn_fired();
    // Get instance field reference: public UnityEngine.Vector3 arrowFireDirection
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_arrowFireDirection();
    // Get instance field reference: private System.Single ENPHHEMGIML
    [[deprecated("Use field access instead!")]] float& dyn_ENPHHEMGIML();
    // Get instance field reference: private System.Single KNPCNCAKAIO
    [[deprecated("Use field access instead!")]] float& dyn_KNPCNCAKAIO();
    // Get instance field reference: private System.Single ANDDIBNAPMK
