// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Monster
  class Monster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshFilter
  class MeshFilter;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbhealerTurret
  class OrbhealerTurret;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::OrbhealerTurret);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::OrbhealerTurret*, "MagicalActual", "OrbhealerTurret");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.OrbhealerTurret
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbhealerTurret : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::OrbhealerTurret::$$c__DisplayClass10_0
    class $$c__DisplayClass10_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject[] vfxSlash
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::GameObject*> vfxSlash;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private System.Byte MOGANEBNFCK
    // Size: 0x1
    // Offset: 0x38
    uint8_t MOGANEBNFCK;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: MOGANEBNFCK and: typeMeshes
    char __padding4[0x7] = {};
    // public UnityEngine.Mesh[] typeMeshes
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Mesh*> typeMeshes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // private UnityEngine.MeshFilter LDNPJGPFLBN
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::MeshFilter* LDNPJGPFLBN;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject[] vfxSlash
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_vfxSlash();
    // Get instance field reference: private System.Byte MOGANEBNFCK
    [[deprecated("Use field access instead!")]] uint8_t& dyn_MOGANEBNFCK();
    // Get instance field reference: public UnityEngine.Mesh[] typeMeshes
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Mesh*>& dyn_typeMeshes();
    // Get instance field reference: private UnityEngine.MeshFilter LDNPJGPFLBN
    [[deprecated("Use field access instead!")]] ::UnityEngine::MeshFilter*& dyn_LDNPJGPFLBN();
    // private System.Void CBMDGNKFPIO()
    // Offset: 0x1730684
    void CBMDGNKFPIO();
    // private System.Void FDILPFPJCCK()
    // Offset: 0x1730768
    void FDILPFPJCCK();
    // public System.Void AGKHMBHBNFM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x17307D8
    void AGKHMBHBNFM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JFDEDDEJJPK()
    // Offset: 0x1730944
    void JFDEDDEJJPK();
    // private System.Void NHLDFKGHJMB(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1730EDC
    void NHLDFKGHJMB(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void JBEJCKDIKIE()
    // Offset: 0x1731508
    void JBEJCKDIKIE();
    // private System.Void HCAODAADGBA(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1731578
    void HCAODAADGBA(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x1731BA4
    void EIIKFEMCNKM();
    // private System.Void EPIJKOOFEOG(System.Object OMLPNCLFFMJ)
    // Offset: 0x1731C88
    void EPIJKOOFEOG(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FHMBPGMJPCM(System.Object OMLPNCLFFMJ)
    // Offset: 0x1731DD4
    void FHMBPGMJPCM(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void BMJNBLJPOCF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1731E40
    void BMJNBLJPOCF(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void PKINMLEHJFB()
    // Offset: 0x1731614
    void PKINMLEHJFB();
    // private System.Void Awake()
    // Offset: 0x1732464
    void Awake();
    // private System.Void CKDOIDHFJDD(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x17324D4
    void CKDOIDHFJDD(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void FBGLLGJCAKF(System.Object OMLPNCLFFMJ)
    // Offset: 0x1732570
    void FBGLLGJCAKF(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void Slash()
    // Offset: 0x1731EE0
    void Slash();
    // private System.Void NJNPOKAIECM()
    // Offset: 0x1731CF4
    void NJNPOKAIECM();
    // public System.Void JFBOMHHGFDN()
    // Offset: 0x17325DC
    void JFBOMHHGFDN();
    // private System.Void ONLDPGAMPFG(System.Object OMLPNCLFFMJ)
    // Offset: 0x1732B6C
    void ONLDPGAMPFG(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void ELPKOLBFKKH(System.Object OMLPNCLFFMJ)
    // Offset: 0x1732CB8
    void ELPKOLBFKKH(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void IPFIFLMBJCE(System.Object OMLPNCLFFMJ)
    // Offset: 0x1732D24
    void IPFIFLMBJCE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void MDHBNHLHENF(System.Object OMLPNCLFFMJ)
    // Offset: 0x1732D90
    void MDHBNHLHENF(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void DKCEPCAMFLE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1732DFC
    void DKCEPCAMFLE(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void PFABJJGAOMM()
    // Offset: 0x1732E98
    void PFABJJGAOMM();
    // public System.Void .ctor()
    // Offset: 0x1732E9C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OrbhealerTurret* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::OrbhealerTurret::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OrbhealerTurret*, creationType>()));
    }
    // private System.Void MFBFFBOCFOB(System.Object OMLPNCLFFMJ)
    // Offset: 0x1732EF4
    void MFBFFBOCFOB(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1732F60
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void Start()
    // Offset: 0x17330C4
    void Start();
    // private System.Void LOLJNDAIIOL()
    // Offset: 0x1730688
    void LOLJNDAIIOL();
    // private System.Void ECHEDMMOOAN(System.Object OMLPNCLFFMJ)
    // Offset: 0x17330C8
    void ECHEDMMOOAN(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void NEMKNLGDEAK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1733134
    void NEMKNLGDEAK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void MELPNKHDJFN()
    // Offset: 0x17332A0
    void MELPNKHDJFN();
    // private System.Void HCPOGGKGLLE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1733310
    void HCPOGGKGLLE(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void NPAGKODLFOI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x17333AC
    void NPAGKODLFOI(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void HMFAGACHGPF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x1733448
    void HMFAGACHGPF(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void HLGKLABMHHD()
    // Offset: 0x1730F78
    void HLGKLABMHHD();
    // private System.Void CCDJAFHECME()
    // Offset: 0x1732BD8
    void CCDJAFHECME();
    // private System.Void OBCBPLBPHJJ(System.Object OMLPNCLFFMJ)
    // Offset: 0x17334E4
    void OBCBPLBPHJJ(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1733550
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GPMJGLIPKHD()
    // Offset: 0x1731BA8
    void GPMJGLIPKHD();
    // private System.Void OMDCCCBPNJM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x17336BC
    void OMDCCCBPNJM(::System::Collections::ArrayList* HPEANAHIBAH);
  }; // MagicalActual.OrbhealerTurret
  #pragma pack(pop)
  static check_size<sizeof(OrbhealerTurret), 72 + sizeof(::UnityEngine::MeshFilter*)> __MagicalActual_OrbhealerTurretSizeCheck;
  static_assert(sizeof(OrbhealerTurret) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::OrbhealerTurret::CBMDGNKFPIO
// Il2CppName: CBMDGNKFPIO
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::OrbhealerTurret::*)()>(&MagicalActual::OrbhealerTurret::CBMDGNKFPIO)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::OrbhealerTurret*), "CBMDGNKFPIO", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::OrbhealerTurret::FDILPFPJCCK
// Il2CppName: FDILPFPJCCK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::OrbhealerTurret::*)()>(&MagicalActual::OrbhealerTurret::FDILPFPJCCK)> {
  static const MethodInfo* get() {
