// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObscuredBool
#include "CodeStage/AntiCheat/ObscuredTypes/ObscuredBool.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: OrbhealerArrow
  class OrbhealerArrow;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: OrbhealerRotatingorb
  class OrbhealerRotatingorb;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Orbhealer
  class Orbhealer;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Orbhealer);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Orbhealer*, "MagicalActual", "Orbhealer");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x20E
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Orbhealer
  // [TokenAttribute] Offset: FFFFFFFF
  class Orbhealer : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Orbhealer::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::Orbhealer::orbusIncomingMethodIdx
    struct orbusIncomingMethodIdx;
    // Nested type: ::MagicalActual::Orbhealer::arrowSpellIdx
    struct arrowSpellIdx;
    // Nested type: ::MagicalActual::Orbhealer::$$c
    class $$c;
    // Nested type: ::MagicalActual::Orbhealer::$$c__DisplayClass99_0
    class $$c__DisplayClass99_0;
    // Nested type: ::MagicalActual::Orbhealer::$$c__DisplayClass107_0
    class $$c__DisplayClass107_0;
    // Nested type: ::MagicalActual::Orbhealer::$$c__DisplayClass109_0
    class $$c__DisplayClass109_0;
    public:
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x18
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: HCFELEODBLD
    char __padding0[0x7] = {};
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.OrbhealerArrow BFMPMGPHIAL
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::OrbhealerArrow* BFMPMGPHIAL;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbhealerArrow*) == 0x8);
    // public UnityEngine.GameObject flyingArrowPrefab
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* flyingArrowPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxBlood
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* vfxBlood;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject[] vfxExplosions
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::GameObject*> vfxExplosions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject leftBow
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* leftBow;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject superVfx
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* superVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject gunFireVfx
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* gunFireVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Material defaultTurretMaterial
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Material* defaultTurretMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material redeployMaterial
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* redeployMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Animator IFDCDFKINIP
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Animator* IFDCDFKINIP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x88
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HIKIBDCNDAA and: BIMDBFLIHFE
    char __padding14[0x7] = {};
    // private UnityEngine.UI.Image BIMDBFLIHFE
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Image* BIMDBFLIHFE;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.UI.Image HNDFGKCHGNK
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UI::Image* HNDFGKCHGNK;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.UI.Image AJFDIIPGILB
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UI::Image* AJFDIIPGILB;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.Color JMJKIJDCPDF
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Color JMJKIJDCPDF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color OFJLNPFPAAD
    // Size: 0x10
    // Offset: 0xB8
    ::UnityEngine::Color OFJLNPFPAAD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0xC8
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0xD0
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Single IAIBPCPKDJE
    // Size: 0x4
    // Offset: 0xD8
    float IAIBPCPKDJE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FABKFLBCALA
    // Size: 0x4
    // Offset: 0xDC
    float FABKFLBCALA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.OrbhealerRotatingorb[] KMCCGJGACCL
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::MagicalActual::OrbhealerRotatingorb*> KMCCGJGACCL;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::OrbhealerRotatingorb*>) == 0x8);
    // public MagicalActual.OrbhealerRotatingorb[] rotatingOrbTemplates
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::MagicalActual::OrbhealerRotatingorb*> rotatingOrbTemplates;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::OrbhealerRotatingorb*>) == 0x8);
    // private MagicalActual.OrbhealerRotatingorb PCEDLPPNADD
    // Size: 0x8
    // Offset: 0xF0
    ::MagicalActual::OrbhealerRotatingorb* PCEDLPPNADD;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbhealerRotatingorb*) == 0x8);
    // public UnityEngine.GameObject bulletTrail
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* bulletTrail;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3[] ANIPNOADKLO
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::Vector3> ANIPNOADKLO;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.GameObject DJGBMGBIACC
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::GameObject* DJGBMGBIACC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject EIJPNPAILJO
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::GameObject* EIJPNPAILJO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single POLLAOFOHEA
    // Size: 0x4
    // Offset: 0x118
    float POLLAOFOHEA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NEGNHIHOOKD
    // Size: 0x4
    // Offset: 0x11C
    float NEGNHIHOOKD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.GameObject FIKHDMKMLAB
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::GameObject* FIKHDMKMLAB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HCIJFOGINAI
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::GameObject* HCIJFOGINAI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single DPMAEKNLCHO
    // Size: 0x4
    // Offset: 0x130
    float DPMAEKNLCHO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KMOCHJFANEP
    // Size: 0x4
    // Offset: 0x134
    float KMOCHJFANEP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.GameObject HIPAEIODDMG
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* HIPAEIODDMG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject thrownTurretPrefab
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::GameObject* thrownTurretPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform MJIJELBANGO
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Transform* MJIJELBANGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single AAJEKOOBJGB
    // Size: 0x4
    // Offset: 0x150
    float AAJEKOOBJGB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KDEGPNCLAEI
    // Size: 0x4
    // Offset: 0x154
    float KDEGPNCLAEI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.OrbhealerRotatingorb GBONJGCAKGN
    // Size: 0x8
    // Offset: 0x158
    ::MagicalActual::OrbhealerRotatingorb* GBONJGCAKGN;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbhealerRotatingorb*) == 0x8);
    // private UnityEngine.Vector3 EDMFJMGEKGI
    // Size: 0xC
    // Offset: 0x160
    ::UnityEngine::Vector3 EDMFJMGEKGI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion CPHDHODAFKP
    // Size: 0x10
    // Offset: 0x16C
    ::UnityEngine::Quaternion CPHDHODAFKP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: CPHDHODAFKP and: lifewellPrefab
    char __padding44[0x4] = {};
    // public UnityEngine.GameObject lifewellPrefab
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::GameObject* lifewellPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform HNGDCMCEOEI
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::Transform* HNGDCMCEOEI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.AudioSource BPFOFPNPABM
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::AudioSource* BPFOFPNPABM;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip gunFireSfx
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::AudioClip* gunFireSfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Single KPHINAFCLPC
    // Size: 0x4
    // Offset: 0x1A0
    float KPHINAFCLPC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FMKGICEALKG
    // Size: 0x4
    // Offset: 0x1A4
    float FMKGICEALKG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0x1A8
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0x1A9
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GHBBMIFHKGO and: CCEMBLKGKLN
    char __padding52[0x6] = {};
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 GJJDIJAFLGA
    // Size: 0x4
    // Offset: 0x1C0
    int GJJDIJAFLGA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single AEIDEJKFCGP
    // Size: 0x4
    // Offset: 0x1C4
    float AEIDEJKFCGP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single AMEBJBGOCEK
    // Size: 0x4
    // Offset: 0x1C8
    float AMEBJBGOCEK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single COJHGLFBONC
    // Size: 0x4
    // Offset: 0x1CC
    float COJHGLFBONC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IAJJMOHNBDC
    // Size: 0x4
    // Offset: 0x1D0
    float IAJJMOHNBDC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean HKFNOIINMNG
    // Size: 0x1
    // Offset: 0x1D4
    bool HKFNOIINMNG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean OIBFBGGJODG
    // Size: 0x1
    // Offset: 0x1D5
    bool OIBFBGGJODG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OIBFBGGJODG and: chargeUpVFX
    char __padding61[0x2] = {};
    // private UnityEngine.GameObject chargeUpVFX
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::GameObject* chargeUpVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform[] BNOIKKALNCM
    // Size: 0x8
    // Offset: 0x1E0
    ::ArrayW<::UnityEngine::Transform*> BNOIKKALNCM;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x1E8
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE35F0
    // private System.Byte <LENLAPNMNAI>k__BackingField
    // Size: 0x1
    // Offset: 0x1F0
    uint8_t LENLAPNMNAI;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: LENLAPNMNAI and: COLMMMMCHPF
    char __padding65[0x3] = {};
    // private System.Int32 COLMMMMCHPF
    // Size: 0x4
    // Offset: 0x1F4
    int COLMMMMCHPF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean MLNOLMKEKHH
    // Size: 0x1
    // Offset: 0x1F8
    bool MLNOLMKEKHH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean KAJCMPLNHPB
    // Size: 0x1
    // Offset: 0x1F9
    bool KAJCMPLNHPB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte DHKDOGJAOIG
    // Size: 0x1
    // Offset: 0x1FA
    uint8_t DHKDOGJAOIG;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte AMEHAHENPCD
    // Size: 0x1
    // Offset: 0x1FB
    uint8_t AMEHAHENPCD;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte OPOBPKDLAHC
    // Size: 0x1
    // Offset: 0x1FC
    uint8_t OPOBPKDLAHC;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte OFLDKIABLBN
    // Size: 0x1
    // Offset: 0x1FD
    uint8_t OFLDKIABLBN;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte LONFMBGCIHF
    // Size: 0x1
    // Offset: 0x1FE
    uint8_t LONFMBGCIHF;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean EDPJBJOGLIK
    // Size: 0x1
    // Offset: 0x1FF
    bool EDPJBJOGLIK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private CodeStage.AntiCheat.ObscuredTypes.ObscuredBool MDMKEEIPOMI
    // Size: 0xB
    // Offset: 0x200
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool MDMKEEIPOMI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool) == 0xB);
    // Padding between fields: MDMKEEIPOMI and: OAKHDAAFGCB
    char __padding75[0x1] = {};
    // private System.Boolean OAKHDAAFGCB
    // Size: 0x1
    // Offset: 0x20C
    bool OAKHDAAFGCB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasOneForAll
    // Size: 0x1
    // Offset: 0x20D
    bool hasOneForAll;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
    // Get instance field reference: private MagicalActual.PlayerCharacter HCFELEODBLD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerCharacter*& dyn_HCFELEODBLD();
    // Get instance field reference: private MagicalActual.PlayerClass FNINBDEICCD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerClass*& dyn_FNINBDEICCD();
