// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: MagicalActual.connectionProtocol
#include "MagicalActual/connectionProtocol.hpp"
// Including type: ENet.Host
#include "ENet/Host.hpp"
// Including type: ENet.Peer
#include "ENet/Peer.hpp"
// Including type: UnityEngine.Rect
#include "UnityEngine/Rect.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: PlayerEntity
  class PlayerEntity;
  // Forward declaring type: BoxCuller
  class BoxCuller;
  // Forward declaring type: DebugBox
  class DebugBox;
  // Forward declaring type: NetEntity
  class NetEntity;

// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AsyncOperation
  class AsyncOperation;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Light
  class Light;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Cubemap
  class Cubemap;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: ShaderVariantCollection
  class ShaderVariantCollection;
  // Forward declaring type: Sprite
  class Sprite;
  // Skipping declaration: Vector3 because it is already included!
  // Skipping declaration: Quaternion because it is already included!
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Funly::SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: TimeOfDayController
  class TimeOfDayController;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: Queue
  class Queue;
  // Skipping declaration: IEnumerator because it is already included!
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OVRScreenFade
  class OVRScreenFade;
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: HighlightPlus
namespace HighlightPlus {
  // Forward declaring type: HighlightProfile
  class HighlightProfile;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: StreamWriter
  class StreamWriter;
  // Forward declaring type: BinaryReader
  class BinaryReader;
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: UnhandledExceptionEventArgs
  class UnhandledExceptionEventArgs;
  // Forward declaring type: EventArgs
  class EventArgs;
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbusNetManager
  class OrbusNetManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::OrbusNetManager);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::OrbusNetManager*, "MagicalActual", "OrbusNetManager");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x3C0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.OrbusNetManager
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbusNetManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::OrbusNetManager::FogInfo
    struct FogInfo;
    // Nested type: ::MagicalActual::OrbusNetManager::$FinishLoadingPool$d__189
    class $FinishLoadingPool$d__189;
    // Nested type: ::MagicalActual::OrbusNetManager::$AndroidLoadLevel$d__200
    class $AndroidLoadLevel$d__200;
    // Nested type: ::MagicalActual::OrbusNetManager::$AsyncWarmupScene$d__205
    class $AsyncWarmupScene$d__205;
    // Nested type: ::MagicalActual::OrbusNetManager::$$c
    class $$c;
    // Nested type: ::MagicalActual::OrbusNetManager::$sharpConnectionError$d__209
    class $sharpConnectionError$d__209;
    // Nested type: ::MagicalActual::OrbusNetManager::$handleTextMessage$d__210
    class $handleTextMessage$d__210;
    // Nested type: ::MagicalActual::OrbusNetManager::$handleBinaryMessage$d__211
    class $handleBinaryMessage$d__211;
    // Nested type: ::MagicalActual::OrbusNetManager::$$c__DisplayClass256_0
    class $$c__DisplayClass256_0;
    // Nested type: ::MagicalActual::OrbusNetManager::$doReturnToPool$d__281
    class $doReturnToPool$d__281;
    public:
    // private WebSocketSharp.WebSocket BGCDEILECMG
    // Size: 0x8
    // Offset: 0x18
    ::WebSocketSharp::WebSocket* BGCDEILECMG;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::WebSocket*) == 0x8);
    // private System.Boolean KBMHPGPGIIA
    // Size: 0x1
    // Offset: 0x20
    bool KBMHPGPGIIA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KBMHPGPGIIA and: EJJHNCDINIL
    char __padding1[0x3] = {};
    // private MagicalActual.connectionProtocol EJJHNCDINIL
    // Size: 0x4
    // Offset: 0x24
    ::MagicalActual::connectionProtocol EJJHNCDINIL;
    // Field size check
    static_assert(sizeof(::MagicalActual::connectionProtocol) == 0x4);
    // private System.Threading.Thread HMDMJKAAPKD
    // Size: 0x8
    // Offset: 0x28
    ::System::Threading::Thread* HMDMJKAAPKD;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    // private System.Threading.Thread FHMHJGHHHJL
    // Size: 0x8
    // Offset: 0x30
    ::System::Threading::Thread* FHMHJGHHHJL;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    // private System.Boolean CFKMAHCLOAO
    // Size: 0x1
    // Offset: 0x38
    bool CFKMAHCLOAO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MLDDKDHBKNJ
    // Size: 0x1
    // Offset: 0x39
    bool MLDDKDHBKNJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MLDDKDHBKNJ and: CPDOPKLGFOC
    char __padding6[0x6] = {};
    // private ENet.Host CPDOPKLGFOC
    // Size: 0x8
    // Offset: 0x40
    ::ENet::Host CPDOPKLGFOC;
    // Field size check
    static_assert(sizeof(::ENet::Host) == 0x8);
    // private ENet.Peer PCGAAFEJNLM
    // Size: 0x8
    // Offset: 0x48
    ::ENet::Peer PCGAAFEJNLM;
    // Field size check
    static_assert(sizeof(::ENet::Peer) == 0x8);
    // private System.Boolean MLHHMODNJDD
    // Size: 0x1
    // Offset: 0x50
    bool MLHHMODNJDD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MLHHMODNJDD and: currentPlayer
    char __padding9[0x7] = {};
    // public MagicalActual.PlayerCharacter currentPlayer
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::PlayerCharacter* currentPlayer;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE49C8
    // private MagicalActual.PlayerEntity <FLGKCFDJJFG>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::PlayerEntity* FLGKCFDJJFG;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerEntity*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE49D8
    // private MagicalActual.BoxCuller <AEAHOOIBOLP>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::MagicalActual::BoxCuller* AEAHOOIBOLP;
    // Field size check
    static_assert(sizeof(::MagicalActual::BoxCuller*) == 0x8);
    // private UnityEngine.GameObject GLIPBBDKBFF
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* GLIPBBDKBFF;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject JJDMDLCCPDD
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* JJDMDLCCPDD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject DEEKAEBCEIB
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* DEEKAEBCEIB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject NDMMAKECNBL
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* NDMMAKECNBL;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.UInt16 MKHBBLCAEKE
    // Size: 0x2
    // Offset: 0x90
    uint16_t MKHBBLCAEKE;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: MKHBBLCAEKE and: OJGKJMALGOE
    char __padding17[0x2] = {};
    // private System.Int32 OJGKJMALGOE
    // Size: 0x4
    // Offset: 0x94
    int OJGKJMALGOE;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Byte currentFrameTiming
    // Size: 0x1
    // Offset: 0x98
    uint8_t currentFrameTiming;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: currentFrameTiming and: CAAKGPNCNPH
    char __padding19[0x3] = {};
    // private System.Int32 CAAKGPNCNPH
    // Size: 0x4
    // Offset: 0x9C
    int CAAKGPNCNPH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Collections.Generic.List`1<MagicalActual.DebugBox> AOKHPKBGHHM
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::MagicalActual::DebugBox*>* AOKHPKBGHHM;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::DebugBox*>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.NetEntity> HGFHOIPDOAE
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::MagicalActual::NetEntity*>* HGFHOIPDOAE;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::NetEntity*>*) == 0x8);
    // private System.Single OFCMIAIDMKK
    // Size: 0x4
    // Offset: 0xB0
    float OFCMIAIDMKK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single AJLNEHINEKD
    // Size: 0x4
    // Offset: 0xB4
    float AJLNEHINEKD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 CLNPOMCKOHO
    // Size: 0x4
    // Offset: 0xB8
    int CLNPOMCKOHO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single CJLJIFLFFID
    // Size: 0x4
    // Offset: 0xBC
    float CJLJIFLFFID;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MKANKHGHGGL
    // Size: 0x4
    // Offset: 0xC0
    float MKANKHGHGGL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: MKANKHGHGGL and: FNAOFKALOPC
    char __padding27[0x4] = {};
    // private System.Double FNAOFKALOPC
    // Size: 0x8
    // Offset: 0xC8
    double FNAOFKALOPC;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Single OGLMPBOLIDH
    // Size: 0x4
    // Offset: 0xD0
    float OGLMPBOLIDH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MCBMGOHODCM
    // Size: 0x4
    // Offset: 0xD4
    float MCBMGOHODCM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 currentClientLatency
    // Size: 0x4
    // Offset: 0xD8
    int currentClientLatency;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: currentClientLatency and: serverClockOffset
    char __padding31[0x4] = {};
    // public System.Double serverClockOffset
    // Size: 0x8
    // Offset: 0xE0
    double serverClockOffset;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.String OGKBBIOHGCL
    // Size: 0x8
    // Offset: 0xE8
    ::StringW OGKBBIOHGCL;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Rect EGNDJIMAGHE
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Rect EGNDJIMAGHE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rect) == 0x10);
    // private System.Boolean MNFIHCKLIKM
    // Size: 0x1
    // Offset: 0x100
    bool MNFIHCKLIKM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MNFIHCKLIKM and: CNIJGCMKFLG
    char __padding35[0x7] = {};
    // private System.String CNIJGCMKFLG
    // Size: 0x8
    // Offset: 0x108
    ::StringW CNIJGCMKFLG;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean OGPKLDKHPPJ
    // Size: 0x1
    // Offset: 0x110
    bool OGPKLDKHPPJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OGPKLDKHPPJ and: NIEGJDIEMBO
    char __padding37[0x7] = {};
    // private System.Threading.Thread NIEGJDIEMBO
    // Size: 0x8
    // Offset: 0x118
    ::System::Threading::Thread* NIEGJDIEMBO;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    // private System.Boolean APNPHBNCJBP
    // Size: 0x1
    // Offset: 0x120
    bool APNPHBNCJBP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean OOAMDEIMKFK
    // Size: 0x1
    // Offset: 0x121
    bool OOAMDEIMKFK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OOAMDEIMKFK and: PNELKGEIJDF
    char __padding40[0x2] = {};
    // private System.UInt32 PNELKGEIJDF
    // Size: 0x4
    // Offset: 0x124
    uint PNELKGEIJDF;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Boolean ILHKGBIPLHC
    // Size: 0x1
    // Offset: 0x128
    bool ILHKGBIPLHC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ILHKGBIPLHC and: DPGNKLAAHMF
    char __padding42[0x7] = {};
    // private System.ArraySegment`1<System.Byte>[] DPGNKLAAHMF
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::System::ArraySegment_1<uint8_t>> DPGNKLAAHMF;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::ArraySegment_1<uint8_t>>) == 0x8);
    // private System.Byte MCALDPOCDFI
    // Size: 0x1
    // Offset: 0x138
    uint8_t MCALDPOCDFI;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean NLFAMPPCEGK
    // Size: 0x1
    // Offset: 0x139
    bool NLFAMPPCEGK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NLFAMPPCEGK and: OICKBCMBPIP
    char __padding45[0x2] = {};
    // private System.Single OICKBCMBPIP
    // Size: 0x4
    // Offset: 0x13C
    float OICKBCMBPIP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NKIEHMIEDBO
    // Size: 0x4
    // Offset: 0x140
    float NKIEHMIEDBO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean ICIBCNNIJJC
    // Size: 0x1
    // Offset: 0x144
    bool ICIBCNNIJJC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MDIHHIKNBFE
    // Size: 0x1
    // Offset: 0x145
    bool MDIHHIKNBFE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MDIHHIKNBFE and: CPNMILCHOAL
    char __padding49[0x2] = {};
    // private System.String CPNMILCHOAL
    // Size: 0x8
    // Offset: 0x148
    ::StringW CPNMILCHOAL;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String OFFNEIGCLFM
    // Size: 0x8
    // Offset: 0x150
    ::StringW OFFNEIGCLFM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String APKOFFFDCFH
    // Size: 0x8
    // Offset: 0x158
    ::StringW APKOFFFDCFH;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean EBEBINDBBJD
    // Size: 0x1
    // Offset: 0x160
    bool EBEBINDBBJD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EBEBINDBBJD and: AJNLDKCIDBO
    char __padding53[0x7] = {};
    // private System.Double AJNLDKCIDBO
    // Size: 0x8
    // Offset: 0x168
    double AJNLDKCIDBO;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Double LAGPNFMMAFC
    // Size: 0x8
    // Offset: 0x170
    double LAGPNFMMAFC;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Int32 DPCCDOGCJCI
    // Size: 0x4
    // Offset: 0x178
    int DPCCDOGCJCI;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single ECHNFIKEJHG
    // Size: 0x4
    // Offset: 0x17C
    float ECHNFIKEJHG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MLDFMOAEAAC
    // Size: 0x4
    // Offset: 0x180
    float MLDFMOAEAAC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DKOLKGLEOBC
    // Size: 0x4
    // Offset: 0x184
    float DKOLKGLEOBC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean EJJHDDFIBPI
    // Size: 0x1
    // Offset: 0x188
    bool EJJHDDFIBPI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EJJHDDFIBPI and: OCMNMIDLLOF
    char __padding60[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE4A08
    // private Funly.SkyStudio.TimeOfDayController <OCMNMIDLLOF>k__BackingField
    // Size: 0x8
    // Offset: 0x190
    ::Funly::SkyStudio::TimeOfDayController* OCMNMIDLLOF;
    // Field size check
    static_assert(sizeof(::Funly::SkyStudio::TimeOfDayController*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4A18
    // private System.Boolean <HLMEMKBIILO>k__BackingField
    // Size: 0x1
    // Offset: 0x198
    bool HLMEMKBIILO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HLMEMKBIILO and: ambientOverride
    char __padding62[0x7] = {};
    // public System.String ambientOverride
    // Size: 0x8
    // Offset: 0x1A0
    ::StringW ambientOverride;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean exitingAmbientZone
    // Size: 0x1
    // Offset: 0x1A8
    bool exitingAmbientZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: exitingAmbientZone and: fogOverride
    char __padding64[0x7] = {};
    // public System.String fogOverride
    // Size: 0x8
    // Offset: 0x1B0
    ::StringW fogOverride;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean exitingFogZone
    // Size: 0x1
    // Offset: 0x1B8
    bool exitingFogZone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE4A28
    // private System.Boolean <DKFCPNFBDOP>k__BackingField
    // Size: 0x1
    // Offset: 0x1B9
    bool DKFCPNFBDOP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean steamvr_loadlock
    // Size: 0x1
    // Offset: 0x1BA
    bool steamvr_loadlock;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: steamvr_loadlock and: EJALDDLCKBL
    char __padding68[0x5] = {};
    // private UnityEngine.AsyncOperation EJALDDLCKBL
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::AsyncOperation* EJALDDLCKBL;
    // Field size check
    static_assert(sizeof(::UnityEngine::AsyncOperation*) == 0x8);
    // private System.Boolean OCKEHCLPPCC
    // Size: 0x1
    // Offset: 0x1C8
    bool OCKEHCLPPCC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean BGCBAJNLPJG
    // Size: 0x1
    // Offset: 0x1C9
    bool BGCBAJNLPJG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AMCMFHKEPFB
    // Size: 0x1
    // Offset: 0x1CA
    bool AMCMFHKEPFB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AMCMFHKEPFB and: BELPAKLLNKK
    char __padding72[0x1] = {};
    // private System.Single BELPAKLLNKK
    // Size: 0x4
    // Offset: 0x1CC
    float BELPAKLLNKK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ANIMDPBPFIN
    // Size: 0x4
    // Offset: 0x1D0
    float ANIMDPBPFIN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: ANIMDPBPFIN and: DGLCDAAPAIA
    char __padding74[0x4] = {};
    // private System.String DGLCDAAPAIA
    // Size: 0x8
    // Offset: 0x1D8
    ::StringW DGLCDAAPAIA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String KIPDGIFLKIA
    // Size: 0x8
    // Offset: 0x1E0
    ::StringW KIPDGIFLKIA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String EKKKCDPNEHN
    // Size: 0x8
    // Offset: 0x1E8
    ::StringW EKKKCDPNEHN;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.GameObject[] FOCAPLMMGPI
    // Size: 0x8
    // Offset: 0x1F0
    ::ArrayW<::UnityEngine::GameObject*> FOCAPLMMGPI;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4A38
    // private UnityEngine.GameObject <GJDKHPNEMIJ>k__BackingField
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::GameObject* GJDKHPNEMIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4A48
    // private UnityEngine.GameObject <KMGNPALOBED>k__BackingField
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::GameObject* KMGNPALOBED;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Queue PGAKGCJEELO
    // Size: 0x8
    // Offset: 0x208
    ::System::Collections::Queue* PGAKGCJEELO;
    // Field size check
    static_assert(sizeof(::System::Collections::Queue*) == 0x8);
    // private System.Collections.Queue GBEECEILIEL
    // Size: 0x8
    // Offset: 0x210
    ::System::Collections::Queue* GBEECEILIEL;
    // Field size check
    static_assert(sizeof(::System::Collections::Queue*) == 0x8);
    // private System.Collections.Queue DLBJFKAGHNG
    // Size: 0x8
    // Offset: 0x218
    ::System::Collections::Queue* DLBJFKAGHNG;
    // Field size check
    static_assert(sizeof(::System::Collections::Queue*) == 0x8);
    // private System.Int32 HLIOCGDMJFL
    // Size: 0x4
    // Offset: 0x220
    int HLIOCGDMJFL;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean ONDCFILEHOM
    // Size: 0x1
    // Offset: 0x224
    bool ONDCFILEHOM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ONDCFILEHOM and: LLKGNOOJHOO
    char __padding85[0x3] = {};
    // private System.Threading.Thread LLKGNOOJHOO
    // Size: 0x8
    // Offset: 0x228
    ::System::Threading::Thread* LLKGNOOJHOO;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4A58
    // private System.Boolean <MJDHOAPOEOD>k__BackingField
    // Size: 0x1
    // Offset: 0x230
    bool MJDHOAPOEOD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean connectionLoadingStall
    // Size: 0x1
    // Offset: 0x231
    bool connectionLoadingStall;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ignoreLoadStall
    // Size: 0x1
    // Offset: 0x232
    bool ignoreLoadStall;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean noTeleporting
    // Size: 0x1
    // Offset: 0x233
    bool noTeleporting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single NKGJDPJJBJO
    // Size: 0x4
    // Offset: 0x234
    float NKGJDPJJBJO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OBAJDNPOAOG
    // Size: 0x4
    // Offset: 0x238
    float OBAJDNPOAOG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EENPDANNJLN
    // Size: 0x4
    // Offset: 0x23C
    float EENPDANNJLN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PBFMMNGMCGD
    // Size: 0x4
    // Offset: 0x240
    float PBFMMNGMCGD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MIFMABCJCPL
    // Size: 0x4
    // Offset: 0x244
    float MIFMABCJCPL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ODNMKNCLEKM
    // Size: 0x4
    // Offset: 0x248
    float ODNMKNCLEKM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean ECFAHNHAOCG
    // Size: 0x1
    // Offset: 0x24C
    bool ECFAHNHAOCG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ECFAHNHAOCG and: IONBCLDCHCI
    char __padding97[0x3] = {};
    // private System.Single IONBCLDCHCI
    // Size: 0x4
    // Offset: 0x250
    float IONBCLDCHCI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EDGBAHENAMI
    // Size: 0x4
    // Offset: 0x254
    float EDGBAHENAMI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean AIDICDNHMCB
    // Size: 0x1
    // Offset: 0x258
    bool AIDICDNHMCB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AIDICDNHMCB and: BPABFGOONOJ
    char __padding100[0x7] = {};
    // private System.Collections.Generic.List`1<System.String> BPABFGOONOJ
    // Size: 0x8
    // Offset: 0x260
    ::System::Collections::Generic::List_1<::StringW>* BPABFGOONOJ;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public OVRScreenFade screenFader
    // Size: 0x8
    // Offset: 0x268
    ::GlobalNamespace::OVRScreenFade* screenFader;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRScreenFade*) == 0x8);
    // public UnityEngine.Texture2D defaultLoadingScreen
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::Texture2D* defaultLoadingScreen;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public System.Boolean expectingHardTransition
    // Size: 0x1
    // Offset: 0x278
    bool expectingHardTransition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean lastTransitionBetweenSceneFiles
    // Size: 0x1
    // Offset: 0x279
    bool lastTransitionBetweenSceneFiles;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lastTransitionBetweenSceneFiles and: MBDBNNDJPIF
    char __padding105[0x6] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,PhysicsInteractable> MBDBNNDJPIF
    // Size: 0x8
    // Offset: 0x280
    ::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::PhysicsInteractable*>* MBDBNNDJPIF;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::GlobalNamespace::PhysicsInteractable*>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,UnityEngine.GameObject> preloadedPrefabs
    // Size: 0x8
    // Offset: 0x288
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::GameObject*>* preloadedPrefabs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::GameObject*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4AA8
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<UnityEngine.GameObject>> <OHCAHOPFFNM>k__BackingField
    // Size: 0x8
    // Offset: 0x290
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*>* OHCAHOPFFNM;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4AB8
    // private System.Collections.Generic.List`1<System.String> <DIDAMKHOMMB>k__BackingField
    // Size: 0x8
    // Offset: 0x298
    ::System::Collections::Generic::List_1<::StringW>* DIDAMKHOMMB;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> NGEFDIDCJKO
    // Size: 0x8
    // Offset: 0x2A0
    ::System::Collections::Generic::List_1<::StringW>* NGEFDIDCJKO;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Boolean IACGMFNKBCD
    // Size: 0x1
    // Offset: 0x2A8
    bool IACGMFNKBCD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IACGMFNKBCD and: defaultColorGrade
    char __padding111[0x7] = {};
    // public UnityEngine.Texture defaultColorGrade
    // Size: 0x8
    // Offset: 0x2B0
    ::UnityEngine::Texture* defaultColorGrade;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public UnityEngine.Texture loresightColorGrade
    // Size: 0x8
    // Offset: 0x2B8
    ::UnityEngine::Texture* loresightColorGrade;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public UnityEngine.Light undergroundDirectionalLight
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::Light* undergroundDirectionalLight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Light*) == 0x8);
    // public UnityEngine.GameObject graphyObject
    // Size: 0x8
    // Offset: 0x2C8
    ::UnityEngine::GameObject* graphyObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean IDEOHJDKNBF
    // Size: 0x1
    // Offset: 0x2D0
    bool IDEOHJDKNBF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IDEOHJDKNBF and: DPFLHCHLEMO
    char __padding116[0x3] = {};
    // private System.Single DPFLHCHLEMO
    // Size: 0x4
    // Offset: 0x2D4
    float DPFLHCHLEMO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean CDOKJLFKIAD
    // Size: 0x1
    // Offset: 0x2D8
    bool CDOKJLFKIAD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CDOKJLFKIAD and: dungeonSkybox
    char __padding118[0x7] = {};
    // public UnityEngine.Material dungeonSkybox
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::Material* dungeonSkybox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material dungeonDomeSkybox
    // Size: 0x8
    // Offset: 0x2E8
    ::UnityEngine::Material* dungeonDomeSkybox;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Byte KNIBEHHKIGC
    // Size: 0x1
    // Offset: 0x2F0
    uint8_t KNIBEHHKIGC;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: KNIBEHHKIGC and: AOLFHEJIALO
    char __padding121[0x3] = {};
    // private System.Single AOLFHEJIALO
    // Size: 0x4
    // Offset: 0x2F4
    float AOLFHEJIALO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Cubemap mobileSkyboxCubemap
    // Size: 0x8
    // Offset: 0x2F8
    ::UnityEngine::Cubemap* mobileSkyboxCubemap;
    // Field size check
    static_assert(sizeof(::UnityEngine::Cubemap*) == 0x8);
    // public UnityEngine.Camera skyboxCamera
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::Camera* skyboxCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public UnityEngine.Material complicatedSkyboxMaterial
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::Material* complicatedSkyboxMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material simpleSkyboxMaterial
    // Size: 0x8
    // Offset: 0x310
    ::UnityEngine::Material* simpleSkyboxMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> MNJNHHMMJIM
    // Size: 0x8
    // Offset: 0x318
    ::System::Collections::Generic::List_1<::StringW>* MNJNHHMMJIM;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Boolean HIBGFOOPEJN
    // Size: 0x1
    // Offset: 0x320
    bool HIBGFOOPEJN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HIBGFOOPEJN and: barIconMeshes
    char __padding128[0x7] = {};
    // public UnityEngine.Mesh[] barIconMeshes
    // Size: 0x8
    // Offset: 0x328
    ::ArrayW<::UnityEngine::Mesh*> barIconMeshes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // public UnityEngine.GameObject barDifficultyPrefab
    // Size: 0x8
    // Offset: 0x330
    ::UnityEngine::GameObject* barDifficultyPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single MNMCEKADMAN
    // Size: 0x4
    // Offset: 0x338
    float MNMCEKADMAN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single LMNLKOFOMGG
    // Size: 0x4
    // Offset: 0x33C
    float LMNLKOFOMGG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean waitingOnLevelLoadToComplete
    // Size: 0x1
    // Offset: 0x340
    bool waitingOnLevelLoadToComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean waitingOnInitialPositionToBroadcast
    // Size: 0x1
    // Offset: 0x341
    bool waitingOnInitialPositionToBroadcast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean waitingOnSubSceneLoad
    // Size: 0x1
    // Offset: 0x342
    bool waitingOnSubSceneLoad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean triggeredLevelLoadFade
    // Size: 0x1
    // Offset: 0x343
    bool triggeredLevelLoadFade;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Single timeSinceReadyForFadeIn
    // Size: 0x4
    // Offset: 0x344
    float timeSinceReadyForFadeIn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean movementLock
    // Size: 0x1
    // Offset: 0x348
    bool movementLock;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: movementLock and: HEAMDPAGCGH
    char __padding138[0x3] = {};
    // private System.Single HEAMDPAGCGH
    // Size: 0x4
    // Offset: 0x34C
    float HEAMDPAGCGH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.GameObject preloadCamera
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::GameObject* preloadCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject usedEffectsPrefab
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::GameObject* usedEffectsPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public HighlightPlus.HighlightProfile defaultHighlightProfile
    // Size: 0x8
    // Offset: 0x360
    ::HighlightPlus::HighlightProfile* defaultHighlightProfile;
    // Field size check
    static_assert(sizeof(::HighlightPlus::HighlightProfile*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,UnityEngine.GameObject> classModules
    // Size: 0x8
    // Offset: 0x368
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::GameObject*>* classModules;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::GameObject*>*) == 0x8);
    // public UnityEngine.ShaderVariantCollection defaultShaderCollection
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::ShaderVariantCollection* defaultShaderCollection;
    // Field size check
    static_assert(sizeof(::UnityEngine::ShaderVariantCollection*) == 0x8);
    // private System.Single FDOCDFEBAJJ
    // Size: 0x4
    // Offset: 0x378
    float FDOCDFEBAJJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: FDOCDFEBAJJ and: LGBBGBNIGIH
    char __padding145[0x4] = {};
    // private System.IO.StreamWriter LGBBGBNIGIH
    // Size: 0x8
    // Offset: 0x380
    ::System::IO::StreamWriter* LGBBGBNIGIH;
    // Field size check
    static_assert(sizeof(::System::IO::StreamWriter*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.UInt16,MagicalActual.NetEntity> NMDMGMMFEDH
    // Size: 0x8
    // Offset: 0x388
    ::System::Collections::Generic::Dictionary_2<uint16_t, ::MagicalActual::NetEntity*>* NMDMGMMFEDH;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<uint16_t, ::MagicalActual::NetEntity*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,MagicalActual.PrefabData> LMEHLCGJOOE
    // Size: 0x8
    // Offset: 0x390
    ::System::Collections::Generic::Dictionary_2<int, ::MagicalActual::PrefabData*>* LMEHLCGJOOE;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::MagicalActual::PrefabData*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Int32,System.String> GJJAAFBFGBI
    // Size: 0x8
    // Offset: 0x398
    ::System::Collections::Generic::Dictionary_2<int, ::StringW>* GJJAAFBFGBI;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<int, ::StringW>*) == 0x8);
    // public UnityEngine.Sprite[] statusIcons
    // Size: 0x8
    // Offset: 0x3A0
    ::ArrayW<::UnityEngine::Sprite*> statusIcons;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Sprite*>) == 0x8);
    // public System.UInt16 OTHERPLAYER_ENTITY_TYPE
    // Size: 0x2
    // Offset: 0x3A8
    uint16_t OTHERPLAYER_ENTITY_TYPE;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: OTHERPLAYER_ENTITY_TYPE and: defaultMaterial
    char __padding151[0x6] = {};
    // public UnityEngine.Material defaultMaterial
    // Size: 0x8
    // Offset: 0x3B0
    ::UnityEngine::Material* defaultMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public System.Boolean isRaining
    // Size: 0x1
    // Offset: 0x3B8
    bool isRaining;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isRaining and: APNJKEHEDOM
    char __padding153[0x3] = {};
    // private System.Int32 APNJKEHEDOM
    // Size: 0x4
    // Offset: 0x3BC
    int APNJKEHEDOM;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private MagicalActual.OrbusNetManager MMECOAJKONB
    static ::MagicalActual::OrbusNetManager* _get_MMECOAJKONB();
    // Set static field: static private MagicalActual.OrbusNetManager MMECOAJKONB
    static void _set_MMECOAJKONB(::MagicalActual::OrbusNetManager* value);
    // Get instance field reference: private WebSocketSharp.WebSocket BGCDEILECMG
    [[deprecated("Use field access instead!")]] ::WebSocketSharp::WebSocket*& dyn_BGCDEILECMG();
    // Get instance field reference: private System.Boolean KBMHPGPGIIA
    [[deprecated("Use field access instead!")]] bool& dyn_KBMHPGPGIIA();
    // Get instance field reference: private MagicalActual.connectionProtocol EJJHNCDINIL
