// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: FMOD.Studio.EventInstance
#include "FMOD/Studio/EventInstance.hpp"
// Including type: FMOD.Studio.VCA
#include "FMOD/Studio/VCA.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: OrbusMusicArea
  class OrbusMusicArea;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: UnityEngine::Audio
namespace UnityEngine::Audio {
  // Forward declaring type: AudioMixerGroup
  class AudioMixerGroup;
  // Forward declaring type: AudioMixer
  class AudioMixer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbusSoundManager
  class OrbusSoundManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::OrbusSoundManager);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::OrbusSoundManager*, "MagicalActual", "OrbusSoundManager");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xC1
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.OrbusSoundManager
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbusSoundManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::OrbusSoundManager::$$c__DisplayClass45_0
    class $$c__DisplayClass45_0;
    public:
    // public UnityEngine.AudioClip backgroundMusic
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::AudioClip* backgroundMusic;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip combatMusic
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::AudioClip* combatMusic;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.Audio.AudioMixerGroup outputGroup
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Audio::AudioMixerGroup* outputGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // public UnityEngine.Audio.AudioMixerGroup sfxGroup
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Audio::AudioMixerGroup* sfxGroup;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixerGroup*) == 0x8);
    // public UnityEngine.Audio.AudioMixer masterMixer
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Audio::AudioMixer* masterMixer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Audio::AudioMixer*) == 0x8);
    // public UnityEngine.AudioClip[] guiSfx
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::AudioClip*> guiSfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // private UnityEngine.AudioSource PCBCOLMLIDF
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioSource* PCBCOLMLIDF;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource OHEOCNOJBLJ
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AudioSource* OHEOCNOJBLJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4B48
    // private MagicalActual.OrbusMusicArea <LCOIBFMKBPB>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::OrbusMusicArea* LCOIBFMKBPB;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusMusicArea*) == 0x8);
    // private System.Single JHPOONONPAC
    // Size: 0x4
    // Offset: 0x68
    float JHPOONONPAC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OCJKNBLCKIO
    // Size: 0x4
    // Offset: 0x6C
    float OCJKNBLCKIO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CJOAFPBOEMF
    // Size: 0x4
    // Offset: 0x70
    float CJOAFPBOEMF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CGDKBPLHOMO
    // Size: 0x4
    // Offset: 0x74
    float CGDKBPLHOMO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 KDLEKLCAOJD
    // Size: 0x4
    // Offset: 0x78
    int KDLEKLCAOJD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 KJOLKHGEKBH
    // Size: 0x4
    // Offset: 0x7C
    int KJOLKHGEKBH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 JBKIKEMKMBK
    // Size: 0x4
    // Offset: 0x80
    int JBKIKEMKMBK;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single AAMIOFNLBKB
    // Size: 0x4
    // Offset: 0x84
    float AAMIOFNLBKB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OACBAHMFACM
    // Size: 0x4
    // Offset: 0x88
    float OACBAHMFACM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CBGDPBIEGBL
    // Size: 0x4
    // Offset: 0x8C
    float CBGDPBIEGBL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BMAMHDCGKGI
    // Size: 0x4
    // Offset: 0x90
    float BMAMHDCGKGI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CGBGHDJMHOP
    // Size: 0x4
    // Offset: 0x94
    float CGBGHDJMHOP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean OELFIAAIHBL
    // Size: 0x1
    // Offset: 0x98
    bool OELFIAAIHBL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean OACKABMGABI
    // Size: 0x1
    // Offset: 0x99
    bool OACKABMGABI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ALOEBOBEEDP
    // Size: 0x1
    // Offset: 0x9A
    bool ALOEBOBEEDP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean LBIDOICPAHE
    // Size: 0x1
    // Offset: 0x9B
    bool LBIDOICPAHE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LBIDOICPAHE and: LILAGOEGEOJ
    char __padding25[0x4] = {};
    // private FMOD.Studio.EventInstance LILAGOEGEOJ
    // Size: 0x8
    // Offset: 0xA0
    ::FMOD::Studio::EventInstance LILAGOEGEOJ;
    // Field size check
    static_assert(sizeof(::FMOD::Studio::EventInstance) == 0x8);
    // private FMOD.Studio.VCA LKOKDPFPHAA
    // Size: 0x8
    // Offset: 0xA8
    ::FMOD::Studio::VCA LKOKDPFPHAA;
    // Field size check
    static_assert(sizeof(::FMOD::Studio::VCA) == 0x8);
    // private FMOD.Studio.VCA FFJFPGLOJAO
    // Size: 0x8
    // Offset: 0xB0
    ::FMOD::Studio::VCA FFJFPGLOJAO;
    // Field size check
    static_assert(sizeof(::FMOD::Studio::VCA) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,System.Single> currentVolumePercents
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Dictionary_2<::StringW, float>* currentVolumePercents;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, float>*) == 0x8);
    // private System.Boolean HALFLBGNCGA
    // Size: 0x1
    // Offset: 0xC0
    bool HALFLBGNCGA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private MagicalActual.OrbusSoundManager MMECOAJKONB
    static ::MagicalActual::OrbusSoundManager* _get_MMECOAJKONB();
    // Set static field: static private MagicalActual.OrbusSoundManager MMECOAJKONB
    static void _set_MMECOAJKONB(::MagicalActual::OrbusSoundManager* value);
    // Get instance field reference: public UnityEngine.AudioClip backgroundMusic
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_backgroundMusic();
    // Get instance field reference: public UnityEngine.AudioClip combatMusic
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioClip*& dyn_combatMusic();
