// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ProgressBarPro
  class ProgressBarPro;
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshFilter
  class MeshFilter;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbusHealthBar
  class OrbusHealthBar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::OrbusHealthBar);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::OrbusHealthBar*, "MagicalActual", "OrbusHealthBar");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.OrbusHealthBar
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbusHealthBar : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single PHMODMJFCIK
    // Size: 0x4
    // Offset: 0x18
    float PHMODMJFCIK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single BCMKMMLHGMG
    // Size: 0x4
    // Offset: 0x1C
    float BCMKMMLHGMG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single POBAHEFBBFI
    // Size: 0x4
    // Offset: 0x20
    float POBAHEFBBFI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ABONCFAKAOP
    // Size: 0x4
    // Offset: 0x24
    float ABONCFAKAOP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single GENNOPEBNPI
    // Size: 0x4
    // Offset: 0x28
    float GENNOPEBNPI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DCNDGFLKMCK
    // Size: 0x4
    // Offset: 0x2C
    float DCNDGFLKMCK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private ProgressBarPro MCCKEOCHMMN
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::ProgressBarPro* MCCKEOCHMMN;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // private UnityEngine.Camera EMGKKLPHDEB
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Camera* EMGKKLPHDEB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4998
    // private UnityEngine.Vector3 <OLMLEDCEJPG>k__BackingField
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 OLMLEDCEJPG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: OLMLEDCEJPG and: LHEJHHOHAPL
    char __padding8[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE49A8
    // private UnityEngine.Transform <LHEJHHOHAPL>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* LHEJHHOHAPL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x68
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private System.Int32 LEEDFECEPGB
    // Size: 0x4
    // Offset: 0x70
    int LEEDFECEPGB;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 EFBKFIHDIDD
    // Size: 0x4
    // Offset: 0x74
    int EFBKFIHDIDD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.String JNCPNDJCJLH
    // Size: 0x8
    // Offset: 0x78
    ::StringW JNCPNDJCJLH;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String IIJBPKDIABE
    // Size: 0x8
    // Offset: 0x80
    ::StringW IIJBPKDIABE;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String PELDBFCFMPM
    // Size: 0x8
    // Offset: 0x88
    ::StringW PELDBFCFMPM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 MICNFIMMMJH
    // Size: 0x4
    // Offset: 0x90
    int MICNFIMMMJH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single CJMJNLPMCDN
    // Size: 0x4
    // Offset: 0x94
    float CJMJNLPMCDN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color DNIFNFJALMD
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Color DNIFNFJALMD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Boolean ILMKPAGMKJG
    // Size: 0x1
    // Offset: 0xA8
    bool ILMKPAGMKJG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AFMHINJBDHE
    // Size: 0x1
    // Offset: 0xA9
    bool AFMHINJBDHE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean KLCLDIFBDNN
    // Size: 0x1
    // Offset: 0xAA
    bool KLCLDIFBDNN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte EMBNOIHOOGB
    // Size: 0x1
    // Offset: 0xAB
    uint8_t EMBNOIHOOGB;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Boolean alwaysShowBar
    // Size: 0x1
    // Offset: 0xAC
    bool alwaysShowBar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean dontFaceCamera
    // Size: 0x1
    // Offset: 0xAD
    bool dontFaceCamera;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hideStrengthIndicator
    // Size: 0x1
    // Offset: 0xAE
    bool hideStrengthIndicator;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hideNameplate
    // Size: 0x1
    // Offset: 0xAF
    bool hideNameplate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean EEKNIBCBNEK
    // Size: 0x1
    // Offset: 0xB0
    bool EEKNIBCBNEK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean alwaysShowName
    // Size: 0x1
    // Offset: 0xB1
    bool alwaysShowName;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean canFocus
    // Size: 0x1
    // Offset: 0xB2
    bool canFocus;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: canFocus and: defaultName
    char __padding31[0x5] = {};
    // public System.String defaultName
    // Size: 0x8
    // Offset: 0xB8
    ::StringW defaultName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String JFGOEIBGDFM
    // Size: 0x8
    // Offset: 0xC0
    ::StringW JFGOEIBGDFM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> NALCMNABJLP
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* NALCMNABJLP;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // private SuperTextMesh GDJECKCJFLO
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::SuperTextMesh* GDJECKCJFLO;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private UnityEngine.GameObject EFNCFAEBFIN
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* EFNCFAEBFIN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.MeshFilter OCBCOCDBCNK
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::MeshFilter* OCBCOCDBCNK;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.GameObject GJDPABBEHIP
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* GJDPABBEHIP;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject ANHGCOKBFEM
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::GameObject* ANHGCOKBFEM;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject JHLHNAJHDLD
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* JHLHNAJHDLD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean JPHGNIAHGOD
    // Size: 0x1
    // Offset: 0x100
    bool JPHGNIAHGOD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JPHGNIAHGOD and: KFAEBLENKII
    char __padding41[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE49B8
    // private UnityEngine.Transform <KFAEBLENKII>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Transform* KFAEBLENKII;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single PHMODMJFCIK
    [[deprecated("Use field access instead!")]] float& dyn_PHMODMJFCIK();
    // Get instance field reference: private System.Single BCMKMMLHGMG
    [[deprecated("Use field access instead!")]] float& dyn_BCMKMMLHGMG();
    // Get instance field reference: private System.Single POBAHEFBBFI
    [[deprecated("Use field access instead!")]] float& dyn_POBAHEFBBFI();
    // Get instance field reference: private System.Single ABONCFAKAOP
    [[deprecated("Use field access instead!")]] float& dyn_ABONCFAKAOP();
    // Get instance field reference: private System.Single GENNOPEBNPI
