// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: OrbusBillboard
  class OrbusBillboard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::OrbusBillboard);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::OrbusBillboard*, "MagicalActual", "OrbusBillboard");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.OrbusBillboard
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbusBillboard : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Single ILECLHHMIEG
    // Size: 0x4
    // Offset: 0x18
    float ILECLHHMIEG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean BFIPCHNFAJI
    // Size: 0x1
    // Offset: 0x1C
    bool BFIPCHNFAJI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BFIPCHNFAJI and: DMNHBEIHGMA
    char __padding1[0x3] = {};
    // private UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform KKGHFBBFLDF
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* KKGHFBBFLDF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single ILECLHHMIEG
    [[deprecated("Use field access instead!")]] float& dyn_ILECLHHMIEG();
    // Get instance field reference: private System.Boolean BFIPCHNFAJI
    [[deprecated("Use field access instead!")]] bool& dyn_BFIPCHNFAJI();
    // Get instance field reference: private UnityEngine.Transform DMNHBEIHGMA
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_DMNHBEIHGMA();
    // Get instance field reference: private UnityEngine.Transform KKGHFBBFLDF
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_KKGHFBBFLDF();
    // public System.Void JKIKKKFOFFA()
    // Offset: 0x17373C4
    void JKIKKKFOFFA();
    // public System.Void GFNNFJLNIFD()
    // Offset: 0x17373D0
    void GFNNFJLNIFD();
    // public System.Void Hide()
    // Offset: 0x17373D8
    void Hide();
    // public System.Void CBNABBCKBPJ()
    // Offset: 0x1737464
    void CBNABBCKBPJ();
    // public System.Void ALOGKEGMPDB()
    // Offset: 0x17374FC
    void ALOGKEGMPDB();
    // private System.Void NLIHHIKGAAK(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1737598
    void NLIHHIKGAAK(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // public System.Void BNJMMIIFDMC()
    // Offset: 0x1737610
    void BNJMMIIFDMC();
    // private System.Void EDJIILEFNPD()
    // Offset: 0x1737618
    void EDJIILEFNPD();
    // public System.Void DOCHKDGMHOK()
    // Offset: 0x173782C
    void DOCHKDGMHOK();
    // private System.Void NNHDBFOKKGD()
    // Offset: 0x17378C4
    void NNHDBFOKKGD();
    // private System.Void EBNFNLMHNGE()
    // Offset: 0x1737A60
    void EBNFNLMHNGE();
    // private System.Void DPJHGADPMOI(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1737BE8
    void DPJHGADPMOI(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // private System.Void AKNELKNEMHB(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1737484
    void AKNELKNEMHB(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // private System.Void PHKIDPBAGFL(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x173784C
    void PHKIDPBAGFL(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // private System.Void MJKAGCAKHHO()
    // Offset: 0x1737C60
    void MJKAGCAKHHO();
    // public System.Void LBCPIGBDOMP()
    // Offset: 0x1737E04
    void LBCPIGBDOMP();
    // private System.Void Update()
    // Offset: 0x1737E10
    void Update();
    // private System.Void BABIKHAMEJM(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1737F88
    void BABIKHAMEJM(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // public System.Void MCEAAFHKPGK()
    // Offset: 0x1738000
    void MCEAAFHKPGK();
    // public System.Void .ctor()
    // Offset: 0x173809C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static OrbusBillboard* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::OrbusBillboard::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<OrbusBillboard*, creationType>()));
    }
    // public System.Void OFAFCMKBOII()
    // Offset: 0x17380A4
    void OFAFCMKBOII();
    // public System.Void PBMCGPHDEFM()
    // Offset: 0x17380AC
    void PBMCGPHDEFM();
    // private System.Void KHLGIMBINJG()
    // Offset: 0x17380CC
    void KHLGIMBINJG();
    // public System.Void JAMOAFCDICB()
    // Offset: 0x1738268
    void JAMOAFCDICB();
    // private System.Void Awake()
    // Offset: 0x1738274
    void Awake();
    // public System.Void OJIDJHJBHGP()
    // Offset: 0x1738404
    void OJIDJHJBHGP();
    // public System.Void PCLGIHCAEEK()
    // Offset: 0x173849C
    void PCLGIHCAEEK();
    // private System.Void GPKFEBEOKDK(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1737520
    void GPKFEBEOKDK(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // private System.Void CEGEBCFNLFC()
    // Offset: 0x17384A8
    void CEGEBCFNLFC();
    // private System.Void KEBOKGFLFJA()
    // Offset: 0x173864C
    void KEBOKGFLFJA();
    // public System.Void IECFDDJJONK()
    // Offset: 0x1738868
    void IECFDDJJONK();
    // private System.Void CMGMNHMIHFD()
    // Offset: 0x1738888
    void CMGMNHMIHFD();
    // public System.Void CFEDOKEOCAF()
    // Offset: 0x1738A2C
    void CFEDOKEOCAF();
    // private System.Void KHDKNBGDPAJ(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1738024
    void KHDKNBGDPAJ(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // public System.Void KEEEGHEOGNJ()
    // Offset: 0x1738A34
    void KEEEGHEOGNJ();
    // private System.Void NLOFBPNEFKD()
    // Offset: 0x1738A58
    void NLOFBPNEFKD();
    // public System.Void BCCKBDIHFBI()
    // Offset: 0x1738BF0
    void BCCKBDIHFBI();
    // private System.Void LMFIENPBFKA()
    // Offset: 0x1738BF8
    void LMFIENPBFKA();
    // public System.Void AOHJNLFHGDG()
    // Offset: 0x1738D94
    void AOHJNLFHGDG();
    // private System.Void OLMMPDAOLBD(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x17377B4
    void OLMMPDAOLBD(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // public System.Void Show()
    // Offset: 0x1738DA0
    void Show();
    // private System.Void FDJDNODKMGH()
    // Offset: 0x1738DAC
    void FDJDNODKMGH();
    // public System.Void BAHDAPBLPAO()
    // Offset: 0x1738F48
    void BAHDAPBLPAO();
    // private System.Void NBFJIDECMPF(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x17373EC
    void NBFJIDECMPF(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // private System.Void JAGGFFJJJIE(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x1738424
    void JAGGFFJJJIE(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
    // private System.Void DFDLDJMECOJ(System.Single KAMMMBFNBLF, System.Single NAFFPDFFLAL, System.Single JDPOMLKFKLN)
    // Offset: 0x17387F0
    void DFDLDJMECOJ(float KAMMMBFNBLF, float NAFFPDFFLAL, float JDPOMLKFKLN);
  }; // MagicalActual.OrbusBillboard
  #pragma pack(pop)
  static check_size<sizeof(OrbusBillboard), 40 + sizeof(::UnityEngine::Transform*)> __MagicalActual_OrbusBillboardSizeCheck;
  static_assert(sizeof(OrbusBillboard) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::OrbusBillboard::JKIKKKFOFFA
// Il2CppName: JKIKKKFOFFA
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::OrbusBillboard::*)()>(&MagicalActual::OrbusBillboard::JKIKKKFOFFA)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::OrbusBillboard*), "JKIKKKFOFFA", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::OrbusBillboard::GFNNFJLNIFD
// Il2CppName: GFNNFJLNIFD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::OrbusBillboard::*)()>(&MagicalActual::OrbusBillboard::GFNNFJLNIFD)> {
  static const MethodInfo* get() {
