// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: BoxCollider
  class BoxCollider;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Paladin
  class Paladin;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Paladin);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Paladin*, "MagicalActual", "Paladin");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x46F
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Paladin
  // [TokenAttribute] Offset: FFFFFFFF
  class Paladin : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Paladin::$$c
    class $$c;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass136_0
    class $$c__DisplayClass136_0;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass137_0
    class $$c__DisplayClass137_0;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass137_1
    class $$c__DisplayClass137_1;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass137_2
    class $$c__DisplayClass137_2;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass137_3
    class $$c__DisplayClass137_3;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass140_0
    class $$c__DisplayClass140_0;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass140_1
    class $$c__DisplayClass140_1;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass141_0
    class $$c__DisplayClass141_0;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass141_1
    class $$c__DisplayClass141_1;
    // Nested type: ::MagicalActual::Paladin::$$c__DisplayClass144_0
    class $$c__DisplayClass144_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x28
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: FNINBDEICCD
    char __padding2[0x7] = {};
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 KHIKJLICKKF
    // Size: 0x4
    // Offset: 0x58
    int KHIKJLICKKF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 FJPBNPLIKHA
    // Size: 0x4
    // Offset: 0x5C
    int FJPBNPLIKHA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.GameObject hammer
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* hammer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Rigidbody IKCECNHJOME
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Rigidbody* IKCECNHJOME;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public UnityEngine.GameObject[] hitVfx
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::GameObject*> hitVfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject hemanVfx
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* hemanVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject PPJCBODBHOH
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* PPJCBODBHOH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject superVfx
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* superVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject chargeVfx
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* chargeVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0xA0
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0xA1
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0xA2
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0xA3
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IMNDEEOEOKA and: NPJAMHKBLLM
    char __padding21[0x4] = {};
    // private UnityEngine.Collider[] NPJAMHKBLLM
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::UnityEngine::Collider*> NPJAMHKBLLM;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // public UnityEngine.GameObject collisionBoxPrefab
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* collisionBoxPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt DKBAJEHLDMP
    // Size: 0x19
    // Offset: 0xB8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt DKBAJEHLDMP;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: DKBAJEHLDMP and: OJHGBHCKPCB
    char __padding24[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt OJHGBHCKPCB
    // Size: 0x19
    // Offset: 0xD8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt OJHGBHCKPCB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: OJHGBHCKPCB and: EKMNMNLFENN
    char __padding25[0x7] = {};
    // private System.Boolean EKMNMNLFENN
    // Size: 0x1
    // Offset: 0xF8
    bool EKMNMNLFENN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EKMNMNLFENN and: KBFBPJGLNMA
    char __padding26[0x7] = {};
    // private UnityEngine.GameObject KBFBPJGLNMA
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::GameObject* KBFBPJGLNMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single OKGLIFFGAGE
    // Size: 0x4
    // Offset: 0x108
    float OKGLIFFGAGE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 AIKDIMABMDG
    // Size: 0xC
    // Offset: 0x10C
    ::UnityEngine::Vector3 AIKDIMABMDG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 FAIGECBHGJK
    // Size: 0xC
    // Offset: 0x118
    ::UnityEngine::Vector3 FAIGECBHGJK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: FAIGECBHGJK and: BGFIJNGFMFO
    char __padding30[0x4] = {};
    // private UnityEngine.GameObject BGFIJNGFMFO
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::GameObject* BGFIJNGFMFO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt LEGNJPIEHKE
    // Size: 0x19
    // Offset: 0x130
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt LEGNJPIEHKE;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: LEGNJPIEHKE and: PMGMDMHOPMP
    char __padding32[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt PMGMDMHOPMP
    // Size: 0x19
    // Offset: 0x150
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt PMGMDMHOPMP;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: PMGMDMHOPMP and: JGOGJDHABHN
    char __padding33[0x7] = {};
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.BoxCollider NMJBBEBJJJI
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::BoxCollider* NMJBBEBJJJI;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Boolean PIOCBNGGDPO
    // Size: 0x1
    // Offset: 0x180
    bool PIOCBNGGDPO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMCHGJIABOI
    // Size: 0x1
    // Offset: 0x181
    bool IMCHGJIABOI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MKEJECCLPIH
    // Size: 0x1
    // Offset: 0x182
    bool MKEJECCLPIH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MKCFLGCJIDK
    // Size: 0x1
    // Offset: 0x183
    bool MKCFLGCJIDK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MKCFLGCJIDK and: FECGNHPCECI
    char __padding39[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt FECGNHPCECI
    // Size: 0x19
    // Offset: 0x188
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt FECGNHPCECI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: FECGNHPCECI and: HGBJEBCNNNC
    char __padding40[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt HGBJEBCNNNC
    // Size: 0x19
    // Offset: 0x1A8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt HGBJEBCNNNC;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: HGBJEBCNNNC and: DFDJHPMMHFA
    char __padding41[0x7] = {};
    // private System.Boolean DFDJHPMMHFA
    // Size: 0x1
    // Offset: 0x1C8
    bool DFDJHPMMHFA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DFDJHPMMHFA and: IKJANOHKIHC
    char __padding42[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt IKJANOHKIHC
    // Size: 0x19
    // Offset: 0x1D0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt IKJANOHKIHC;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: IKJANOHKIHC and: EBFEFPEEDDI
    char __padding43[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt EBFEFPEEDDI
    // Size: 0x19
    // Offset: 0x1F0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt EBFEFPEEDDI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: EBFEFPEEDDI and: KFABFKFCNFO
    char __padding44[0x7] = {};
    // private UnityEngine.Vector3 KFABFKFCNFO
    // Size: 0xC
    // Offset: 0x210
    ::UnityEngine::Vector3 KFABFKFCNFO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 IDAHJMKDAII
    // Size: 0xC
    // Offset: 0x21C
    ::UnityEngine::Vector3 IDAHJMKDAII;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.GameObject globe1On
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::GameObject* globe1On;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe2On
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::GameObject* globe2On;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe3On
    // Size: 0x8
    // Offset: 0x238
    ::UnityEngine::GameObject* globe3On;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe4On
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::GameObject* globe4On;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe5On
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::GameObject* globe5On;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe1Off
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::GameObject* globe1Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe2Off
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::GameObject* globe2Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe3Off
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::GameObject* globe3Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe4Off
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::GameObject* globe4Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject globe5Off
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::GameObject* globe5Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.UI.Image chargeAbilityIcon
    // Size: 0x8
    // Offset: 0x278
    ::UnityEngine::UI::Image* chargeAbilityIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image pleaAbilityIcon
    // Size: 0x8
    // Offset: 0x280
    ::UnityEngine::UI::Image* pleaAbilityIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image lightningBlastIcon
    // Size: 0x8
    // Offset: 0x288
    ::UnityEngine::UI::Image* lightningBlastIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image chargeProtectionIcon
    // Size: 0x8
    // Offset: 0x290
    ::UnityEngine::UI::Image* chargeProtectionIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.GameObject useLibramVfx
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::GameObject* useLibramVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject groundSlamVfx
    // Size: 0x8
    // Offset: 0x2A0
    ::UnityEngine::GameObject* groundSlamVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single CBGEPNHBAHC
    // Size: 0x4
    // Offset: 0x2A8
    float CBGEPNHBAHC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EIIJMHFIODO
    // Size: 0x4
    // Offset: 0x2AC
    float EIIJMHFIODO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MILBKFKAMPD
    // Size: 0x4
    // Offset: 0x2B0
    float MILBKFKAMPD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single OIFNPMHPKDN
    // Size: 0x4
    // Offset: 0x2B4
    float OIFNPMHPKDN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FDMJGDPDIMA
    // Size: 0x4
    // Offset: 0x2B8
    float FDMJGDPDIMA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FCCLGGOAGAB
    // Size: 0x4
    // Offset: 0x2BC
    float FCCLGGOAGAB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.UI.Image libramOneIcon
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::UI::Image* libramOneIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image libramTwoIcon
    // Size: 0x8
    // Offset: 0x2C8
    ::UnityEngine::UI::Image* libramTwoIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image libramThreeIcon
    // Size: 0x8
    // Offset: 0x2D0
    ::UnityEngine::UI::Image* libramThreeIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.GameObject libramOne
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::GameObject* libramOne;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject libramTwo
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::GameObject* libramTwo;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject libramThree
    // Size: 0x8
    // Offset: 0x2E8
    ::UnityEngine::GameObject* libramThree;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject libramHolder
    // Size: 0x8
    // Offset: 0x2F0
    ::UnityEngine::GameObject* libramHolder;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject layOnHands
    // Size: 0x8
    // Offset: 0x2F8
    ::UnityEngine::GameObject* layOnHands;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject pleaOfDivinity
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::GameObject* pleaOfDivinity;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject chargedShield
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::GameObject* chargedShield;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Single timeSinceGrippingSecondary
    // Size: 0x4
    // Offset: 0x310
    float timeSinceGrippingSecondary;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single castLayOnHandsAfter
    // Size: 0x4
    // Offset: 0x314
    float castLayOnHandsAfter;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single castPleaofDivinityAfter
    // Size: 0x4
    // Offset: 0x318
    float castPleaofDivinityAfter;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeSinceLightningBlast
    // Size: 0x4
    // Offset: 0x31C
    float timeSinceLightningBlast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lightningBlastEvery
    // Size: 0x4
    // Offset: 0x320
    float lightningBlastEvery;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean CBPBOIIMDJG
    // Size: 0x1
    // Offset: 0x324
    bool CBPBOIIMDJG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CBPBOIIMDJG and: CKOGNIKBCNO
    char __padding84[0x3] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt CKOGNIKBCNO
    // Size: 0x19
    // Offset: 0x328
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt CKOGNIKBCNO;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: CKOGNIKBCNO and: GFFJIJHELOL
    char __padding85[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt GFFJIJHELOL
    // Size: 0x19
    // Offset: 0x348
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt GFFJIJHELOL;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: GFFJIJHELOL and: OIODGDKDKPE
    char __padding86[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt OIODGDKDKPE
    // Size: 0x19
    // Offset: 0x368
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt OIODGDKDKPE;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: OIODGDKDKPE and: DONKDIPIMPJ
    char __padding87[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt DONKDIPIMPJ
    // Size: 0x19
    // Offset: 0x388
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt DONKDIPIMPJ;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: DONKDIPIMPJ and: EJBONLOLNMP
    char __padding88[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt EJBONLOLNMP
    // Size: 0x19
    // Offset: 0x3A8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt EJBONLOLNMP;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: EJBONLOLNMP and: NDPPMHBNGJG
    char __padding89[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt NDPPMHBNGJG
    // Size: 0x19
    // Offset: 0x3C8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt NDPPMHBNGJG;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: NDPPMHBNGJG and: DGFCFCMHMMN
    char __padding90[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt DGFCFCMHMMN
    // Size: 0x19
    // Offset: 0x3E8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt DGFCFCMHMMN;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: DGFCFCMHMMN and: GAEJBDLAPEK
    char __padding91[0x7] = {};
    // private UnityEngine.Vector3 GAEJBDLAPEK
    // Size: 0xC
    // Offset: 0x408
    ::UnityEngine::Vector3 GAEJBDLAPEK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: GAEJBDLAPEK and: hammerHud
    char __padding92[0x4] = {};
    // public UnityEngine.GameObject hammerHud
    // Size: 0x8
    // Offset: 0x418
    ::UnityEngine::GameObject* hammerHud;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean LFJKAKMDCGH
    // Size: 0x1
    // Offset: 0x420
    bool LFJKAKMDCGH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LFJKAKMDCGH and: LLPCCMKIBCO
    char __padding94[0x3] = {};
    // private UnityEngine.Vector3 LLPCCMKIBCO
    // Size: 0xC
    // Offset: 0x424
    ::UnityEngine::Vector3 LLPCCMKIBCO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single JDCCDJBJENB
    // Size: 0x4
    // Offset: 0x430
    float JDCCDJBJENB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KHKAPMNOHDB
    // Size: 0x4
    // Offset: 0x434
    float KHKAPMNOHDB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 LOPKHJPCOLL
    // Size: 0xC
    // Offset: 0x438
    ::UnityEngine::Vector3 LOPKHJPCOLL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion DHNCNHMBJMO
    // Size: 0x10
    // Offset: 0x444
    ::UnityEngine::Quaternion DHNCNHMBJMO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion BIKKNBBEJOO
    // Size: 0x10
    // Offset: 0x454
    ::UnityEngine::Quaternion BIKKNBBEJOO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // [CompilerGeneratedAttribute] Offset: 0xAE3620
    // private System.Single <OOMHLMHDNOK>k__BackingField
    // Size: 0x4
    // Offset: 0x464
    float OOMHLMHDNOK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean layOnHandsReady
    // Size: 0x1
    // Offset: 0x468
    bool layOnHandsReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasTalent32
    // Size: 0x1
    // Offset: 0x469
    bool hasTalent32;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasTalent41
    // Size: 0x1
    // Offset: 0x46A
    bool hasTalent41;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasTalent42
    // Size: 0x1
    // Offset: 0x46B
    bool hasTalent42;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasTalent51
    // Size: 0x1
    // Offset: 0x46C
    bool hasTalent51;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasTalent52
    // Size: 0x1
    // Offset: 0x46D
    bool hasTalent52;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean pleaOfDivinityReady
    // Size: 0x1
    // Offset: 0x46E
    bool pleaOfDivinityReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
