// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: GenericChest
  class GenericChest;
  // Forward declaring type: ItemContainer
  class ItemContainer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PetBreedingStation
  class PetBreedingStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PetBreedingStation);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PetBreedingStation*, "MagicalActual", "PetBreedingStation");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PetBreedingStation
  // [TokenAttribute] Offset: FFFFFFFF
  class PetBreedingStation : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public UnityEngine.Transform[] petSlots
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::Transform*> petSlots;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // public MagicalActual.GenericChest myChest
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::GenericChest* myChest;
    // Field size check
    static_assert(sizeof(::MagicalActual::GenericChest*) == 0x8);
    // private System.Single storageScale
    // Size: 0x4
    // Offset: 0x38
    float storageScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: storageScale and: breedingEffect
    char __padding4[0x4] = {};
    // private UnityEngine.ParticleSystem breedingEffect
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::ParticleSystem* breedingEffect;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private ExtUI.InventoryItemInstance[] BHDOHBEEEDD
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::ExtUI::InventoryItemInstance*> BHDOHBEEEDD;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // private UnityEngine.GameObject[] AIJGDGBGBCN
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::GameObject*> AIJGDGBGBCN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private MagicalActual.ItemContainer LNABACFKNBA
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::ItemContainer* LNABACFKNBA;
    // Field size check
    static_assert(sizeof(::MagicalActual::ItemContainer*) == 0x8);
    // private System.Boolean MINBGAPDCDG
    // Size: 0x1
    // Offset: 0x60
    bool MINBGAPDCDG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public UnityEngine.Transform[] petSlots
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Transform*>& dyn_petSlots();
    // Get instance field reference: public MagicalActual.GenericChest myChest
    [[deprecated("Use field access instead!")]] ::MagicalActual::GenericChest*& dyn_myChest();
