// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PetExplorerTreat
  class PetExplorerTreat;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: WaitForSeconds
  class WaitForSeconds;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PetExplorerStation
  class PetExplorerStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PetExplorerStation);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PetExplorerStation*, "MagicalActual", "PetExplorerStation");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PetExplorerStation
  // [TokenAttribute] Offset: FFFFFFFF
  class PetExplorerStation : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::PetExplorerStation::$ResetTreatPosition$d__13
    class $ResetTreatPosition$d__13;
    // Nested type: ::MagicalActual::PetExplorerStation::$$c
    class $$c;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4B78
    // private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* JANFCAJMFMP;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.Transform treatPosition
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* treatPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private PhysicsInteractable DNHFHHGPOAL
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PhysicsInteractable* DNHFHHGPOAL;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private System.Boolean OKGNEKOLAIB
    // Size: 0x1
    // Offset: 0x38
    bool OKGNEKOLAIB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OKGNEKOLAIB and: DGKNBAHBCDF
    char __padding4[0x7] = {};
    // private UnityEngine.Coroutine DGKNBAHBCDF
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Coroutine* DGKNBAHBCDF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.WaitForSeconds LHPNMKFBNAB
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::WaitForSeconds* LHPNMKFBNAB;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForSeconds*) == 0x8);
    // public MagicalActual.PetExplorerTreat treat
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::PetExplorerTreat* treat;
    // Field size check
    static_assert(sizeof(::MagicalActual::PetExplorerTreat*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_$JANFCAJMFMP$k__BackingField();
    // Get instance field reference: private UnityEngine.Transform treatPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_treatPosition();
    // Get instance field reference: private PhysicsInteractable DNHFHHGPOAL
