// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: SyncedObject
  class SyncedObject;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent`1<T0>
  template<typename T0>
  class UnityEvent_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PhysicsObject
  class PhysicsObject;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PhysicsObject);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PhysicsObject*, "MagicalActual", "PhysicsObject");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PhysicsObject
  // [TokenAttribute] Offset: FFFFFFFF
  class PhysicsObject : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::PhysicsObject::$$c__DisplayClass20_0
    class $$c__DisplayClass20_0;
    // Nested type: ::MagicalActual::PhysicsObject::$$c__DisplayClass20_1
    class $$c__DisplayClass20_1;
    // Nested type: ::MagicalActual::PhysicsObject::$$c
    class $$c;
    public:
    // private System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.Int32 numObjects
    // Size: 0x4
    // Offset: 0x28
    int numObjects;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single timeToBecomeStill
    // Size: 0x4
    // Offset: 0x2C
    float timeToBecomeStill;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Events.UnityEvent`1<System.Boolean> OnDriverChanged
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Events::UnityEvent_1<bool>* OnDriverChanged;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent_1<bool>*) == 0x8);
    // [TooltipAttribute] Offset: 0xAE36C0
    // private System.Collections.Generic.List`1<MagicalActual.SyncedObject> objects
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::MagicalActual::SyncedObject*>* objects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::SyncedObject*>*) == 0x8);
    // private System.Single timeBetweenUpdates
    // Size: 0x4
    // Offset: 0x40
    float timeBetweenUpdates;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAE371C
    // private System.Single driverClearTime
    // Size: 0x4
    // Offset: 0x44
    float driverClearTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FGBOCBOEDGJ
    // Size: 0x4
    // Offset: 0x48
    float FGBOCBOEDGJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3768
    // private System.Boolean <KBPKOOJEMAH>k__BackingField
    // Size: 0x1
    // Offset: 0x4C
    bool KBPKOOJEMAH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean NCLPLPLKJPI
    // Size: 0x1
    // Offset: 0x4D
    bool NCLPLPLKJPI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NCLPLPLKJPI and: DMNHBEIHGMA
    char __padding10[0x2] = {};
    // private UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 IFBAPAKGAAA
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 IFBAPAKGAAA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 DFENKCABNKH
    // Size: 0xC
    // Offset: 0x64
    ::UnityEngine::Vector3 DFENKCABNKH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion DOABLLLCODM
    // Size: 0x10
    // Offset: 0x70
    ::UnityEngine::Quaternion DOABLLLCODM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion GLPCEHFLLEP
    // Size: 0x10
    // Offset: 0x80
    ::UnityEngine::Quaternion GLPCEHFLLEP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: public System.Int32 numObjects
    [[deprecated("Use field access instead!")]] int& dyn_numObjects();
    // Get instance field reference: private System.Single timeToBecomeStill
    [[deprecated("Use field access instead!")]] float& dyn_timeToBecomeStill();
