// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Monster
  class Monster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlantEater
  class PlantEater;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlantEater);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlantEater*, "MagicalActual", "PlantEater");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlantEater
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD3690
  class PlantEater : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.Animator burrowController
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Animator* burrowController;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // public UnityEngine.AudioSource roarSfx
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::AudioSource* roarSfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: public UnityEngine.Animator burrowController
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_burrowController();
    // Get instance field reference: public UnityEngine.AudioSource roarSfx
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_roarSfx();
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9D930
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void NMKJFCIMBGD()
    // Offset: 0xD9D9E4
    void NMKJFCIMBGD();
    // private System.Void EPKPFPGJCBD(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9DA14
    void EPKPFPGJCBD(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void FNMKMDHHFDG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9DADC
    void FNMKMDHHFDG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void NBNKDMCCNJE(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9DB90
    void NBNKDMCCNJE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void KPOAAAHLGLA()
    // Offset: 0xD9DC58
    void KPOAAAHLGLA();
    // public System.Void .ctor()
    // Offset: 0xD9DCB0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlantEater* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::PlantEater::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlantEater*, creationType>()));
    }
    // private System.Void Start()
    // Offset: 0xD9DD08
    void Start();
    // private System.Void APIMIOELFAJ()
    // Offset: 0xD9DD60
    void APIMIOELFAJ();
    // public System.Void BFEOMBNEICE()
    // Offset: 0xD9DDB8
    void BFEOMBNEICE();
    // private System.Void DKJFPDMDIAA(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9DDBC
    void DKJFPDMDIAA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void KGNNMOBOEFG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9DE84
    void KGNNMOBOEFG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void NGBDLGIFKDI(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9DF38
    void NGBDLGIFKDI(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FLBDFAHFMEL(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9DFD0
    void FLBDFAHFMEL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FAEOKNNLGMH(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9E068
    void FAEOKNNLGMH(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JCOFJKJMOAA()
    // Offset: 0xD9E130
    void JCOFJKJMOAA();
    // public System.Void HLGKLABMHHD()
    // Offset: 0xD9E134
    void HLGKLABMHHD();
    // private System.Void NBECKBMFDLK(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9E138
    void NBECKBMFDLK(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void DEGCMEJJNJI()
    // Offset: 0xD9E1D0
    void DEGCMEJJNJI();
    // public System.Void OIPLBADJHFI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E228
    void OIPLBADJHFI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AHPDCIGFMJI()
    // Offset: 0xD9E2DC
    void AHPDCIGFMJI();
    // public System.Void Slash()
    // Offset: 0xD9E334
    void Slash();
    // private System.Void MLGBKBMHHLE()
    // Offset: 0xD9E338
    void MLGBKBMHHLE();
    // public System.Void DLOFIILDEHH()
    // Offset: 0xD9DC28
    void DLOFIILDEHH();
    // private System.Void OMPJCNEMJHG(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9E390
    void OMPJCNEMJHG(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void DMHEBMADKNO()
    // Offset: 0xD9DAAC
    void DMHEBMADKNO();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E428
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void NOLENMEIGLN(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E4DC
    void NOLENMEIGLN(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void NBONGMHAANG()
    // Offset: 0xD9E100
    void NBONGMHAANG();
    // public System.Void PLPDCBMCEJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E590
    void PLPDCBMCEJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GDDMNDHBECL(System.Object OMLPNCLFFMJ)
    // Offset: 0xD9E644
    void GDDMNDHBECL(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void OJGGPJGHPNE()
    // Offset: 0xD9E6DC
    void OJGGPJGHPNE();
    // public System.Void PlayRoar()
    // Offset: 0xD9DE54
    void PlayRoar();
    // public System.Void NNEAIJHCPGH()
    // Offset: 0xD9E70C
    void NNEAIJHCPGH();
    // public System.Void MPHMNDDJIEN()
    // Offset: 0xD9E73C
    void MPHMNDDJIEN();
    // private System.Void OACMGPBCPEL()
    // Offset: 0xD9E76C
    void OACMGPBCPEL();
    // public System.Void PKINMLEHJFB()
    // Offset: 0xD9E7C4
    void PKINMLEHJFB();
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E7C8
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JFBOMHHGFDN()
    // Offset: 0xD9E87C
    void JFBOMHHGFDN();
    // public System.Void AGKHMBHBNFM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E880
    void AGKHMBHBNFM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void IKDGLCBOCJG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0xD9E934
    void IKDGLCBOCJG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HMCPNNAOPLG()
    // Offset: 0xD9E9E8
    void HMCPNNAOPLG();
    // public System.Void OMFMIKPMPEL()
    // Offset: 0xD9E9EC
    void OMFMIKPMPEL();
  }; // MagicalActual.PlantEater
  #pragma pack(pop)
  static check_size<sizeof(PlantEater), 56 + sizeof(::UnityEngine::AudioSource*)> __MagicalActual_PlantEaterSizeCheck;
  static_assert(sizeof(PlantEater) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::PlantEater::EGJMIHFLOKP
// Il2CppName: EGJMIHFLOKP
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::PlantEater::*)(::MagicalActual::NetEntity*)>(&MagicalActual::PlantEater::EGJMIHFLOKP)> {
  static const MethodInfo* get() {
    static auto* CMLIHJCOINC = &::il2cpp_utils::GetClassFromName("MagicalActual", "NetEntity")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::PlantEater*), "EGJMIHFLOKP", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CMLIHJCOINC});
  }
};
// Writing MetadataGetter for method: MagicalActual::PlantEater::NMKJFCIMBGD
// Il2CppName: NMKJFCIMBGD
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::PlantEater::*)()>(&MagicalActual::PlantEater::NMKJFCIMBGD)> {
