// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
  // Forward declaring type: SteamVR_TrackedController
  class SteamVR_TrackedController;
  // Forward declaring type: InteractableObject
  class InteractableObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: DamageAffinity
  struct DamageAffinity;
  // Forward declaring type: DamageParams
  class DamageParams;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: TextMesh
  class TextMesh;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: VectorLine
  class VectorLine;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: PDollarGestureRecognizer
namespace PDollarGestureRecognizer {
  // Forward declaring type: Gesture
  class Gesture;
  // Forward declaring type: Point
  class Point;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Slider
  class Slider;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerWand
  class PlayerWand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerWand);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerWand*, "MagicalActual", "PlayerWand");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x11C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerWand
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerWand : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::PlayerWand::wandState
    struct wandState;
    // Nested type: ::MagicalActual::PlayerWand::$$c__DisplayClass45_0
    class $$c__DisplayClass45_0;
    // Nested type: ::MagicalActual::PlayerWand::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Nested type: ::MagicalActual::PlayerWand::$$c__DisplayClass49_0
    class $$c__DisplayClass49_0;
    // Nested type: ::MagicalActual::PlayerWand::$actionAfterDelayCoroutine$d__51
    class $actionAfterDelayCoroutine$d__51;
    // Nested type: ::MagicalActual::PlayerWand::$$c__DisplayClass53_0
    class $$c__DisplayClass53_0;
    // Nested type: ::MagicalActual::PlayerWand::$$c__DisplayClass53_1
    class $$c__DisplayClass53_1;
    // Nested type: ::MagicalActual::PlayerWand::$$c__DisplayClass54_0
    class $$c__DisplayClass54_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.PlayerWand/wandState
    // [TokenAttribute] Offset: FFFFFFFF
    struct wandState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: wandState
      constexpr wandState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.PlayerWand/wandState FNCIFCNLJBM
      static constexpr const int FNCIFCNLJBM = 0;
      // Get static field: static public MagicalActual.PlayerWand/wandState FNCIFCNLJBM
      static ::MagicalActual::PlayerWand::wandState _get_FNCIFCNLJBM();
      // Set static field: static public MagicalActual.PlayerWand/wandState FNCIFCNLJBM
      static void _set_FNCIFCNLJBM(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState GMDPCEBCCOP
      static constexpr const int GMDPCEBCCOP = 1;
      // Get static field: static public MagicalActual.PlayerWand/wandState GMDPCEBCCOP
      static ::MagicalActual::PlayerWand::wandState _get_GMDPCEBCCOP();
      // Set static field: static public MagicalActual.PlayerWand/wandState GMDPCEBCCOP
      static void _set_GMDPCEBCCOP(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState HHFOPNCDBAN
      static constexpr const int HHFOPNCDBAN = 2;
      // Get static field: static public MagicalActual.PlayerWand/wandState HHFOPNCDBAN
      static ::MagicalActual::PlayerWand::wandState _get_HHFOPNCDBAN();
      // Set static field: static public MagicalActual.PlayerWand/wandState HHFOPNCDBAN
      static void _set_HHFOPNCDBAN(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState GDDPMGGPLPF
      static constexpr const int GDDPMGGPLPF = 4;
      // Get static field: static public MagicalActual.PlayerWand/wandState GDDPMGGPLPF
      static ::MagicalActual::PlayerWand::wandState _get_GDDPMGGPLPF();
      // Set static field: static public MagicalActual.PlayerWand/wandState GDDPMGGPLPF
      static void _set_GDDPMGGPLPF(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState OHHMFBOMPEK
      static constexpr const int OHHMFBOMPEK = 8;
      // Get static field: static public MagicalActual.PlayerWand/wandState OHHMFBOMPEK
      static ::MagicalActual::PlayerWand::wandState _get_OHHMFBOMPEK();
      // Set static field: static public MagicalActual.PlayerWand/wandState OHHMFBOMPEK
      static void _set_OHHMFBOMPEK(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState CAODJGOACON
      static constexpr const int CAODJGOACON = 16;
      // Get static field: static public MagicalActual.PlayerWand/wandState CAODJGOACON
      static ::MagicalActual::PlayerWand::wandState _get_CAODJGOACON();
      // Set static field: static public MagicalActual.PlayerWand/wandState CAODJGOACON
      static void _set_CAODJGOACON(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState BIFOIAKPKCP
      static constexpr const int BIFOIAKPKCP = 32;
      // Get static field: static public MagicalActual.PlayerWand/wandState BIFOIAKPKCP
      static ::MagicalActual::PlayerWand::wandState _get_BIFOIAKPKCP();
      // Set static field: static public MagicalActual.PlayerWand/wandState BIFOIAKPKCP
      static void _set_BIFOIAKPKCP(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState FNOCCEKICKP
      static constexpr const int FNOCCEKICKP = 64;
      // Get static field: static public MagicalActual.PlayerWand/wandState FNOCCEKICKP
      static ::MagicalActual::PlayerWand::wandState _get_FNOCCEKICKP();
      // Set static field: static public MagicalActual.PlayerWand/wandState FNOCCEKICKP
      static void _set_FNOCCEKICKP(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState GLLHPJKINFB
      static constexpr const int GLLHPJKINFB = 128;
      // Get static field: static public MagicalActual.PlayerWand/wandState GLLHPJKINFB
      static ::MagicalActual::PlayerWand::wandState _get_GLLHPJKINFB();
      // Set static field: static public MagicalActual.PlayerWand/wandState GLLHPJKINFB
      static void _set_GLLHPJKINFB(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState ANCLBBAOOMP
      static constexpr const int ANCLBBAOOMP = 256;
      // Get static field: static public MagicalActual.PlayerWand/wandState ANCLBBAOOMP
      static ::MagicalActual::PlayerWand::wandState _get_ANCLBBAOOMP();
      // Set static field: static public MagicalActual.PlayerWand/wandState ANCLBBAOOMP
      static void _set_ANCLBBAOOMP(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState GLHEEKPODJM
      static constexpr const int GLHEEKPODJM = 512;
      // Get static field: static public MagicalActual.PlayerWand/wandState GLHEEKPODJM
      static ::MagicalActual::PlayerWand::wandState _get_GLHEEKPODJM();
      // Set static field: static public MagicalActual.PlayerWand/wandState GLHEEKPODJM
      static void _set_GLHEEKPODJM(::MagicalActual::PlayerWand::wandState value);
      // static field const value: static public MagicalActual.PlayerWand/wandState EHMMBMCFLFE
      static constexpr const int EHMMBMCFLFE = 1024;
      // Get static field: static public MagicalActual.PlayerWand/wandState EHMMBMCFLFE
      static ::MagicalActual::PlayerWand::wandState _get_EHMMBMCFLFE();
      // Set static field: static public MagicalActual.PlayerWand/wandState EHMMBMCFLFE
      static void _set_EHMMBMCFLFE(::MagicalActual::PlayerWand::wandState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.PlayerWand/wandState
    #pragma pack(pop)
    static check_size<sizeof(PlayerWand::wandState), 0 + sizeof(int)> __MagicalActual_PlayerWand_wandStateSizeCheck;
    static_assert(sizeof(PlayerWand::wandState) == 0x4);
    public:
    // public MagicalActual.PlayerCharacter myPlayer
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerCharacter* myPlayer;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // public SteamVR_TrackedController myController
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::SteamVR_TrackedController* myController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_TrackedController*) == 0x8);
    // public UnityEngine.Camera headCamera
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Camera* headCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public UnityEngine.Transform wandTip
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* wandTip;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.TextMesh resultText
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::TextMesh* resultText;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextMesh*) == 0x8);
    // private Vectrosity.VectorLine[] ODFJDNJPMKL
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::Vectrosity::VectorLine*> ODFJDNJPMKL;
    // Field size check
    static_assert(sizeof(::ArrayW<::Vectrosity::VectorLine*>) == 0x8);
    // private System.Int32 GBAINJLBOIK
    // Size: 0x4
    // Offset: 0x48
    int GBAINJLBOIK;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single FNLBLHGMMBL
    // Size: 0x4
    // Offset: 0x4C
    float FNLBLHGMMBL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IEECKABMODP
    // Size: 0x4
    // Offset: 0x50
    float IEECKABMODP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean LMKBPNONGCC
    // Size: 0x1
    // Offset: 0x54
    bool LMKBPNONGCC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LMKBPNONGCC and: JCJMLNLHAMO
    char __padding9[0x3] = {};
    // private System.Collections.Generic.List`1<PDollarGestureRecognizer.Gesture> JCJMLNLHAMO
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Gesture*>* JCJMLNLHAMO;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Gesture*>*) == 0x8);
    // private System.Collections.Generic.List`1<PDollarGestureRecognizer.Point> JJOMPINMIBH
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Point*>* JJOMPINMIBH;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Point*>*) == 0x8);
    // public UnityEngine.GameObject emptyGO
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* emptyGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject[] vfxMissiles
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::GameObject*> vfxMissiles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] vfxBeams
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::GameObject*> vfxBeams;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] vfxEnchants
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::GameObject*> vfxEnchants;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] vfxDomes
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::UnityEngine::GameObject*> vfxDomes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] vfxBlasts
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::UnityEngine::GameObject*> vfxBlasts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] vfxImpacts
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::GameObject*> vfxImpacts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject vfxArcaneRay
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GameObject* vfxArcaneRay;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxArcaneRay_Wait
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* vfxArcaneRay_Wait;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxArcaneHit
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* vfxArcaneHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject magicShield
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* magicShield;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject fireSword
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* fireSword;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Action`1<InteractableObject> MJADHDCEBFA
    // Size: 0x8
    // Offset: 0xC8
    ::System::Action_1<::GlobalNamespace::InteractableObject*>* MJADHDCEBFA;
    // Field size check
    static_assert(sizeof(::System::Action_1<::GlobalNamespace::InteractableObject*>*) == 0x8);
    // private UnityEngine.GameObject BBJPCHFDPJJ
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::GameObject* BBJPCHFDPJJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GFINKLHIDKB
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* GFINKLHIDKB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Action DLOALPPPCPA
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action* DLOALPPPCPA;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Action GNBJOKBJIFF
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action* GNBJOKBJIFF;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public UnityEngine.Material targetingMaterial
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Material* targetingMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.GameObject domeEarth
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* domeEarth;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject domeHeal
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::GameObject* domeHeal;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.UI.Slider playerHealthBar
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::UI::Slider* playerHealthBar;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // private System.Int32 HOCHEMNFAIA
    // Size: 0x4
    // Offset: 0x110
    int HOCHEMNFAIA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 BGJIKHDAJAO
    // Size: 0x4
    // Offset: 0x114
    int BGJIKHDAJAO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MagicalActual.PlayerWand/wandState PEAKPGDDEJN
    // Size: 0x4
    // Offset: 0x118
    ::MagicalActual::PlayerWand::wandState PEAKPGDDEJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerWand::wandState) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.PlayerCharacter myPlayer
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerCharacter*& dyn_myPlayer();
    // Get instance field reference: public SteamVR_TrackedController myController
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::SteamVR_TrackedController*& dyn_myController();
    // Get instance field reference: public UnityEngine.Camera headCamera
    [[deprecated("Use field access instead!")]] ::UnityEngine::Camera*& dyn_headCamera();
    // Get instance field reference: public UnityEngine.Transform wandTip
