// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerTool);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerTool*, "MagicalActual", "PlayerTool");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xB4
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerTool
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerTool : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.Int32 itemId
    // Size: 0x4
    // Offset: 0x18
    int itemId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: itemId and: slotName
    char __padding0[0x4] = {};
    // public System.String slotName
    // Size: 0x8
    // Offset: 0x20
    ::StringW slotName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public ExtUI.InventoryItemInstance inventoryItem
    // Size: 0x8
    // Offset: 0x28
    ::ExtUI::InventoryItemInstance* inventoryItem;
    // Field size check
    static_assert(sizeof(::ExtUI::InventoryItemInstance*) == 0x8);
    // public System.Boolean autoSnapBack
    // Size: 0x1
    // Offset: 0x30
    bool autoSnapBack;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isHidden
    // Size: 0x1
    // Offset: 0x31
    bool isHidden;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isHidden and: snapBackDelay
    char __padding4[0x2] = {};
    // public System.Single snapBackDelay
    // Size: 0x4
    // Offset: 0x34
    float snapBackDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 toolBeltOffset
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 toolBeltOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 toolBeltOrientation
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 toolBeltOrientation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Transform ONANMANNPAN
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* ONANMANNPAN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 JBAJFMHBCMD
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 JBAJFMHBCMD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion IDFEBFFILHO
    // Size: 0x10
    // Offset: 0x64
    ::UnityEngine::Quaternion IDFEBFFILHO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 POLONKMGCDN
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 POLONKMGCDN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public System.Boolean isGrabbed
    // Size: 0x1
    // Offset: 0x88
    bool isGrabbed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean inAir
    // Size: 0x1
    // Offset: 0x89
    bool inAir;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inAir and: currentGrabber
    char __padding14[0x6] = {};
    // public MagicalActual.Grabber currentGrabber
    // Size: 0x8
    // Offset: 0x90
    ::MagicalActual::Grabber* currentGrabber;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private UnityEngine.GameObject GHHPIHJAGCG
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* GHHPIHJAGCG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.PlayerAvatar myAvatar
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::PlayerAvatar* myAvatar;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4C48
    // private PhysicsInteractable <NPOPILONGLE>k__BackingField
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::PhysicsInteractable* NPOPILONGLE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private System.Int32 IGOPFAFMIIP
    // Size: 0x4
    // Offset: 0xB0
    int IGOPFAFMIIP;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Int32 itemId
    [[deprecated("Use field access instead!")]] int& dyn_itemId();
    // Get instance field reference: public System.String slotName
    [[deprecated("Use field access instead!")]] ::StringW& dyn_slotName();
    // Get instance field reference: public ExtUI.InventoryItemInstance inventoryItem
    [[deprecated("Use field access instead!")]] ::ExtUI::InventoryItemInstance*& dyn_inventoryItem();
    // Get instance field reference: public System.Boolean autoSnapBack
    [[deprecated("Use field access instead!")]] bool& dyn_autoSnapBack();
    // Get instance field reference: public System.Boolean isHidden
    [[deprecated("Use field access instead!")]] bool& dyn_isHidden();
