// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: MeshFilter
  class MeshFilter;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PointOfInterest
  class PointOfInterest;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCompass
  class PlayerCompass;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerCompass);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerCompass*, "MagicalActual", "PlayerCompass");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x140
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerCompass
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerCompass : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.GameObject interestIconPrefab
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* interestIconPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.PointOfInterest[] interestPoints
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::MagicalActual::PointOfInterest*> interestPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::PointOfInterest*>) == 0x8);
    // private UnityEngine.GameObject[] ILLFCNHBIKG
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::GameObject*> ILLFCNHBIKG;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.GameObject[] OMJCBKBMDCE
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::GameObject*> OMJCBKBMDCE;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.GameObject[] FBHPEBCOIPB
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::GameObject*> FBHPEBCOIPB;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.Vector3[] ALGOLICMILN
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Vector3> ALGOLICMILN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.String MIAOHMKMKCC
    // Size: 0x8
    // Offset: 0x48
    ::StringW MIAOHMKMKCC;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.UI.Text headingText
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::UI::Text* headingText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.Canvas headingCanvas
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Canvas* headingCanvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private UnityEngine.RaycastHit EIEFDCNCGKG
    // Size: 0x2C
    // Offset: 0x60
    ::UnityEngine::RaycastHit EIEFDCNCGKG;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // Padding between fields: EIEFDCNCGKG and: EMCGJCFHFJI
    char __padding9[0x4] = {};
    // private System.String EMCGJCFHFJI
    // Size: 0x8
    // Offset: 0x90
    ::StringW EMCGJCFHFJI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.GameObject DDLBKIGHGOB
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* DDLBKIGHGOB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean ILGPCBIMPEN
    // Size: 0x1
    // Offset: 0xA0
    bool ILGPCBIMPEN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ILGPCBIMPEN and: journalNotification
    char __padding12[0x7] = {};
    // public UnityEngine.GameObject journalNotification
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* journalNotification;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject journalNotificationOnBody
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* journalNotificationOnBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean showJournalNotification
    // Size: 0x1
    // Offset: 0xB8
    bool showJournalNotification;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showJournalNotification and: ONANMANNPAN
    char __padding15[0x7] = {};
    // private UnityEngine.Transform ONANMANNPAN
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Transform* ONANMANNPAN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 JBAJFMHBCMD
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 JBAJFMHBCMD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion IDFEBFFILHO
    // Size: 0x10
    // Offset: 0xD4
    ::UnityEngine::Quaternion IDFEBFFILHO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: IDFEBFFILHO and: EIPMBKLODIJ
    char __padding18[0x4] = {};
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Color BFNNPEJHIMA
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Color BFNNPEJHIMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.MeshRenderer HCMCDILAJCJ
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::MeshRenderer* HCMCDILAJCJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private MagicalActual.Grabber CJFDOLCPAJO
    // Size: 0x8
    // Offset: 0x108
    ::MagicalActual::Grabber* CJFDOLCPAJO;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private System.Int32 IGOPFAFMIIP
    // Size: 0x4
    // Offset: 0x110
    int IGOPFAFMIIP;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 BKHJIJOKPLF
    // Size: 0x4
    // Offset: 0x114
    int BKHJIJOKPLF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single MFEENEOGJGH
    // Size: 0x4
    // Offset: 0x118
    float MFEENEOGJGH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IDAFGBNBFDN
    // Size: 0x4
    // Offset: 0x11C
    float IDAFGBNBFDN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean AGBIINGAONI
    // Size: 0x1
    // Offset: 0x120
    bool AGBIINGAONI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AGBIINGAONI and: typeMeshes
    char __padding27[0x7] = {};
    // public UnityEngine.Mesh[] typeMeshes
    // Size: 0x8
    // Offset: 0x128
    ::ArrayW<::UnityEngine::Mesh*> typeMeshes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // private UnityEngine.MeshFilter LDNPJGPFLBN
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::MeshFilter* LDNPJGPFLBN;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // public UnityEngine.GameObject[] switchVfx
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::UnityEngine::GameObject*> switchVfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject interestIconPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_interestIconPrefab();
    // Get instance field reference: public MagicalActual.PointOfInterest[] interestPoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::MagicalActual::PointOfInterest*>& dyn_interestPoints();
    // Get instance field reference: private UnityEngine.GameObject[] ILLFCNHBIKG
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_ILLFCNHBIKG();
    // Get instance field reference: private UnityEngine.GameObject[] OMJCBKBMDCE
