// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ReadableBook
  class ReadableBook;
  // Forward declaring type: JournalButton
  class JournalButton;
  // Forward declaring type: JournalPages
  class JournalPages;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerJournal
  class PlayerJournal;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerJournal);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerJournal*, "MagicalActual", "PlayerJournal");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerJournal
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerJournal : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [CompilerGeneratedAttribute] Offset: 0xAE4BA8
    // private MagicalActual.ReadableBook <ONPMLIFBKDJ>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::ReadableBook* ONPMLIFBKDJ;
    // Field size check
    static_assert(sizeof(::MagicalActual::ReadableBook*) == 0x8);
    // private System.Boolean NJPCBIGJIAI
    // Size: 0x1
    // Offset: 0x20
    bool NJPCBIGJIAI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NJPCBIGJIAI and: KIEBOFHNHOI
    char __padding1[0x7] = {};
    // private System.String KIEBOFHNHOI
    // Size: 0x8
    // Offset: 0x28
    ::StringW KIEBOFHNHOI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String ICLJLILHCFB
    // Size: 0x8
    // Offset: 0x30
    ::StringW ICLJLILHCFB;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean isOpen
    // Size: 0x1
    // Offset: 0x38
    bool isOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean FIKMEGAJPFO
    // Size: 0x1
    // Offset: 0x39
    bool FIKMEGAJPFO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: FIKMEGAJPFO and: JGOGJDHABHN
    char __padding5[0x6] = {};
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.GameObject IJLNDPNACFG
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* IJLNDPNACFG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.JournalButton> bookmarkButtons
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::MagicalActual::JournalButton*>* bookmarkButtons;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::JournalButton*>*) == 0x8);
    // private System.Int32[] HOEHCOJENIB
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<int> HOEHCOJENIB;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Boolean intitialLogin
    // Size: 0x1
    // Offset: 0x60
    bool intitialLogin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.ReadableBook <ONPMLIFBKDJ>k__BackingField
    [[deprecated("Use field access instead!")]] ::MagicalActual::ReadableBook*& dyn_$ONPMLIFBKDJ$k__BackingField();
    // Get instance field reference: private System.Boolean NJPCBIGJIAI
    [[deprecated("Use field access instead!")]] bool& dyn_NJPCBIGJIAI();
    // Get instance field reference: private System.String KIEBOFHNHOI
    [[deprecated("Use field access instead!")]] ::StringW& dyn_KIEBOFHNHOI();
    // Get instance field reference: private System.String ICLJLILHCFB
    [[deprecated("Use field access instead!")]] ::StringW& dyn_ICLJLILHCFB();
    // Get instance field reference: public System.Boolean isOpen
