// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MagicalActual.PlayerAvatar
#include "MagicalActual/PlayerAvatar.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: WorldMenu
  class WorldMenu;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerAvatar::$$c__DisplayClass562_0);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerAvatar::$$c__DisplayClass562_0*, "MagicalActual", "PlayerAvatar/<>c__DisplayClass562_0");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerAvatar/<>c__DisplayClass562_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: AD3724
  class PlayerAvatar::$$c__DisplayClass562_0 : public ::Il2CppObject {
    public:
    public:
    // public MagicalActual.PlayerAvatar CGMCLOBOBCB
    // Size: 0x8
    // Offset: 0x10
    ::MagicalActual::PlayerAvatar* CGMCLOBOBCB;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // public MagicalActual.PlayerAvatar CGNCHENEOFD
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerAvatar* CGNCHENEOFD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // public System.Action CKBEJEFBFDA
    // Size: 0x8
    // Offset: 0x20
    ::System::Action* CKBEJEFBFDA;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action MPOPEJOKBOE
    // Size: 0x8
    // Offset: 0x28
    ::System::Action* MPOPEJOKBOE;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action GPOMAFCCMLJ
    // Size: 0x8
    // Offset: 0x30
    ::System::Action* GPOMAFCCMLJ;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action OJKFDPMBCNH
    // Size: 0x8
    // Offset: 0x38
    ::System::Action* OJKFDPMBCNH;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action`1<MagicalActual.WorldMenu> FNMJAPBHFIB
    // Size: 0x8
    // Offset: 0x40
    ::System::Action_1<::MagicalActual::WorldMenu*>* FNMJAPBHFIB;
    // Field size check
    static_assert(sizeof(::System::Action_1<::MagicalActual::WorldMenu*>*) == 0x8);
    // public System.Action`1<MagicalActual.WorldMenu> AGOFBJEDABN
    // Size: 0x8
    // Offset: 0x48
    ::System::Action_1<::MagicalActual::WorldMenu*>* AGOFBJEDABN;
    // Field size check
    static_assert(sizeof(::System::Action_1<::MagicalActual::WorldMenu*>*) == 0x8);
    // public System.Action`1<MagicalActual.WorldMenu> LDJDEGKFFIP
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<::MagicalActual::WorldMenu*>* LDJDEGKFFIP;
    // Field size check
    static_assert(sizeof(::System::Action_1<::MagicalActual::WorldMenu*>*) == 0x8);
    // public System.Action`1<MagicalActual.WorldMenu> GJFPIHCGIAO
    // Size: 0x8
    // Offset: 0x58
    ::System::Action_1<::MagicalActual::WorldMenu*>* GJFPIHCGIAO;
    // Field size check
    static_assert(sizeof(::System::Action_1<::MagicalActual::WorldMenu*>*) == 0x8);
    public:
    // Get instance field reference: public MagicalActual.PlayerAvatar CGMCLOBOBCB
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerAvatar*& dyn_CGMCLOBOBCB();
    // Get instance field reference: public MagicalActual.PlayerAvatar CGNCHENEOFD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerAvatar*& dyn_CGNCHENEOFD();
    // Get instance field reference: public System.Action CKBEJEFBFDA
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_CKBEJEFBFDA();
    // Get instance field reference: public System.Action MPOPEJOKBOE
    [[deprecated("Use field access instead!")]] ::System::Action*& dyn_MPOPEJOKBOE();
    // Get instance field reference: public System.Action GPOMAFCCMLJ
