// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MagicalActual.PlayerCharacter
#include "MagicalActual/PlayerCharacter.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerCharacter::$$c__DisplayClass302_0);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerCharacter::$$c__DisplayClass302_0*, "MagicalActual", "PlayerCharacter/<>c__DisplayClass302_0");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x1A
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerCharacter/<>c__DisplayClass302_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: AD3898
  class PlayerCharacter::$$c__DisplayClass302_0 : public ::Il2CppObject {
    public:
    public:
    // public System.UInt16 OKHJOGGIHMO
    // Size: 0x2
    // Offset: 0x10
    uint16_t OKHJOGGIHMO;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.Byte LFADFNPJCAK
    // Size: 0x1
    // Offset: 0x12
    uint8_t LFADFNPJCAK;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: LFADFNPJCAK and: BLGECEHGMJH
    char __padding1[0x1] = {};
    // public System.Int32 BLGECEHGMJH
    // Size: 0x4
    // Offset: 0x14
    int BLGECEHGMJH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.UInt16 CEGLKGFCNPJ
    // Size: 0x2
    // Offset: 0x18
    uint16_t CEGLKGFCNPJ;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    public:
    // Get instance field reference: public System.UInt16 OKHJOGGIHMO
    [[deprecated("Use field access instead!")]] uint16_t& dyn_OKHJOGGIHMO();
    // Get instance field reference: public System.Byte LFADFNPJCAK
    [[deprecated("Use field access instead!")]] uint8_t& dyn_LFADFNPJCAK();
    // Get instance field reference: public System.Int32 BLGECEHGMJH
    [[deprecated("Use field access instead!")]] int& dyn_BLGECEHGMJH();
    // Get instance field reference: public System.UInt16 CEGLKGFCNPJ
    [[deprecated("Use field access instead!")]] uint16_t& dyn_CEGLKGFCNPJ();
    // System.Void CMEKMHDBBML(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4EEE0
    void CMEKMHDBBML(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void PMNECMGNONE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4EFA0
    void PMNECMGNONE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void KBKCIGBBJJG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F060
    void KBKCIGBBJJG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BPCBFPGNPEP(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F120
    void BPCBFPGNPEP(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void CANCNEKGNLC(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F1E0
    void CANCNEKGNLC(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BLHPGGGEDNC(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F2A0
    void BLHPGGGEDNC(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void KFIKMOGBIAE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F360
    void KFIKMOGBIAE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LDJPIFBLBNL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F420
    void LDJPIFBLBNL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void KPHGGIOKOHA(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F4E0
    void KPHGGIOKOHA(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void ILABHKBCFHA(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F5A0
    void ILABHKBCFHA(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void KCHIJFLEDIJ(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F660
    void KCHIJFLEDIJ(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void CPLNIEOKFKN(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F720
    void CPLNIEOKFKN(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void GDBHAIMILGD(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F7E0
    void GDBHAIMILGD(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void IFNBFGHGKJO(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F8A0
    void IFNBFGHGKJO(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JDFICCPENBG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4F960
    void JDFICCPENBG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MOCALFCMCHF(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FA20
    void MOCALFCMCHF(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LFGPBLOODBG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FAE0
    void LFGPBLOODBG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void NNBADPAMMDH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FBA0
    void NNBADPAMMDH(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BJPLJFDKPDE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FC60
    void BJPLJFDKPDE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void GPKFNOFJJMG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FD20
    void GPKFNOFJJMG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LLOLOOCFDLB(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FDE0
    void LLOLOOCFDLB(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void FOLKLPDBKDH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FEA0
    void FOLKLPDBKDH(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void EDLFGIMCJIJ(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4FF60
    void EDLFGIMCJIJ(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LFFPMJBFMBN(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E50020
    void LFFPMJBFMBN(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void DDBOPMMEDJA(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E500E0
    void DDBOPMMEDJA(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void OJGHPKCMFKM(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E501A0
    void OJGHPKCMFKM(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void AJLBNJHFCGF(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E50260
    void AJLBNJHFCGF(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LEPLEGJPEBF(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E50320
    void LEPLEGJPEBF(::System::IO::BinaryWriter* FFJEENIEPJH);
    // public System.Void .ctor()
    // Offset: 0x1E503E0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlayerCharacter::$$c__DisplayClass302_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::PlayerCharacter::$$c__DisplayClass302_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlayerCharacter::$$c__DisplayClass302_0*, creationType>()));
    }
    // System.Void FDAPGBNBONK(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E503E8
    void FDAPGBNBONK(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void OGHGLMOBLCH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E504A8
    void OGHGLMOBLCH(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LAMEAEDDLAG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E50568
    void LAMEAEDDLAG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LNCDJOJAIGK(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E50628
    void LNCDJOJAIGK(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LBJHFLMNDOH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E506E8
    void LBJHFLMNDOH(::System::IO::BinaryWriter* FFJEENIEPJH);
  }; // MagicalActual.PlayerCharacter/<>c__DisplayClass302_0
  #pragma pack(pop)
  static check_size<sizeof(PlayerCharacter::$$c__DisplayClass302_0), 24 + sizeof(uint16_t)> __MagicalActual_PlayerCharacter_$$c__DisplayClass302_0SizeCheck;
  static_assert(sizeof(PlayerCharacter::$$c__DisplayClass302_0) == 0x1A);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::PlayerCharacter::$$c__DisplayClass302_0::CMEKMHDBBML
// Il2CppName: CMEKMHDBBML
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::PlayerCharacter::$$c__DisplayClass302_0::*)(::System::IO::BinaryWriter*)>(&MagicalActual::PlayerCharacter::$$c__DisplayClass302_0::CMEKMHDBBML)> {
  static const MethodInfo* get() {
    static auto* FFJEENIEPJH = &::il2cpp_utils::GetClassFromName("System.IO", "BinaryWriter")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::PlayerCharacter::$$c__DisplayClass302_0*), "CMEKMHDBBML", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{FFJEENIEPJH});
  }
};
// Writing MetadataGetter for method: MagicalActual::PlayerCharacter::$$c__DisplayClass302_0::PMNECMGNONE
// Il2CppName: PMNECMGNONE
template<>
