// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPooling
#include "GlobalNamespace/IPooling.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: HoverOverGround
  class HoverOverGround;
  // Forward declaring type: PlayerTool
  class PlayerTool;
  // Forward declaring type: TopHud
  class TopHud;
  // Forward declaring type: FaceController
  class FaceController;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: AvatarAppearance
  class AvatarAppearance;
  // Forward declaring type: Teleporter
  class Teleporter;
  // Forward declaring type: FakeTeleporter
  class FakeTeleporter;
  // Forward declaring type: SpecialPopupManager
  class SpecialPopupManager;
  // Forward declaring type: WorldMenu
  class WorldMenu;
  // Forward declaring type: ObjectHighlighter
  class ObjectHighlighter;
  // Forward declaring type: Grabber
  class Grabber;
  // Forward declaring type: PlayerMount
  class PlayerMount;
  // Forward declaring type: GrindToolDeployed
  class GrindToolDeployed;
  // Forward declaring type: BoostBombDeployed
  class BoostBombDeployed;
  // Forward declaring type: BoostBomb
  class BoostBomb;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Cloth
  class Cloth;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Color32
  struct Color32;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
  // Forward declaring type: ProgressBarPro
  class ProgressBarPro;
  // Forward declaring type: SKManager
  class SKManager;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerAvatar);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerAvatar*, "MagicalActual", "PlayerAvatar");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x708
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerAvatar
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerAvatar : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPooling*/ {
    public:
    // Nested type: ::MagicalActual::PlayerAvatar::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::PlayerAvatar::orbusNetIncomingIdx
    struct orbusNetIncomingIdx;
    // Nested type: ::MagicalActual::PlayerAvatar::fxTexturesTypes
    struct fxTexturesTypes;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass530_0
    class $$c__DisplayClass530_0;
    // Nested type: ::MagicalActual::PlayerAvatar::$equipGear$d__536
    class $equipGear$d__536;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass540_0
    class $$c__DisplayClass540_0;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass562_0
    class $$c__DisplayClass562_0;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass562_1
    class $$c__DisplayClass562_1;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass562_2
    class $$c__DisplayClass562_2;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass562_3
    class $$c__DisplayClass562_3;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c
    class $$c;
    // Nested type: ::MagicalActual::PlayerAvatar::$$c__DisplayClass574_0
    class $$c__DisplayClass574_0;
    public:
    // public System.Boolean isDummyAvatar
    // Size: 0x1
    // Offset: 0x18
    bool isDummyAvatar;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isDummyAvatar and: leftController
    char __padding0[0x7] = {};
    // public UnityEngine.GameObject leftController
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* leftController;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject rightController
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* rightController;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playerBase
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* playerBase;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playerHead
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* playerHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Transform playerMountPosition
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* playerMountPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform startSummonMountPosition
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* startSummonMountPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private MagicalActual.HoverOverGround IMNMNEKLEBO
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::HoverOverGround* IMNMNEKLEBO;
    // Field size check
    static_assert(sizeof(::MagicalActual::HoverOverGround*) == 0x8);
    // private UnityEngine.GameObject LNKGODGNNFD
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* LNKGODGNNFD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HODKEKHJBCJ
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* HODKEKHJBCJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.PlayerTool[] BBJOBDADDEN
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::MagicalActual::PlayerTool*> BBJOBDADDEN;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::PlayerTool*>) == 0x8);
    // private MagicalActual.PlayerTool[] AEJFAKIPNAD
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::MagicalActual::PlayerTool*> AEJFAKIPNAD;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::PlayerTool*>) == 0x8);
    // private ExtUI.InventoryItemInstance ENJHIMCGIGG
    // Size: 0x8
    // Offset: 0x78
    ::ExtUI::InventoryItemInstance* ENJHIMCGIGG;
    // Field size check
    static_assert(sizeof(::ExtUI::InventoryItemInstance*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x80
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single timeWhenPingSent
    // Size: 0x4
    // Offset: 0x88
    float timeWhenPingSent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean localControl
    // Size: 0x1
    // Offset: 0x8C
    bool localControl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: localControl and: topHud
    char __padding15[0x3] = {};
    // public MagicalActual.TopHud topHud
    // Size: 0x8
    // Offset: 0x90
    ::MagicalActual::TopHud* topHud;
    // Field size check
    static_assert(sizeof(::MagicalActual::TopHud*) == 0x8);
    // public UnityEngine.GameObject vfxLeveled
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* vfxLeveled;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public SuperTextMesh resurrectCooldownTimer
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::SuperTextMesh* resurrectCooldownTimer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.Material playerSkinMaterial
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Material* playerSkinMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material playerGhostMaterial
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Material* playerGhostMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material dyedGearMaterial
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Material* dyedGearMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE37F8
    // private MagicalActual.FaceController <MDJMKEKMEDF>k__BackingField
    // Size: 0x8
    // Offset: 0xC0
    ::MagicalActual::FaceController* MDJMKEKMEDF;
    // Field size check
    static_assert(sizeof(::MagicalActual::FaceController*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3808
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.Vector3> <IPCEPLFGLJP>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Vector3>* IPCEPLFGLJP;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Vector3>*) == 0x8);
    // public UnityEngine.GameObject isSpeakingIndicator
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::GameObject* isSpeakingIndicator;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject isMutedIndicator
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::GameObject* isMutedIndicator;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single EJMFFBGJLPP
    // Size: 0x4
    // Offset: 0xE0
    float EJMFFBGJLPP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EGMFFJEMCEK
    // Size: 0x4
    // Offset: 0xE4
    float EGMFFJEMCEK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3828
    // private System.Boolean <NJGOJGLAKLL>k__BackingField
    // Size: 0x1
    // Offset: 0xE8
    bool NJGOJGLAKLL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NJGOJGLAKLL and: speakerVolume
    char __padding28[0x7] = {};
    // public System.Double speakerVolume
    // Size: 0x8
    // Offset: 0xF0
    double speakerVolume;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private UnityEngine.GameObject FNPNJLGDPKJ
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* FNPNJLGDPKJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject commsTemplate
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::GameObject* commsTemplate;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.String KIPDGIFLKIA
    // Size: 0x8
    // Offset: 0x108
    ::StringW KIPDGIFLKIA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean EPFEEANIFMM
    // Size: 0x1
    // Offset: 0x110
    bool EPFEEANIFMM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EPFEEANIFMM and: JNPPMCGLMFG
    char __padding33[0x3] = {};
    // private System.Single JNPPMCGLMFG
    // Size: 0x4
    // Offset: 0x114
    float JNPPMCGLMFG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3838
    // private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::MagicalActual::NetEntity* JANFCAJMFMP;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public MagicalActual.PlayerClass[] classObjects
    // Size: 0x8
    // Offset: 0x120
    ::ArrayW<::MagicalActual::PlayerClass*> classObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::PlayerClass*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.GameObject> OELAHBEGJKL
    // Size: 0x8
    // Offset: 0x128
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::GameObject*>* OELAHBEGJKL;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::GameObject*>*) == 0x8);
    // public MagicalActual.PlayerClass currentActiveClass
    // Size: 0x8
    // Offset: 0x130
    ::MagicalActual::PlayerClass* currentActiveClass;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // public UnityEngine.GameObject playerHud
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* playerHud;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public ProgressBarPro superBar
    // Size: 0x8
    // Offset: 0x140
    ::GlobalNamespace::ProgressBarPro* superBar;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // public ProgressBarPro classBar
    // Size: 0x8
    // Offset: 0x148
    ::GlobalNamespace::ProgressBarPro* classBar;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // public ProgressBarPro staminaBar
    // Size: 0x8
    // Offset: 0x150
    ::GlobalNamespace::ProgressBarPro* staminaBar;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ProgressBarPro*) == 0x8);
    // public SuperTextMesh bountyStatus
    // Size: 0x8
    // Offset: 0x158
    ::GlobalNamespace::SuperTextMesh* bountyStatus;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.UI.Text classBarText
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::UI::Text* classBarText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3878
    // private System.Collections.Generic.Dictionary`2<System.String,ExtUI.InventoryItemInstance> <BLIGDKCIIJK>k__BackingField
    // Size: 0x8
    // Offset: 0x168
    ::System::Collections::Generic::Dictionary_2<::StringW, ::ExtUI::InventoryItemInstance*>* BLIGDKCIIJK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::ExtUI::InventoryItemInstance*>*) == 0x8);
    // private System.Int32[] CGDANEKHMFP
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<int> CGDANEKHMFP;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Single EAPFFFHGLBE
    // Size: 0x4
    // Offset: 0x178
    float EAPFFFHGLBE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EHKCPKLHIKC
    // Size: 0x4
    // Offset: 0x17C
    float EHKCPKLHIKC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean OJJKGAADEAC
    // Size: 0x1
    // Offset: 0x180
    bool OJJKGAADEAC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OJJKGAADEAC and: GPPLIOOEONI
    char __padding49[0x3] = {};
    // private System.Int32 GPPLIOOEONI
    // Size: 0x4
    // Offset: 0x184
    int GPPLIOOEONI;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3888
    // private MagicalActual.Monster <INCGNEHCAOC>k__BackingField
    // Size: 0x8
    // Offset: 0x188
    ::MagicalActual::Monster* INCGNEHCAOC;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private MagicalActual.AvatarAppearance EOFFJKCJLIP
    // Size: 0x8
    // Offset: 0x190
    ::MagicalActual::AvatarAppearance* EOFFJKCJLIP;
    // Field size check
    static_assert(sizeof(::MagicalActual::AvatarAppearance*) == 0x8);
    // public SKManager myManager
    // Size: 0x8
    // Offset: 0x198
    ::GlobalNamespace::SKManager* myManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SKManager*) == 0x8);
    // private UnityEngine.Cloth FCFOCFPODJI
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::Cloth* FCFOCFPODJI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Cloth*) == 0x8);
    // public UnityEngine.GameObject grabberLeft
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::GameObject* grabberLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject grabberRight
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::GameObject* grabberRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject JHHLCOENFIL
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::GameObject* JHHLCOENFIL;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject PLAGOGDIKML
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::GameObject* PLAGOGDIKML;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.Teleporter AICFMHMHDEN
    // Size: 0x8
    // Offset: 0x1C8
    ::MagicalActual::Teleporter* AICFMHMHDEN;
    // Field size check
    static_assert(sizeof(::MagicalActual::Teleporter*) == 0x8);
    // private MagicalActual.Teleporter JGLMNDDNPLM
    // Size: 0x8
    // Offset: 0x1D0
    ::MagicalActual::Teleporter* JGLMNDDNPLM;
    // Field size check
    static_assert(sizeof(::MagicalActual::Teleporter*) == 0x8);
    // public UnityEngine.GameObject fakeTeleporterLeft
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::GameObject* fakeTeleporterLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject fakeTeleporterRight
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::GameObject* fakeTeleporterRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.FakeTeleporter JEOOBEJBGAI
    // Size: 0x8
    // Offset: 0x1E8
    ::MagicalActual::FakeTeleporter* JEOOBEJBGAI;
    // Field size check
    static_assert(sizeof(::MagicalActual::FakeTeleporter*) == 0x8);
    // private MagicalActual.FakeTeleporter HGFPENCJOND
    // Size: 0x8
    // Offset: 0x1F0
    ::MagicalActual::FakeTeleporter* HGFPENCJOND;
    // Field size check
    static_assert(sizeof(::MagicalActual::FakeTeleporter*) == 0x8);
    // public UnityEngine.GameObject headGearSlot
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::GameObject* headGearSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject headGearSlotLod1
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::GameObject* headGearSlotLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject chestGearSlot
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::GameObject* chestGearSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject chestGearSlotLod1
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::GameObject* chestGearSlotLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject gloveGearSlotLeft
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::GameObject* gloveGearSlotLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject gloveGearSlotLeftLod1
    // Size: 0x8
    // Offset: 0x220
    ::UnityEngine::GameObject* gloveGearSlotLeftLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject gloveGearSlotRight
    // Size: 0x8
    // Offset: 0x228
    ::UnityEngine::GameObject* gloveGearSlotRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject gloveGearSlotRightLod1
    // Size: 0x8
    // Offset: 0x230
    ::UnityEngine::GameObject* gloveGearSlotRightLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject shoulerGearSlot
    // Size: 0x8
    // Offset: 0x238
    ::UnityEngine::GameObject* shoulerGearSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject shoulderGearSlotLod1
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::GameObject* shoulderGearSlotLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject backGearSlot
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::GameObject* backGearSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject backGearSlotLod1
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::GameObject* backGearSlotLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject wristGearSlotLeft
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::GameObject* wristGearSlotLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject wristGearSlotRight
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::GameObject* wristGearSlotRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject ringGearSlotLeft
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::GameObject* ringGearSlotLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject ringGearSlotRight
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::GameObject* ringGearSlotRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject hairSlot
    // Size: 0x8
    // Offset: 0x278
    ::UnityEngine::GameObject* hairSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject hairSlotLod1
    // Size: 0x8
    // Offset: 0x280
    ::UnityEngine::GameObject* hairSlotLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject hairClippedSlot
    // Size: 0x8
    // Offset: 0x288
    ::UnityEngine::GameObject* hairClippedSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject hairClippedSlotLod1
    // Size: 0x8
    // Offset: 0x290
    ::UnityEngine::GameObject* hairClippedSlotLod1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject noseSlot
    // Size: 0x8
    // Offset: 0x298
    ::UnityEngine::GameObject* noseSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject earSlot
    // Size: 0x8
    // Offset: 0x2A0
    ::UnityEngine::GameObject* earSlot;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject backpackLevel1
    // Size: 0x8
    // Offset: 0x2A8
    ::UnityEngine::GameObject* backpackLevel1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject backpackLevel2
    // Size: 0x8
    // Offset: 0x2B0
    ::UnityEngine::GameObject* backpackLevel2;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Renderer[] lod0Renderers
    // Size: 0x8
    // Offset: 0x2B8
    ::ArrayW<::UnityEngine::Renderer*> lod0Renderers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Renderer*>) == 0x8);
    // public UnityEngine.Renderer[] lod1Renderers
    // Size: 0x8
    // Offset: 0x2C0
    ::ArrayW<::UnityEngine::Renderer*> lod1Renderers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Renderer*>) == 0x8);
    // public UnityEngine.Renderer[] lod2Renderers
    // Size: 0x8
    // Offset: 0x2C8
    ::ArrayW<::UnityEngine::Renderer*> lod2Renderers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Renderer*>) == 0x8);
    // public UnityEngine.Renderer[] lod3Renderers
    // Size: 0x8
    // Offset: 0x2D0
    ::ArrayW<::UnityEngine::Renderer*> lod3Renderers;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Renderer*>) == 0x8);
    // public UnityEngine.UI.Image slot1CooldownGraphic
    // Size: 0x8
    // Offset: 0x2D8
    ::UnityEngine::UI::Image* slot1CooldownGraphic;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image slot2CooldownGraphic
    // Size: 0x8
    // Offset: 0x2E0
    ::UnityEngine::UI::Image* slot2CooldownGraphic;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Single PHCOFDILEIP
    // Size: 0x4
    // Offset: 0x2E8
    float PHCOFDILEIP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MPKHODMLNJL
    // Size: 0x4
    // Offset: 0x2EC
    float MPKHODMLNJL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FIPALALHGAM
    // Size: 0x4
    // Offset: 0x2F0
    float FIPALALHGAM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NPPFNIGKMBA
    // Size: 0x4
    // Offset: 0x2F4
    float NPPFNIGKMBA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.GameObject[] teleportTrailPrefabs
    // Size: 0x8
    // Offset: 0x2F8
    ::ArrayW<::UnityEngine::GameObject*> teleportTrailPrefabs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject enemyDisplay
    // Size: 0x8
    // Offset: 0x300
    ::UnityEngine::GameObject* enemyDisplay;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject soulDisplay
    // Size: 0x8
    // Offset: 0x308
    ::UnityEngine::GameObject* soulDisplay;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject lod3Display
    // Size: 0x8
    // Offset: 0x310
    ::UnityEngine::GameObject* lod3Display;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public SuperTextMesh runeNotification
    // Size: 0x8
    // Offset: 0x318
    ::GlobalNamespace::SuperTextMesh* runeNotification;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> BGDDHPEGMAA
    // Size: 0x8
    // Offset: 0x320
    ::System::Collections::Generic::List_1<::StringW>* BGDDHPEGMAA;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.Single BPGCODKDPPE
    // Size: 0x4
    // Offset: 0x328
    float BPGCODKDPPE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PBCNOLPEOGD
    // Size: 0x4
    // Offset: 0x32C
    float PBCNOLPEOGD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public MagicalActual.SpecialPopupManager specialPopupManager
    // Size: 0x8
    // Offset: 0x330
    ::MagicalActual::SpecialPopupManager* specialPopupManager;
    // Field size check
    static_assert(sizeof(::MagicalActual::SpecialPopupManager*) == 0x8);
    // private UnityEngine.GameObject IGOBDMPDAED
    // Size: 0x8
    // Offset: 0x338
    ::UnityEngine::GameObject* IGOBDMPDAED;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Color DNBDAECCIKK
    // Size: 0x10
    // Offset: 0x340
    ::UnityEngine::Color DNBDAECCIKK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color BEAHHEPEHBA
    // Size: 0x10
    // Offset: 0x350
    ::UnityEngine::Color BEAHHEPEHBA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color EOLPBKPPODG
    // Size: 0x10
    // Offset: 0x360
    ::UnityEngine::Color EOLPBKPPODG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [CompilerGeneratedAttribute] Offset: 0xAE38E8
    // private System.Boolean <NFNFLKCHCFD>k__BackingField
    // Size: 0x1
    // Offset: 0x370
    bool NFNFLKCHCFD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean BACJLLMMNDA
    // Size: 0x1
    // Offset: 0x371
    bool BACJLLMMNDA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE38F8
    // private System.Boolean <ONAMECHEGPM>k__BackingField
    // Size: 0x1
    // Offset: 0x372
    bool ONAMECHEGPM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3908
    // private System.Boolean <EOADGKODIHA>k__BackingField
    // Size: 0x1
    // Offset: 0x373
    bool EOADGKODIHA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3918
    // private System.Boolean <LPNCGBJFBDK>k__BackingField
    // Size: 0x1
    // Offset: 0x374
    bool LPNCGBJFBDK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LPNCGBJFBDK and: PJINHJLNLBC
    char __padding116[0x3] = {};
    // private UnityEngine.Color PJINHJLNLBC
    // Size: 0x10
    // Offset: 0x378
    ::UnityEngine::Color PJINHJLNLBC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color OLLFFNOONAP
    // Size: 0x10
    // Offset: 0x388
    ::UnityEngine::Color OLLFFNOONAP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color LKDJIIIJFAJ
    // Size: 0x10
    // Offset: 0x398
    ::UnityEngine::Color LKDJIIIJFAJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color GNKIJBFJOGO
    // Size: 0x10
    // Offset: 0x3A8
    ::UnityEngine::Color GNKIJBFJOGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color MPDHHPCAGFB
    // Size: 0x10
    // Offset: 0x3B8
    ::UnityEngine::Color MPDHHPCAGFB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color AAHDKGAALMA
    // Size: 0x10
    // Offset: 0x3C8
    ::UnityEngine::Color AAHDKGAALMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color KGOEKCLNECG
    // Size: 0x10
    // Offset: 0x3D8
    ::UnityEngine::Color KGOEKCLNECG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color DEGILMKMLEI
    // Size: 0x10
    // Offset: 0x3E8
    ::UnityEngine::Color DEGILMKMLEI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color JMPGHHJNKGN
    // Size: 0x10
    // Offset: 0x3F8
    ::UnityEngine::Color JMPGHHJNKGN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color LCFJLAFLOGC
    // Size: 0x10
    // Offset: 0x408
    ::UnityEngine::Color LCFJLAFLOGC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color KCKIMCKDPMJ
    // Size: 0x10
    // Offset: 0x418
    ::UnityEngine::Color KCKIMCKDPMJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color JCOONOEMCCN
    // Size: 0x10
    // Offset: 0x428
    ::UnityEngine::Color JCOONOEMCCN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Vector3 PABODGFCCPB
    // Size: 0xC
    // Offset: 0x438
    ::UnityEngine::Vector3 PABODGFCCPB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion GECBOKLOFKJ
    // Size: 0x10
    // Offset: 0x444
    ::UnityEngine::Quaternion GECBOKLOFKJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single DJKPHCOJBFD
    // Size: 0x4
    // Offset: 0x454
    float DJKPHCOJBFD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DMDCJOGKEII
    // Size: 0x4
    // Offset: 0x458
    float DMDCJOGKEII;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 PAAFEPICDJO
    // Size: 0x4
    // Offset: 0x45C
    int PAAFEPICDJO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean NADNHHBLKDO
    // Size: 0x1
    // Offset: 0x460
    bool NADNHHBLKDO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NADNHHBLKDO and: JNHGDCCKIOI
    char __padding134[0x7] = {};
    // private UnityEngine.GameObject JNHGDCCKIOI
    // Size: 0x8
    // Offset: 0x468
    ::UnityEngine::GameObject* JNHGDCCKIOI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject FDGLLFIIPCA
    // Size: 0x8
    // Offset: 0x470
    ::UnityEngine::GameObject* FDGLLFIIPCA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3928
    // private System.Boolean <OPCKMPONFGP>k__BackingField
    // Size: 0x1
    // Offset: 0x478
    bool OPCKMPONFGP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3938
    // private System.Boolean <ALLNLOIDOCG>k__BackingField
    // Size: 0x1
    // Offset: 0x479
    bool ALLNLOIDOCG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ALLNLOIDOCG and: PDMHPDLJMCG
    char __padding138[0x6] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3948
    // private System.String <PDMHPDLJMCG>k__BackingField
    // Size: 0x8
    // Offset: 0x480
    ::StringW PDMHPDLJMCG;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3958
    // private System.String[] <KILMFODCKFA>k__BackingField
    // Size: 0x8
    // Offset: 0x488
    ::ArrayW<::StringW> KILMFODCKFA;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3968
    // private System.String[] <EOBAHKCIMDF>k__BackingField
    // Size: 0x8
    // Offset: 0x490
    ::ArrayW<::StringW> EOBAHKCIMDF;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3978
    // private System.Boolean <HHKIMKKKLEG>k__BackingField
    // Size: 0x1
    // Offset: 0x498
    bool HHKIMKKKLEG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3988
    // private System.Boolean <BEAALFEHEMK>k__BackingField
    // Size: 0x1
    // Offset: 0x499
    bool BEAALFEHEMK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3998
    // private System.Boolean <AFIMMKINDHK>k__BackingField
    // Size: 0x1
    // Offset: 0x49A
    bool AFIMMKINDHK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AFIMMKINDHK and: BDHHHLBEHNK
    char __padding144[0x5] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE39A8
    // private System.String[] <BDHHHLBEHNK>k__BackingField
    // Size: 0x8
    // Offset: 0x4A0
    ::ArrayW<::StringW> BDHHHLBEHNK;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE39B8
    // private System.String[] <CKFACGGBAIF>k__BackingField
    // Size: 0x8
    // Offset: 0x4A8
    ::ArrayW<::StringW> CKFACGGBAIF;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE39C8
    // private System.Boolean <EOIHICBFNIE>k__BackingField
    // Size: 0x1
    // Offset: 0x4B0
    bool EOIHICBFNIE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EOIHICBFNIE and: NJKLCPOEBHF
    char __padding147[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE39D8
    // private System.Int32 <NJKLCPOEBHF>k__BackingField
    // Size: 0x4
    // Offset: 0x4B4
    int NJKLCPOEBHF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE39E8
    // private System.Int32 <GMDHIGGMGPG>k__BackingField
    // Size: 0x4
    // Offset: 0x4B8
    int GMDHIGGMGPG;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: GMDHIGGMGPG and: DENDMIBBGPA
    char __padding149[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE39F8
    // private System.String[] <DENDMIBBGPA>k__BackingField
    // Size: 0x8
    // Offset: 0x4C0
    ::ArrayW<::StringW> DENDMIBBGPA;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A08
    // private System.String[] <ODHPNAMADEB>k__BackingField
    // Size: 0x8
    // Offset: 0x4C8
    ::ArrayW<::StringW> ODHPNAMADEB;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A18
    // private System.Boolean[] <BFJKKKPGKFK>k__BackingField
    // Size: 0x8
    // Offset: 0x4D0
    ::ArrayW<bool> BFJKKKPGKFK;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A28
    // private System.Int32 <CLGCLCFLHDF>k__BackingField
    // Size: 0x4
    // Offset: 0x4D8
    int CLGCLCFLHDF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: CLGCLCFLHDF and: PFJDDCPLNNI
    char __padding153[0x4] = {};
    // private MagicalActual.WorldMenu PFJDDCPLNNI
    // Size: 0x8
    // Offset: 0x4E0
    ::MagicalActual::WorldMenu* PFJDDCPLNNI;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // private UnityEngine.Vector3 CLHAIFFHBBL
    // Size: 0xC
    // Offset: 0x4E8
    ::UnityEngine::Vector3 CLHAIFFHBBL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single NDBKEHBBFIM
    // Size: 0x4
    // Offset: 0x4F4
    float NDBKEHBBFIM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.ObjectHighlighter BGKMOLDAMCD
    // Size: 0x8
    // Offset: 0x4F8
    ::MagicalActual::ObjectHighlighter* BGKMOLDAMCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::ObjectHighlighter*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A38
    // private System.Boolean <JOKEANHMALO>k__BackingField
    // Size: 0x1
    // Offset: 0x500
    bool JOKEANHMALO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A48
    // private System.Boolean <KIIOLIBEOEK>k__BackingField
    // Size: 0x1
    // Offset: 0x501
    bool KIIOLIBEOEK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A58
    // private System.Boolean <DOBIGIBMGBC>k__BackingField
    // Size: 0x1
    // Offset: 0x502
    bool DOBIGIBMGBC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DOBIGIBMGBC and: KFIHCBGPFAO
    char __padding160[0x1] = {};
    // private System.Single KFIHCBGPFAO
    // Size: 0x4
    // Offset: 0x504
    float KFIHCBGPFAO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FPNHDLOOMLK
    // Size: 0x4
    // Offset: 0x508
    float FPNHDLOOMLK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: FPNHDLOOMLK and: FHFBLMEFJLP
    char __padding162[0x4] = {};
    // private System.Int64 FHFBLMEFJLP
    // Size: 0x8
    // Offset: 0x510
    int64_t FHFBLMEFJLP;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Single BJKAACEGIOJ
    // Size: 0x4
    // Offset: 0x518
    float BJKAACEGIOJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MDBAGBJDFDC
    // Size: 0x4
    // Offset: 0x51C
    float MDBAGBJDFDC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A68
    // private System.Byte <OCLILHEKJDI>k__BackingField
    // Size: 0x1
    // Offset: 0x520
    uint8_t OCLILHEKJDI;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: OCLILHEKJDI and: AKOCFJMKAPN
    char __padding166[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3A78
    // private MagicalActual.Grabber <AKOCFJMKAPN>k__BackingField
    // Size: 0x8
    // Offset: 0x528
    ::MagicalActual::Grabber* AKOCFJMKAPN;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A88
    // private MagicalActual.Grabber <GKJNNAJPCBG>k__BackingField
    // Size: 0x8
    // Offset: 0x530
    ::MagicalActual::Grabber* GKJNNAJPCBG;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3A98
    // private System.Byte <EKDCMMMOIBO>k__BackingField
    // Size: 0x1
    // Offset: 0x538
    uint8_t EKDCMMMOIBO;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: EKDCMMMOIBO and: BBNIKFKCFAH
    char __padding169[0x3] = {};
    // private System.Int32 BBNIKFKCFAH
    // Size: 0x4
    // Offset: 0x53C
    int BBNIKFKCFAH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 KEHLNLBAFHA
    // Size: 0x4
    // Offset: 0x540
    int KEHLNLBAFHA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.UInt16 IAPBONGAJLK
    // Size: 0x2
    // Offset: 0x544
    uint16_t IAPBONGAJLK;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.Boolean AALBHOKGIOD
    // Size: 0x1
    // Offset: 0x546
    bool AALBHOKGIOD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AALBHOKGIOD and: HOENAJNNOAN
    char __padding173[0x1] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3AA8
    // private System.String <HOENAJNNOAN>k__BackingField
    // Size: 0x8
    // Offset: 0x548
    ::StringW HOENAJNNOAN;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String equipment
    // Size: 0x8
    // Offset: 0x550
    ::StringW equipment;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String playerPrefs
    // Size: 0x8
    // Offset: 0x558
    ::StringW playerPrefs;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3AC8
    // private System.Byte <IJJNLMHHHCL>k__BackingField
    // Size: 0x1
    // Offset: 0x560
    uint8_t IJJNLMHHHCL;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3AD8
    // private System.Byte <NCACHDJOOND>k__BackingField
    // Size: 0x1
    // Offset: 0x561
    uint8_t NCACHDJOOND;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3AE8
    // private System.Byte <NIBBECIMOHP>k__BackingField
    // Size: 0x1
    // Offset: 0x562
    uint8_t NIBBECIMOHP;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: NIBBECIMOHP and: basePosition
    char __padding179[0x1] = {};
    // public UnityEngine.Vector3 basePosition
    // Size: 0xC
    // Offset: 0x564
    ::UnityEngine::Vector3 basePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion baseRotation
    // Size: 0x10
    // Offset: 0x570
    ::UnityEngine::Quaternion baseRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion forcedRotation
    // Size: 0x10
    // Offset: 0x580
    ::UnityEngine::Quaternion forcedRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Boolean forceMyRotation
    // Size: 0x1
    // Offset: 0x590
    bool forceMyRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: forceMyRotation and: MILMLIOLBDA
    char __padding183[0x1] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3B38
    // private System.UInt16 <MILMLIOLBDA>k__BackingField
    // Size: 0x2
    // Offset: 0x592
    uint16_t MILMLIOLBDA;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: MILMLIOLBDA and: GPAAMHPKHML
    char __padding184[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3B48
    // private System.String <GPAAMHPKHML>k__BackingField
    // Size: 0x8
    // Offset: 0x598
    ::StringW GPAAMHPKHML;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3B58
    // private System.String <GLHEJOCEGNJ>k__BackingField
    // Size: 0x8
    // Offset: 0x5A0
    ::StringW GLHEJOCEGNJ;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3B68
    // private System.Byte <NCLACBKFIFB>k__BackingField
    // Size: 0x1
    // Offset: 0x5A8
    uint8_t NCLACBKFIFB;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: NCLACBKFIFB and: PMAODJGHCEK
    char __padding187[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3B78
    // private System.Single <PMAODJGHCEK>k__BackingField
    // Size: 0x4
    // Offset: 0x5AC
    float PMAODJGHCEK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3B88
    // private System.String <ONDDFMIGJNH>k__BackingField
    // Size: 0x8
    // Offset: 0x5B0
    ::StringW ONDDFMIGJNH;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3B98
    // private System.Int32 <EKNMFCHGAKN>k__BackingField
    // Size: 0x4
    // Offset: 0x5B8
    int EKNMFCHGAKN;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3BA8
    // private System.Single <PLMHJHBEPHL>k__BackingField
    // Size: 0x4
    // Offset: 0x5BC
    float PLMHJHBEPHL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3BB8
    // private System.Single <PCFPBDMFMBE>k__BackingField
    // Size: 0x4
    // Offset: 0x5C0
    float PCFPBDMFMBE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3BC8
    // private System.Byte <GCGAMLDCHGL>k__BackingField
    // Size: 0x1
    // Offset: 0x5C4
    uint8_t GCGAMLDCHGL;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: GCGAMLDCHGL and: PDGPOGJHJCA
    char __padding193[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3BD8
    // private System.Single <PDGPOGJHJCA>k__BackingField
    // Size: 0x4
    // Offset: 0x5C8
    float PDGPOGJHJCA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3BE8
    // private System.Single <PPDDCAPKCJM>k__BackingField
    // Size: 0x4
    // Offset: 0x5CC
    float PPDDCAPKCJM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3BF8
    // private System.String <NDJLKGMJJIP>k__BackingField
    // Size: 0x8
    // Offset: 0x5D0
    ::StringW NDJLKGMJJIP;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C08
    // private System.Boolean <HJOIMJJHDPC>k__BackingField
    // Size: 0x1
    // Offset: 0x5D8
    bool HJOIMJJHDPC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C18
    // private System.Boolean <GAPPALCEOGO>k__BackingField
    // Size: 0x1
    // Offset: 0x5D9
    bool GAPPALCEOGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C28
    // private System.Boolean <JGAECBKOELP>k__BackingField
    // Size: 0x1
    // Offset: 0x5DA
    bool JGAECBKOELP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JGAECBKOELP and: MMCKHCJGFKG
    char __padding199[0x1] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3C38
    // private UnityEngine.Vector3 <MMCKHCJGFKG>k__BackingField
    // Size: 0xC
    // Offset: 0x5DC
    ::UnityEngine::Vector3 MMCKHCJGFKG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C48
    // private System.Single <ELIDKNNPPCH>k__BackingField
    // Size: 0x4
    // Offset: 0x5E8
    float ELIDKNNPPCH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C58
    // private System.Single <GIHKCDBBOJM>k__BackingField
    // Size: 0x4
    // Offset: 0x5EC
    float GIHKCDBBOJM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C68
    // private System.Boolean <HJBHNCFCPMA>k__BackingField
    // Size: 0x1
    // Offset: 0x5F0
    bool HJBHNCFCPMA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HJBHNCFCPMA and: HDBLIHNAEGJ
    char __padding203[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3C78
    // private System.String <HDBLIHNAEGJ>k__BackingField
    // Size: 0x8
    // Offset: 0x5F8
    ::StringW HDBLIHNAEGJ;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C88
    // private System.String <PNNGHCAKKCA>k__BackingField
    // Size: 0x8
    // Offset: 0x600
    ::StringW PNNGHCAKKCA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3C98
    // private System.String <JLMBMAIOLNA>k__BackingField
    // Size: 0x8
    // Offset: 0x608
    ::StringW JLMBMAIOLNA;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3CA8
    // private System.String <OEDIGMJDMAG>k__BackingField
    // Size: 0x8
    // Offset: 0x610
    ::StringW OEDIGMJDMAG;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3CB8
    // private System.Byte <OGNMHFKDEPF>k__BackingField
    // Size: 0x1
    // Offset: 0x618
    uint8_t OGNMHFKDEPF;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3CC8
    // private System.Byte <FCLEFKLEBGO>k__BackingField
    // Size: 0x1
    // Offset: 0x619
    uint8_t FCLEFKLEBGO;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: FCLEFKLEBGO and: FGAEEBMKKOE
    char __padding209[0x6] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3CD8
    // private System.String <FGAEEBMKKOE>k__BackingField
    // Size: 0x8
    // Offset: 0x620
    ::StringW FGAEEBMKKOE;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3CE8
    // private System.Boolean <HFIDPFHDLJB>k__BackingField
    // Size: 0x1
    // Offset: 0x628
    bool HFIDPFHDLJB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HFIDPFHDLJB and: HDBODOPJAON
    char __padding211[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3CF8
    // private System.Single <HDBODOPJAON>k__BackingField
    // Size: 0x4
    // Offset: 0x62C
    float HDBODOPJAON;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D08
    // private System.String <GCBOMNPJLOM>k__BackingField
    // Size: 0x8
    // Offset: 0x630
    ::StringW GCBOMNPJLOM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D18
    // private System.String <IKCGBAIGFOJ>k__BackingField
    // Size: 0x8
    // Offset: 0x638
    ::StringW IKCGBAIGFOJ;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D28
    // private System.Boolean <ANPDNPDNHDN>k__BackingField
    // Size: 0x1
    // Offset: 0x640
    bool ANPDNPDNHDN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ANPDNPDNHDN and: PCLNKFKAPCC
    char __padding215[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3D38
    // private UnityEngine.Quaternion <PCLNKFKAPCC>k__BackingField
    // Size: 0x10
    // Offset: 0x644
    ::UnityEngine::Quaternion PCLNKFKAPCC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D48
    // private UnityEngine.Quaternion <NFBNGLJCDOE>k__BackingField
    // Size: 0x10
    // Offset: 0x654
    ::UnityEngine::Quaternion NFBNGLJCDOE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: NFBNGLJCDOE and: MAJOGJOPMDM
    char __padding217[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3D58
    // private System.String <MAJOGJOPMDM>k__BackingField
    // Size: 0x8
    // Offset: 0x668
    ::StringW MAJOGJOPMDM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D68
    // private System.Byte <HPAOFCKMEAF>k__BackingField
    // Size: 0x1
    // Offset: 0x670
    uint8_t HPAOFCKMEAF;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean AHNPMPECJNH
    // Size: 0x1
    // Offset: 0x671
    bool AHNPMPECJNH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean FKONEJFOFLM
    // Size: 0x1
    // Offset: 0x672
    bool FKONEJFOFLM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHEKAJKEIBD
    // Size: 0x1
    // Offset: 0x673
    bool GHEKAJKEIBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GHEKAJKEIBD and: FELNJLNABCI
    char __padding222[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3D78
    // private MagicalActual.PlayerMount <FELNJLNABCI>k__BackingField
    // Size: 0x8
    // Offset: 0x678
    ::MagicalActual::PlayerMount* FELNJLNABCI;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerMount*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D88
    // private System.Byte <LCCFHAGINGA>k__BackingField
    // Size: 0x1
    // Offset: 0x680
    uint8_t LCCFHAGINGA;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAE3D98
    // private System.Boolean <JCAMEPGAHNI>k__BackingField
    // Size: 0x1
    // Offset: 0x681
    bool JCAMEPGAHNI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JCAMEPGAHNI and: OEOENDCIDKN
    char __padding225[0x6] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE3DA8
    // private System.Collections.Generic.List`1<System.String> <OEOENDCIDKN>k__BackingField
    // Size: 0x8
    // Offset: 0x688
    ::System::Collections::Generic::List_1<::StringW>* OEOENDCIDKN;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3DB8
    // private System.String[] <PJDMPDEAIMK>k__BackingField
    // Size: 0x8
    // Offset: 0x690
    ::ArrayW<::StringW> PJDMPDEAIMK;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String partyId
    // Size: 0x8
    // Offset: 0x698
    ::StringW partyId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String teamId
    // Size: 0x8
    // Offset: 0x6A0
    ::StringW teamId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String[] currentAchievements
    // Size: 0x8
