// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerPetTraits
  class PlayerPetTraits;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: TrailRenderer
  class TrailRenderer;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerPet
  class PlayerPet;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerPet);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerPet*, "MagicalActual", "PlayerPet");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x104
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerPet
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerPet : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::PlayerPet::PetType
    struct PetType;
    // Nested type: ::MagicalActual::PlayerPet::$$c__DisplayClass47_0
    class $$c__DisplayClass47_0;
    // Nested type: ::MagicalActual::PlayerPet::$$c
    class $$c;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.BoxCollider BBOMOHLELBB
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::BoxCollider* BBOMOHLELBB;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private UnityEngine.Renderer PetRenderer
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Renderer* PetRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Renderer*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE41A8
    // private UnityEngine.AudioSource <GOHJPFMAAIA>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::AudioSource* GOHJPFMAAIA;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE41B8
    // private UnityEngine.Animator <ELMDALDBDHI>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Animator* ELMDALDBDHI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.Vector3 GCLKDLJHJEI
    // Size: 0xC
    // Offset: 0x50
    ::UnityEngine::Vector3 GCLKDLJHJEI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single DKKKPCDNGMB
    // Size: 0x4
    // Offset: 0x5C
    float DKKKPCDNGMB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IHGACIMHACE
    // Size: 0x4
    // Offset: 0x60
    float IHGACIMHACE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DFBCNLBHKFI
    // Size: 0x4
    // Offset: 0x64
    float DFBCNLBHKFI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HJCLGIDPFCL
    // Size: 0x4
    // Offset: 0x68
    float HJCLGIDPFCL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: HJCLGIDPFCL and: vfxEat
    char __padding11[0x4] = {};
    // public UnityEngine.GameObject vfxEat
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* vfxEat;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.AudioClip sfxEat
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::AudioClip* sfxEat;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private UnityEngine.TrailRenderer leftWingTrail
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::TrailRenderer* leftWingTrail;
    // Field size check
    static_assert(sizeof(::UnityEngine::TrailRenderer*) == 0x8);
    // private UnityEngine.TrailRenderer rightWingTrail
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::TrailRenderer* rightWingTrail;
    // Field size check
    static_assert(sizeof(::UnityEngine::TrailRenderer*) == 0x8);
    // private System.Single HDPMBJANKFD
    // Size: 0x4
    // Offset: 0x90
    float HDPMBJANKFD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: HDPMBJANKFD and: petType
    char __padding16[0x4] = {};
    // public System.String petType
    // Size: 0x8
    // Offset: 0x98
    ::StringW petType;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.PlayerPetTraits PetTraits
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::PlayerPetTraits* PetTraits;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerPetTraits*) == 0x8);
    // private System.Boolean useStaticColors
    // Size: 0x1
    // Offset: 0xA8
    bool useStaticColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useStaticColors and: staticPrimary
    char __padding19[0x3] = {};
    // private UnityEngine.Color staticPrimary
    // Size: 0x10
    // Offset: 0xAC
    ::UnityEngine::Color staticPrimary;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color staticSecondary
    // Size: 0x10
    // Offset: 0xBC
    ::UnityEngine::Color staticSecondary;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color staticSpot
    // Size: 0x10
    // Offset: 0xCC
    ::UnityEngine::Color staticSpot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: staticSpot and: KJNBCGLIEIK
    char __padding22[0x4] = {};
    // private UnityEngine.GameObject KJNBCGLIEIK
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::GameObject* KJNBCGLIEIK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean KGPGGLGOBHC
    // Size: 0x1
    // Offset: 0xE8
    bool KGPGGLGOBHC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KGPGGLGOBHC and: GEHHJKAMMGK
    char __padding24[0x3] = {};
    // private System.Single GEHHJKAMMGK
    // Size: 0x4
    // Offset: 0xEC
    float GEHHJKAMMGK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean DMCMNEFKDEJ
    // Size: 0x1
    // Offset: 0xF0
    bool DMCMNEFKDEJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean BKECGKCNEFL
    // Size: 0x1
    // Offset: 0xF1
    bool BKECGKCNEFL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BKECGKCNEFL and: EDKKJBNMENH
    char __padding27[0x2] = {};
    // private System.Int32 EDKKJBNMENH
    // Size: 0x4
    // Offset: 0xF4
    int EDKKJBNMENH;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 MHPHEKKLOLE
    // Size: 0x4
    // Offset: 0xF8
    int MHPHEKKLOLE;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 AMHIJKLCJCM
    // Size: 0x4
    // Offset: 0xFC
    int AMHIJKLCJCM;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 HIJNLFBCAOK
    // Size: 0x4
    // Offset: 0x100
    int HIJNLFBCAOK;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Int32 MMKOPFHMOAI
    static constexpr const int MMKOPFHMOAI = 8;
    // Get static field: static private System.Int32 MMKOPFHMOAI
    static int _get_MMKOPFHMOAI();
    // Set static field: static private System.Int32 MMKOPFHMOAI
    static void _set_MMKOPFHMOAI(int value);
    // Get static field: static private readonly System.Int32[] HHKGKGDALIE
    static ::ArrayW<int> _get_HHKGKGDALIE();
    // Set static field: static private readonly System.Int32[] HHKGKGDALIE
    static void _set_HHKGKGDALIE(::ArrayW<int> value);
    // Get static field: static private readonly System.Int32[] POPHFBLMOOM
    static ::ArrayW<int> _get_POPHFBLMOOM();
