// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
  // Forward declaring type: FurnitureChest
  class FurnitureChest;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerHouseFurniture
  class PlayerHouseFurniture;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerHouseFurniture);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerHouseFurniture*, "MagicalActual", "PlayerHouseFurniture");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x74
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerHouseFurniture
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerHouseFurniture : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [CompilerGeneratedAttribute] Offset: 0xAE2EE0
    // private UnityEngine.GameObject <GLLFNPHEJGL>k__BackingField
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* GLLFNPHEJGL;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private System.Boolean DNBJEMJMAJC
    // Size: 0x1
    // Offset: 0x28
    bool DNBJEMJMAJC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DNBJEMJMAJC and: NENLBJKDCFP
    char __padding2[0x7] = {};
    // private PhysicsInteractable NENLBJKDCFP
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PhysicsInteractable* NENLBJKDCFP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.BoxCollider LHNPLONAELA
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::BoxCollider* LHNPLONAELA;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // public ExtUI.InventoryItemInstance myItem
    // Size: 0x8
    // Offset: 0x40
    ::ExtUI::InventoryItemInstance* myItem;
    // Field size check
    static_assert(sizeof(::ExtUI::InventoryItemInstance*) == 0x8);
    // private UnityEngine.Vector3 PBOJKNHFCPG
    // Size: 0xC
    // Offset: 0x48
    ::UnityEngine::Vector3 PBOJKNHFCPG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 EHEEKKBGHLG
    // Size: 0xC
    // Offset: 0x54
    ::UnityEngine::Vector3 EHEEKKBGHLG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Transform JNBOAIGLFGP
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* JNBOAIGLFGP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private ExtUI.FurnitureChest IHOIKKOEGGI
    // Size: 0x8
    // Offset: 0x68
    ::ExtUI::FurnitureChest* IHOIKKOEGGI;
    // Field size check
    static_assert(sizeof(::ExtUI::FurnitureChest*) == 0x8);
    // private System.Int32 HIHCCFDGJLF
    // Size: 0x4
    // Offset: 0x70
    int HIHCCFDGJLF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.GameObject <GLLFNPHEJGL>k__BackingField
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_$GLLFNPHEJGL$k__BackingField();
    // Get instance field reference: private UnityEngine.Rigidbody EIPMBKLODIJ
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_EIPMBKLODIJ();
    // Get instance field reference: private System.Boolean DNBJEMJMAJC
    [[deprecated("Use field access instead!")]] bool& dyn_DNBJEMJMAJC();
    // Get instance field reference: private PhysicsInteractable NENLBJKDCFP
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PhysicsInteractable*& dyn_NENLBJKDCFP();
