// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: WorldMenu
  class WorldMenu;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerGhost
  class PlayerGhost;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerGhost);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerGhost*, "MagicalActual", "PlayerGhost");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x5D
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerGhost
  // [TokenAttribute] Offset: FFFFFFFF
  class PlayerGhost : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private MagicalActual.WorldMenu PFJDDCPLNNI
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::WorldMenu* PFJDDCPLNNI;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // private UnityEngine.Vector3 CLHAIFFHBBL
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 CLHAIFFHBBL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: CLHAIFFHBBL and: IJJGNKLFGJN
    char __padding3[0x4] = {};
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public SuperTextMesh cooldownTimer
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::SuperTextMesh* cooldownTimer;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private System.Int32 FIBHNPCEGCM
    // Size: 0x4
    // Offset: 0x50
    int FIBHNPCEGCM;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single BKHKBDLAGGC
    // Size: 0x4
    // Offset: 0x54
    float BKHKBDLAGGC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FHOLIDJBOLF
    // Size: 0x4
    // Offset: 0x58
    float FHOLIDJBOLF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean BOIIJELHJDH
    // Size: 0x1
    // Offset: 0x5C
    bool BOIIJELHJDH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.PlayerAvatar EENJNFDNJBD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerAvatar*& dyn_EENJNFDNJBD();
    // Get instance field reference: private MagicalActual.WorldMenu PFJDDCPLNNI
    [[deprecated("Use field access instead!")]] ::MagicalActual::WorldMenu*& dyn_PFJDDCPLNNI();
