// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MagicalActual.PlayerCharacter
#include "MagicalActual/PlayerCharacter.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerCharacter::$$c__DisplayClass297_0);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerCharacter::$$c__DisplayClass297_0*, "MagicalActual", "PlayerCharacter/<>c__DisplayClass297_0");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x1A
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerCharacter/<>c__DisplayClass297_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: AD3848
  class PlayerCharacter::$$c__DisplayClass297_0 : public ::Il2CppObject {
    public:
    public:
    // public System.UInt16 OKHJOGGIHMO
    // Size: 0x2
    // Offset: 0x10
    uint16_t OKHJOGGIHMO;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.Byte LFADFNPJCAK
    // Size: 0x1
    // Offset: 0x12
    uint8_t LFADFNPJCAK;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: LFADFNPJCAK and: JKKPAPACIKI
    char __padding1[0x1] = {};
    // public System.UInt16 JKKPAPACIKI
    // Size: 0x2
    // Offset: 0x14
    uint16_t JKKPAPACIKI;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.Byte AKAEKHINBJL
    // Size: 0x1
    // Offset: 0x16
    uint8_t AKAEKHINBJL;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: AKAEKHINBJL and: CEGLKGFCNPJ
    char __padding3[0x1] = {};
    // public System.UInt16 CEGLKGFCNPJ
    // Size: 0x2
    // Offset: 0x18
    uint16_t CEGLKGFCNPJ;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    public:
    // Get instance field reference: public System.UInt16 OKHJOGGIHMO
    [[deprecated("Use field access instead!")]] uint16_t& dyn_OKHJOGGIHMO();
    // Get instance field reference: public System.Byte LFADFNPJCAK
    [[deprecated("Use field access instead!")]] uint8_t& dyn_LFADFNPJCAK();
    // Get instance field reference: public System.UInt16 JKKPAPACIKI
    [[deprecated("Use field access instead!")]] uint16_t& dyn_JKKPAPACIKI();
    // Get instance field reference: public System.Byte AKAEKHINBJL
    [[deprecated("Use field access instead!")]] uint8_t& dyn_AKAEKHINBJL();
    // Get instance field reference: public System.UInt16 CEGLKGFCNPJ
    [[deprecated("Use field access instead!")]] uint16_t& dyn_CEGLKGFCNPJ();
    // System.Void GMJGNBAKMKG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49074
    void GMJGNBAKMKG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void DJCMHBEIHCN(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49158
    void DJCMHBEIHCN(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void OLAMEPNGOGB(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4923C
    void OLAMEPNGOGB(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void IJHHKOMHDFF(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49320
    void IJHHKOMHDFF(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LLEPGHAEDHN(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49404
    void LLEPGHAEDHN(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void OPEJMHOPHEH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E494E8
    void OPEJMHOPHEH(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void OIKIDPPBELO(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E495CC
    void OIKIDPPBELO(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void KDBGEFOGFOF(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E496B0
    void KDBGEFOGFOF(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void HEBNHNGJDAH(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49794
    void HEBNHNGJDAH(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BFAOOPONNLB(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49878
    void BFAOOPONNLB(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void OFOGOMNOBBL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4995C
    void OFOGOMNOBBL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MGHFPHHCPNE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49A40
    void MGHFPHHCPNE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void BICKIHKKNKC(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49B24
    void BICKIHKKNKC(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JHBKGLJFDGB(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49C08
    void JHBKGLJFDGB(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MMGCPAHKCGD(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49CEC
    void MMGCPAHKCGD(::System::IO::BinaryWriter* FFJEENIEPJH);
    // public System.Void .ctor()
    // Offset: 0x1E49DD0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PlayerCharacter::$$c__DisplayClass297_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::PlayerCharacter::$$c__DisplayClass297_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PlayerCharacter::$$c__DisplayClass297_0*, creationType>()));
    }
    // System.Void PMIJGCKPKBC(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49DD8
    void PMIJGCKPKBC(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void GOPFJOPFJOO(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49EBC
    void GOPFJOPFJOO(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void FNHPCAONHGM(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E49FA0
    void FNHPCAONHGM(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MFGGIDAKMNE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A084
    void MFGGIDAKMNE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void AIFJMGINKOI(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A168
    void AIFJMGINKOI(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void KBPBAOJLOEA(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A24C
    void KBPBAOJLOEA(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void INIFJOCPNAE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A330
    void INIFJOCPNAE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MKKFDPLNEEL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A414
    void MKKFDPLNEEL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void MDOJGMECGIG(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A4F8
    void MDOJGMECGIG(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JNACMEDNPPE(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A5DC
    void JNACMEDNPPE(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void NFFFIKHNMND(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A6C0
    void NFFFIKHNMND(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void IPMOPMMCBNA(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A7A4
    void IPMOPMMCBNA(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LKLMDMCPOII(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A888
    void LKLMDMCPOII(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void LAHHELCKLKL(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4A96C
    void LAHHELCKLKL(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void JNDDBMEGNDC(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4AA50
    void JNDDBMEGNDC(::System::IO::BinaryWriter* FFJEENIEPJH);
    // System.Void GNGMBJFADBI(System.IO.BinaryWriter FFJEENIEPJH)
    // Offset: 0x1E4AB34
    void GNGMBJFADBI(::System::IO::BinaryWriter* FFJEENIEPJH);
  }; // MagicalActual.PlayerCharacter/<>c__DisplayClass297_0
  #pragma pack(pop)
  static check_size<sizeof(PlayerCharacter::$$c__DisplayClass297_0), 24 + sizeof(uint16_t)> __MagicalActual_PlayerCharacter_$$c__DisplayClass297_0SizeCheck;
  static_assert(sizeof(PlayerCharacter::$$c__DisplayClass297_0) == 0x1A);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::PlayerCharacter::$$c__DisplayClass297_0::GMJGNBAKMKG
// Il2CppName: GMJGNBAKMKG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::PlayerCharacter::$$c__DisplayClass297_0::*)(::System::IO::BinaryWriter*)>(&MagicalActual::PlayerCharacter::$$c__DisplayClass297_0::GMJGNBAKMKG)> {
  static const MethodInfo* get() {
    static auto* FFJEENIEPJH = &::il2cpp_utils::GetClassFromName("System.IO", "BinaryWriter")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::PlayerCharacter::$$c__DisplayClass297_0*), "GMJGNBAKMKG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{FFJEENIEPJH});
  }
};
// Writing MetadataGetter for method: MagicalActual::PlayerCharacter::$$c__DisplayClass297_0::DJCMHBEIHCN
// Il2CppName: DJCMHBEIHCN
template<>
