// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
// Including type: SteamVR_Events
#include "GlobalNamespace/SteamVR_Events.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObscuredBool
#include "CodeStage/AntiCheat/ObscuredTypes/ObscuredBool.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObInt
#include "CodeStage/AntiCheat/ObscuredTypes/ObInt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCompass
  class PlayerCompass;
  // Forward declaring type: PlayerWand
  class PlayerWand;

  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: WorldUI
  class WorldUI;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Random
  class Random;
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: DataRequest
  class DataRequest;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: CodeStage::AntiCheat::ObscuredTypes
namespace CodeStage::AntiCheat::ObscuredTypes {
  // Forward declaring type: ObscuredUShort
  struct ObscuredUShort;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PlayerCharacter);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PlayerCharacter*, "MagicalActual", "PlayerCharacter");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x6F0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PlayerCharacter
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD3784
  class PlayerCharacter : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::PlayerCharacter::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::PlayerCharacter::headsetType
    struct headsetType;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass236_0
    class $$c__DisplayClass236_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c
    class $$c;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass259_0
    class $$c__DisplayClass259_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass260_0
    class $$c__DisplayClass260_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass268_0
    class $$c__DisplayClass268_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass295_0
    class $$c__DisplayClass295_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass297_0
    class $$c__DisplayClass297_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass298_0
    class $$c__DisplayClass298_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass299_0
    class $$c__DisplayClass299_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass300_0
    class $$c__DisplayClass300_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass301_0
    class $$c__DisplayClass301_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass302_0
    class $$c__DisplayClass302_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass303_0
    class $$c__DisplayClass303_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass304_0
    class $$c__DisplayClass304_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass305_0
    class $$c__DisplayClass305_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass315_0
    class $$c__DisplayClass315_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass315_1
    class $$c__DisplayClass315_1;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass317_0
    class $$c__DisplayClass317_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass317_1
    class $$c__DisplayClass317_1;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass319_0
    class $$c__DisplayClass319_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass336_0
    class $$c__DisplayClass336_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass337_0
    class $$c__DisplayClass337_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass338_0
    class $$c__DisplayClass338_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass339_0
    class $$c__DisplayClass339_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass340_0
    class $$c__DisplayClass340_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass342_0
    class $$c__DisplayClass342_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass343_0
    class $$c__DisplayClass343_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass345_0
    class $$c__DisplayClass345_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass346_0
    class $$c__DisplayClass346_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass347_0
    class $$c__DisplayClass347_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass348_0
    class $$c__DisplayClass348_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass349_0
    class $$c__DisplayClass349_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass350_0
    class $$c__DisplayClass350_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass352_0
    class $$c__DisplayClass352_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass353_0
    class $$c__DisplayClass353_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$SendingBugReport$d__356
    class $SendingBugReport$d__356;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass357_0
    class $$c__DisplayClass357_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass358_0
    class $$c__DisplayClass358_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass359_0
    class $$c__DisplayClass359_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass361_0
    class $$c__DisplayClass361_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass365_0
    class $$c__DisplayClass365_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass365_1
    class $$c__DisplayClass365_1;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass377_0
    class $$c__DisplayClass377_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass385_0
    class $$c__DisplayClass385_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass388_0
    class $$c__DisplayClass388_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass388_1
    class $$c__DisplayClass388_1;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass388_2
    class $$c__DisplayClass388_2;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass393_0
    class $$c__DisplayClass393_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass397_0
    class $$c__DisplayClass397_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass398_0
    class $$c__DisplayClass398_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass399_0
    class $$c__DisplayClass399_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass400_0
    class $$c__DisplayClass400_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass403_0
    class $$c__DisplayClass403_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass404_0
    class $$c__DisplayClass404_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass411_0
    class $$c__DisplayClass411_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass412_0
    class $$c__DisplayClass412_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass413_0
    class $$c__DisplayClass413_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$DisplayTutorialImageTime$d__421
    class $DisplayTutorialImageTime$d__421;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass427_0
    class $$c__DisplayClass427_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass430_0
    class $$c__DisplayClass430_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass431_0
    class $$c__DisplayClass431_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass432_0
    class $$c__DisplayClass432_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass433_0
    class $$c__DisplayClass433_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass436_0
    class $$c__DisplayClass436_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass440_0
    class $$c__DisplayClass440_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass441_0
    class $$c__DisplayClass441_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass442_0
    class $$c__DisplayClass442_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass447_0
    class $$c__DisplayClass447_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass448_0
    class $$c__DisplayClass448_0;
    // Nested type: ::MagicalActual::PlayerCharacter::$delayedAction$d__455
    class $delayedAction$d__455;
    // Nested type: ::MagicalActual::PlayerCharacter::$$c__DisplayClass457_0
    class $$c__DisplayClass457_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.PlayerCharacter/headsetType
    // [TokenAttribute] Offset: FFFFFFFF
    struct headsetType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: headsetType
      constexpr headsetType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.PlayerCharacter/headsetType IDBDMLOAGAN
      static constexpr const int IDBDMLOAGAN = 1;
      // Get static field: static public MagicalActual.PlayerCharacter/headsetType IDBDMLOAGAN
      static ::MagicalActual::PlayerCharacter::headsetType _get_IDBDMLOAGAN();
      // Set static field: static public MagicalActual.PlayerCharacter/headsetType IDBDMLOAGAN
      static void _set_IDBDMLOAGAN(::MagicalActual::PlayerCharacter::headsetType value);
      // static field const value: static public MagicalActual.PlayerCharacter/headsetType GLGJCNCNKAC
      static constexpr const int GLGJCNCNKAC = 2;
      // Get static field: static public MagicalActual.PlayerCharacter/headsetType GLGJCNCNKAC
      static ::MagicalActual::PlayerCharacter::headsetType _get_GLGJCNCNKAC();
      // Set static field: static public MagicalActual.PlayerCharacter/headsetType GLGJCNCNKAC
      static void _set_GLGJCNCNKAC(::MagicalActual::PlayerCharacter::headsetType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.PlayerCharacter/headsetType
    #pragma pack(pop)
    static check_size<sizeof(PlayerCharacter::headsetType), 0 + sizeof(int)> __MagicalActual_PlayerCharacter_headsetTypeSizeCheck;
    static_assert(sizeof(PlayerCharacter::headsetType) == 0x4);
    public:
    // public OrbusTrackedController leftController
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::OrbusTrackedController* leftController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // public OrbusTrackedController rightController
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::OrbusTrackedController* rightController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3E38
    // private MagicalActual.PlayerCompass <NNNCHKGOJCF>k__BackingField
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::PlayerCompass* NNNCHKGOJCF;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCompass*) == 0x8);
    // public UnityEngine.Rigidbody rightControllerAttachPoint
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Rigidbody* rightControllerAttachPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public UnityEngine.GameObject trackingTarget
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* trackingTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject torsoTarget
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* torsoTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject torsoTarget2
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* torsoTarget2;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.PlayerWand playerWand
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::PlayerWand* playerWand;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerWand*) == 0x8);
    // public UnityEngine.GameObject playSpace
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* playSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Quaternion HBPOGLDHMOM
    // Size: 0x10
    // Offset: 0x60
    ::UnityEngine::Quaternion HBPOGLDHMOM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public MagicalActual.Monster myMonster
    // Size: 0x8
    // Offset: 0x70
    ::MagicalActual::Monster* myMonster;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public MagicalActual.PlayerAvatar myPlayerAvatar
    // Size: 0x8
    // Offset: 0x78
    ::MagicalActual::PlayerAvatar* myPlayerAvatar;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // public UnityEngine.GameObject terrainGrid
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* terrainGrid;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public TerrainGrid myGrid
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::TerrainGrid* myGrid;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TerrainGrid*) == 0x8);
    // private UnityEngine.GameObject dynamicEventBeacon
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* dynamicEventBeacon;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject markerObject
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* markerObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.UI.Text questTitle
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::UI::Text* questTitle;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.GameObject questsUI
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* questsUI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject questInfoObject
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* questInfoObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform questUIContent
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Transform* questUIContent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.GameObject tutorialImageParentObject
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* tutorialImageParentObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject FEGLIMIMHED
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* FEGLIMIMHED;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean tutorialImageShowing
    // Size: 0x1
    // Offset: 0xD0
    bool tutorialImageShowing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tutorialImageShowing and: NFGJDLCOJNA
    char __padding22[0x3] = {};
    // private System.Single NFGJDLCOJNA
    // Size: 0x4
    // Offset: 0xD4
    float NFGJDLCOJNA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NLHACKMLOBK
    // Size: 0x4
    // Offset: 0xD8
    float NLHACKMLOBK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: NLHACKMLOBK and: IJJGNKLFGJN
    char __padding24[0x4] = {};
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0xE0
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0xE8
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.RaycastHit[] EPPIPLHANGD
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::RaycastHit> EPPIPLHANGD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> JHBGJPDPOOO
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* JHBGJPDPOOO;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public OrbusKeyboard myKeyboard
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::OrbusKeyboard* myKeyboard;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusKeyboard*) == 0x8);
    // public System.Boolean isLocallyControlled
    // Size: 0x1
    // Offset: 0x108
    bool isLocallyControlled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HJIIINDKKPK
    // Size: 0x1
    // Offset: 0x109
    bool HJIIINDKKPK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HJIIINDKKPK and: DCIIEMGDEIL
    char __padding31[0x6] = {};
    // private UnityEngine.Collider[] DCIIEMGDEIL
    // Size: 0x8
    // Offset: 0x110
    ::ArrayW<::UnityEngine::Collider*> DCIIEMGDEIL;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // public System.Single maxStaminaModifier
    // Size: 0x4
    // Offset: 0x118
    float maxStaminaModifier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxStaminaBoost
    // Size: 0x4
    // Offset: 0x11C
    float maxStaminaBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private MagicalActual.QuestMarker IBFIMCBJCGO
    // Size: 0x8
    // Offset: 0x120
    ::MagicalActual::QuestMarker* IBFIMCBJCGO;
    // Field size check
    static_assert(sizeof(::MagicalActual::QuestMarker*) == 0x8);
    // public MagicalActual.ClassInfoGuide myClassGuide
    // Size: 0x8
    // Offset: 0x128
    ::MagicalActual::ClassInfoGuide* myClassGuide;
    // Field size check
    static_assert(sizeof(::MagicalActual::ClassInfoGuide*) == 0x8);
    // private System.Single INDJNOHADBE
    // Size: 0x4
    // Offset: 0x130
    float INDJNOHADBE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxStamina
    // Size: 0x4
    // Offset: 0x134
    float maxStamina;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single GMMJCOOLHLC
    // Size: 0x4
    // Offset: 0x138
    float GMMJCOOLHLC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FNGLLECMLJN
    // Size: 0x4
    // Offset: 0x13C
    float FNGLLECMLJN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FIDFOELHFPN
    // Size: 0x4
    // Offset: 0x140
    float FIDFOELHFPN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean FLKAONKIFCB
    // Size: 0x1
    // Offset: 0x144
    bool FLKAONKIFCB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean CFALHKPOMFC
    // Size: 0x1
    // Offset: 0x145
    bool CFALHKPOMFC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CFALHKPOMFC and: GCGFKBHDEDN
    char __padding43[0x2] = {};
    // private MagicalActual.Monster GCGFKBHDEDN
    // Size: 0x8
    // Offset: 0x148
    ::MagicalActual::Monster* GCGFKBHDEDN;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3F28
    // private MagicalActual.Taxi <MILMLIOLBDA>k__BackingField
    // Size: 0x8
    // Offset: 0x150
    ::MagicalActual::Taxi* MILMLIOLBDA;
    // Field size check
    static_assert(sizeof(::MagicalActual::Taxi*) == 0x8);
    // public System.Boolean slidingEnabled
    // Size: 0x1
    // Offset: 0x158
    bool slidingEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: slidingEnabled and: forwardDirection
    char __padding46[0x3] = {};
    // public System.Int32 forwardDirection
    // Size: 0x4
    // Offset: 0x15C
    int forwardDirection;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 xAxisUse
    // Size: 0x4
    // Offset: 0x160
    int xAxisUse;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean doNotDisturb
    // Size: 0x1
    // Offset: 0x164
    bool doNotDisturb;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean voiceChatEnabled
    // Size: 0x1
    // Offset: 0x165
    bool voiceChatEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean pksafetyEnabled
    // Size: 0x1
    // Offset: 0x166
    bool pksafetyEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean frontFacing
    // Size: 0x1
    // Offset: 0x167
    bool frontFacing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean autoRunningPref
    // Size: 0x1
    // Offset: 0x168
    bool autoRunningPref;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoRunningPref and: mutedEntities
    char __padding53[0x7] = {};
    // public System.Collections.Generic.List`1<System.String> mutedEntities
    // Size: 0x8
    // Offset: 0x170
    ::System::Collections::Generic::List_1<::StringW>* mutedEntities;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> blockedEntites
    // Size: 0x8
    // Offset: 0x178
    ::System::Collections::Generic::List_1<::StringW>* blockedEntites;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Single optionSelectedCooldown
    // Size: 0x4
    // Offset: 0x180
    float optionSelectedCooldown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: optionSelectedCooldown and: MenuHtml
    char __padding56[0x4] = {};
    // public UnityEngine.TextAsset MenuHtml
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::TextAsset* MenuHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset AlertboxHtml
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::TextAsset* AlertboxHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset PromptHtml
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::TextAsset* PromptHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset DialogueHtml
    // Size: 0x8
    // Offset: 0x1A0
    ::UnityEngine::TextAsset* DialogueHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset keyboardHtml
    // Size: 0x8
    // Offset: 0x1A8
    ::UnityEngine::TextAsset* keyboardHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset LootMenuHtml
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::TextAsset* LootMenuHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset ScoreboardMenuHtml
    // Size: 0x8
    // Offset: 0x1B8
    ::UnityEngine::TextAsset* ScoreboardMenuHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset ObjectOptionsHtml
    // Size: 0x8
    // Offset: 0x1C0
    ::UnityEngine::TextAsset* ObjectOptionsHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset AuctionHouseHtml
    // Size: 0x8
    // Offset: 0x1C8
    ::UnityEngine::TextAsset* AuctionHouseHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.TextAsset PlayerHouseMenuHtml
    // Size: 0x8
    // Offset: 0x1D0
    ::UnityEngine::TextAsset* PlayerHouseMenuHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public UnityEngine.GameObject playerMenu
    // Size: 0x8
    // Offset: 0x1D8
    ::UnityEngine::GameObject* playerMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playerMap
    // Size: 0x8
    // Offset: 0x1E0
    ::UnityEngine::GameObject* playerMap;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.RenderTexture paperDollTexture
    // Size: 0x8
    // Offset: 0x1E8
    ::UnityEngine::RenderTexture* paperDollTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // public UnityEngine.Camera paperDollCamera
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::Camera* paperDollCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public UnityEngine.Camera eyeCamera
    // Size: 0x8
    // Offset: 0x1F8
    ::UnityEngine::Camera* eyeCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public UnityEngine.ParticleSystem rainParticleSystem
    // Size: 0x8
    // Offset: 0x200
    ::UnityEngine::ParticleSystem* rainParticleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // public UnityEngine.AudioSource rainAudioSource
    // Size: 0x8
    // Offset: 0x208
    ::UnityEngine::AudioSource* rainAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.UI.Image rainIndicatorIcon
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::UI::Image* rainIndicatorIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3FE8
    // private OVROverlay <DCPHAMCBFAJ>k__BackingField
    // Size: 0x8
    // Offset: 0x218
    ::GlobalNamespace::OVROverlay* DCPHAMCBFAJ;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVROverlay*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE3FF8
    // private System.Collections.Generic.List`1<MagicalActual.Grabber> <NPFGBBKJKCD>k__BackingField
    // Size: 0x8
    // Offset: 0x220
    ::System::Collections::Generic::List_1<::MagicalActual::Grabber*>* NPFGBBKJKCD;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::Grabber*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4008
    // private PowerUI.WorldUI <GFKGLECFMMA>k__BackingField
    // Size: 0x8
    // Offset: 0x228
    ::PowerUI::WorldUI* GFKGLECFMMA;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // private System.Boolean ICJAEMFPACI
    // Size: 0x1
    // Offset: 0x230
    bool ICJAEMFPACI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ICJAEMFPACI and: DPCPNHDPHFH
    char __padding78[0x7] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,MagicalActual.WorldMenu> DPCPNHDPHFH
    // Size: 0x8
    // Offset: 0x238
    ::System::Collections::Generic::Dictionary_2<::StringW, ::MagicalActual::WorldMenu*>* DPCPNHDPHFH;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::MagicalActual::WorldMenu*>*) == 0x8);
    // public SuperTextMesh playerNotificationObject
    // Size: 0x8
    // Offset: 0x240
    ::GlobalNamespace::SuperTextMesh* playerNotificationObject;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public UnityEngine.GameObject runeNotificationPrefab
    // Size: 0x8
    // Offset: 0x248
    ::UnityEngine::GameObject* runeNotificationPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> KNJAHMCKJFM
    // Size: 0x8
    // Offset: 0x250
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* KNJAHMCKJFM;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public UnityEngine.Transform runeNotificationPosition
    // Size: 0x8
    // Offset: 0x258
    ::UnityEngine::Transform* runeNotificationPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private PowerUI.WorldUI BAIOGMMMMFK
    // Size: 0x8
    // Offset: 0x260
    ::PowerUI::WorldUI* BAIOGMMMMFK;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // private UnityEngine.GameObject PMBPHGBOHFI
    // Size: 0x8
    // Offset: 0x268
    ::UnityEngine::GameObject* PMBPHGBOHFI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.PlayerNotification> BCMILENGBKJ
    // Size: 0x8
    // Offset: 0x270
    ::System::Collections::Generic::List_1<::MagicalActual::PlayerNotification*>* BCMILENGBKJ;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::PlayerNotification*>*) == 0x8);
    // public UnityEngine.TextAsset notificationHtml
    // Size: 0x8
    // Offset: 0x278
    ::UnityEngine::TextAsset* notificationHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // private System.Single IEPLDHKMJDK
    // Size: 0x4
    // Offset: 0x280
    float IEPLDHKMJDK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean JKOCJJELGGO
    // Size: 0x1
    // Offset: 0x284
    bool JKOCJJELGGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean CCKMMPDKFGD
    // Size: 0x1
    // Offset: 0x285
    bool CCKMMPDKFGD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CCKMMPDKFGD and: EOCMLDLEJAL
    char __padding90[0x2] = {};
    // private PowerUI.WorldUI EOCMLDLEJAL
    // Size: 0x8
    // Offset: 0x288
    ::PowerUI::WorldUI* EOCMLDLEJAL;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4018
    // private UnityEngine.GameObject <PGEKOFPPNEB>k__BackingField
    // Size: 0x8
    // Offset: 0x290
    ::UnityEngine::GameObject* PGEKOFPPNEB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 GNBHDGGCPCL
    // Size: 0xC
    // Offset: 0x298
    ::UnityEngine::Vector3 GNBHDGGCPCL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: GNBHDGGCPCL and: ADDDBPNCIHK
    char __padding93[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.Single,System.Action`1<System.String>> ADDDBPNCIHK
    // Size: 0x8
    // Offset: 0x2A8
    ::System::Collections::Generic::Dictionary_2<float, ::System::Action_1<::StringW>*>* ADDDBPNCIHK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<float, ::System::Action_1<::StringW>*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Single,ExtUI.DataRequest> MDGOJMGOENK
    // Size: 0x8
    // Offset: 0x2B0
    ::System::Collections::Generic::Dictionary_2<float, ::ExtUI::DataRequest*>* MDGOJMGOENK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<float, ::ExtUI::DataRequest*>*) == 0x8);
    // private System.Random PEOFOLMKGKN
    // Size: 0x8
    // Offset: 0x2B8
    ::System::Random* PEOFOLMKGKN;
    // Field size check
    static_assert(sizeof(::System::Random*) == 0x8);
    // public UnityEngine.BoxCollider sheatheCollider
    // Size: 0x8
    // Offset: 0x2C0
    ::UnityEngine::BoxCollider* sheatheCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // public UnityEngine.BoxCollider mouthCollider
    // Size: 0x8
    // Offset: 0x2C8
    ::UnityEngine::BoxCollider* mouthCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Boolean ONEECKKOOAD
    // Size: 0x1
    // Offset: 0x2D0
    bool ONEECKKOOAD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean NMHHGDGCPIE
    // Size: 0x1
    // Offset: 0x2D1
    bool NMHHGDGCPIE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NMHHGDGCPIE and: IANIOFBBAFN
    char __padding100[0x6] = {};
    // private System.String IANIOFBBAFN
    // Size: 0x8
    // Offset: 0x2D8
    ::StringW IANIOFBBAFN;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String GNNCECPJLGO
    // Size: 0x8
    // Offset: 0x2E0
    ::StringW GNNCECPJLGO;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.Teleporter LOINJKNIPJK
    // Size: 0x8
    // Offset: 0x2E8
    ::MagicalActual::Teleporter* LOINJKNIPJK;
    // Field size check
    static_assert(sizeof(::MagicalActual::Teleporter*) == 0x8);
    // private MagicalActual.Teleporter JFCAFNAJMFC
    // Size: 0x8
    // Offset: 0x2F0
    ::MagicalActual::Teleporter* JFCAFNAJMFC;
    // Field size check
    static_assert(sizeof(::MagicalActual::Teleporter*) == 0x8);
    // private System.Boolean BLKEKEMNJGP
    // Size: 0x1
    // Offset: 0x2F8
    bool BLKEKEMNJGP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BLKEKEMNJGP and: KCDJMMEBMLB
    char __padding105[0x3] = {};
    // private System.Single KCDJMMEBMLB
    // Size: 0x4
    // Offset: 0x2FC
    float KCDJMMEBMLB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DPMCPDEHDMD
    // Size: 0x4
    // Offset: 0x300
    float DPMCPDEHDMD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: DPMCPDEHDMD and: FEAHLDMAJCN
    char __padding107[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt FEAHLDMAJCN
    // Size: 0x19
    // Offset: 0x308
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt FEAHLDMAJCN;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: FEAHLDMAJCN and: totalSlideDirection
    char __padding108[0x7] = {};
    // public UnityEngine.Vector3 totalSlideDirection
    // Size: 0xC
    // Offset: 0x328
    ::UnityEngine::Vector3 totalSlideDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: totalSlideDirection and: LINOMOAINPA
    char __padding109[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt LINOMOAINPA
    // Size: 0x19
    // Offset: 0x338
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt LINOMOAINPA;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: LINOMOAINPA and: broadcastVoiceTo
    char __padding110[0x7] = {};
    // public System.Int32 broadcastVoiceTo
    // Size: 0x4
    // Offset: 0x358
    int broadcastVoiceTo;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.RaycastHit EIEFDCNCGKG
    // Size: 0x2C
    // Offset: 0x35C
    ::UnityEngine::RaycastHit EIEFDCNCGKG;
    // Field size check
    static_assert(sizeof(::UnityEngine::RaycastHit) == 0x2C);
    // private UnityEngine.GameObject HKNFLKICELH
    // Size: 0x8
    // Offset: 0x388
    ::UnityEngine::GameObject* HKNFLKICELH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.PlayerJournal myJournal
    // Size: 0x8
    // Offset: 0x390
    ::MagicalActual::PlayerJournal* myJournal;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerJournal*) == 0x8);
    // private MagicalActual.SpecialItem CLJKMNFIOGI
    // Size: 0x8
    // Offset: 0x398
    ::MagicalActual::SpecialItem* CLJKMNFIOGI;
    // Field size check
    static_assert(sizeof(::MagicalActual::SpecialItem*) == 0x8);
    // public System.Boolean playerLoaded
    // Size: 0x1
    // Offset: 0x3A0
    bool playerLoaded;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: playerLoaded and: eventUI
    char __padding116[0x7] = {};
    // public MagicalActual.EventUIController eventUI
    // Size: 0x8
    // Offset: 0x3A8
    ::MagicalActual::EventUIController* eventUI;
    // Field size check
    static_assert(sizeof(::MagicalActual::EventUIController*) == 0x8);
    // public UnityEngine.Mesh[] hairStyles
    // Size: 0x8
    // Offset: 0x3B0
    ::ArrayW<::UnityEngine::Mesh*> hairStyles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // public UnityEngine.Mesh[] clippedHairStyles
    // Size: 0x8
    // Offset: 0x3B8
    ::ArrayW<::UnityEngine::Mesh*> clippedHairStyles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // public UnityEngine.Mesh[] noseStyles
    // Size: 0x8
    // Offset: 0x3C0
    ::ArrayW<::UnityEngine::Mesh*> noseStyles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // public UnityEngine.Mesh[] earStyles
    // Size: 0x8
    // Offset: 0x3C8
    ::ArrayW<::UnityEngine::Mesh*> earStyles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Mesh*>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<System.Action>> LAJEFLCFAJD
    // Size: 0x8
    // Offset: 0x3D0
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::System::Action*>*>* LAJEFLCFAJD;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::System::Action*>*>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> completedTutorials
    // Size: 0x8
    // Offset: 0x3D8
    ::System::Collections::Generic::List_1<::StringW>* completedTutorials;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> completedTutorialTips
    // Size: 0x8
    // Offset: 0x3E0
    ::System::Collections::Generic::List_1<::StringW>* completedTutorialTips;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // private System.String CLCAFGPDNPE
    // Size: 0x8
    // Offset: 0x3E8
    ::StringW CLCAFGPDNPE;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public MagicalActual.PlayerRig myRig
    // Size: 0x8
    // Offset: 0x3F0
    ::MagicalActual::PlayerRig* myRig;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerRig*) == 0x8);
    // public UnityEngine.AudioSource guiAudioPlayer
    // Size: 0x8
    // Offset: 0x3F8
    ::UnityEngine::AudioSource* guiAudioPlayer;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private MagicalActual.CinematicManager MPOOJFCAHJM
    // Size: 0x8
    // Offset: 0x400
    ::MagicalActual::CinematicManager* MPOOJFCAHJM;
    // Field size check
    static_assert(sizeof(::MagicalActual::CinematicManager*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.Collections.Generic.List`1<UnityEngine.GameObject>> CBMFKAKCOAJ
    // Size: 0x8
    // Offset: 0x408
    ::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*>* CBMFKAKCOAJ;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.String> IPJDHOCFIFK
    // Size: 0x8
    // Offset: 0x410
    ::System::Collections::Generic::List_1<::StringW>* IPJDHOCFIFK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.Dictionary`2<System.String,MagicalActual.PlayerAvatar> nearbyPlayerAvatars
    // Size: 0x8
    // Offset: 0x418
    ::System::Collections::Generic::Dictionary_2<::StringW, ::MagicalActual::PlayerAvatar*>* nearbyPlayerAvatars;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::MagicalActual::PlayerAvatar*>*) == 0x8);
    // public System.Collections.Generic.List`1<MagicalActual.PlayerAvatar> superNearbyPlayerAvatars
    // Size: 0x8
    // Offset: 0x420
    ::System::Collections::Generic::List_1<::MagicalActual::PlayerAvatar*>* superNearbyPlayerAvatars;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::PlayerAvatar*>*) == 0x8);
    // public System.Collections.Generic.List`1<MagicalActual.PlayerAvatar> nearbyPlayerList
    // Size: 0x8
    // Offset: 0x428
    ::System::Collections::Generic::List_1<::MagicalActual::PlayerAvatar*>* nearbyPlayerList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::PlayerAvatar*>*) == 0x8);
    // private UnityEngine.Collider[] EKEIPIOMLMI
    // Size: 0x8
    // Offset: 0x430
    ::ArrayW<::UnityEngine::Collider*> EKEIPIOMLMI;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4078
    // private System.Boolean <BPJKCMDPBPM>k__BackingField
    // Size: 0x1
    // Offset: 0x438
    bool BPJKCMDPBPM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BPJKCMDPBPM and: NPNELFHKMEO
    char __padding135[0x3] = {};
    // private System.Single NPNELFHKMEO
    // Size: 0x4
    // Offset: 0x43C
    float NPNELFHKMEO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single HDGMDIBGHGN
    // Size: 0x4
    // Offset: 0x440
    float HDGMDIBGHGN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean MHDBFLKAFFA
    // Size: 0x1
    // Offset: 0x444
    bool MHDBFLKAFFA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean leftMenuButtonDown
    // Size: 0x1
    // Offset: 0x445
    bool leftMenuButtonDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean rightMenuButtonDown
    // Size: 0x1
    // Offset: 0x446
    bool rightMenuButtonDown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean BMAGJHADIIP
    // Size: 0x1
    // Offset: 0x447
    bool BMAGJHADIIP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean PersonalBubbleActive
    // Size: 0x1
    // Offset: 0x448
    bool PersonalBubbleActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PersonalBubbleActive and: GFIGEOAHFOB
    char __padding142[0x3] = {};
    // private System.Single GFIGEOAHFOB
    // Size: 0x4
    // Offset: 0x44C
    float GFIGEOAHFOB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KMIBKGLGMGH
    // Size: 0x4
    // Offset: 0x450
    float KMIBKGLGMGH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single COILKGIDFFL
    // Size: 0x4
    // Offset: 0x454
    float COILKGIDFFL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FOCDFCKOHMC
    // Size: 0x4
    // Offset: 0x458
    float FOCDFCKOHMC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean JCKBPEPJJEE
    // Size: 0x1
    // Offset: 0x45C
    bool JCKBPEPJJEE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JCKBPEPJJEE and: personalBubbleVfx
    char __padding147[0x3] = {};
    // public UnityEngine.GameObject personalBubbleVfx
    // Size: 0x8
    // Offset: 0x460
    ::UnityEngine::GameObject* personalBubbleVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE40B8
    // private MagicalActual.TeleportPillar <DDFPDILIODG>k__BackingField
    // Size: 0x8
    // Offset: 0x468
    ::MagicalActual::TeleportPillar* DDFPDILIODG;
    // Field size check
    static_assert(sizeof(::MagicalActual::TeleportPillar*) == 0x8);
    // private SteamVR_Events/Action IGFCIPFBPOB
    // Size: 0x8
    // Offset: 0x470
    ::GlobalNamespace::SteamVR_Events::Action* IGFCIPFBPOB;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE40C8
    // private System.Boolean <JKGFAHFJAEN>k__BackingField
    // Size: 0x1
    // Offset: 0x478
    bool JKGFAHFJAEN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JKGFAHFJAEN and: PKGLEENEHFH
    char __padding151[0x3] = {};
    // private UnityEngine.Quaternion PKGLEENEHFH
    // Size: 0x10
    // Offset: 0x47C
    ::UnityEngine::Quaternion PKGLEENEHFH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion IBPMPNODFDD
    // Size: 0x10
    // Offset: 0x48C
    ::UnityEngine::Quaternion IBPMPNODFDD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: IBPMPNODFDD and: boostBombIcons
    char __padding153[0x4] = {};
    // public System.Collections.Generic.List`1<MagicalActual.BoostBombIcon> boostBombIcons
    // Size: 0x8
    // Offset: 0x4A0
    ::System::Collections::Generic::List_1<::MagicalActual::BoostBombIcon*>* boostBombIcons;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::BoostBombIcon*>*) == 0x8);
    // private UnityEngine.ParticleSystem boostBombNotification
    // Size: 0x8
    // Offset: 0x4A8
    ::UnityEngine::ParticleSystem* boostBombNotification;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> HKJIAAPLGBA
    // Size: 0x8
    // Offset: 0x4B0
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* HKJIAAPLGBA;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt HCJLOAPJKMC
    // Size: 0x19
    // Offset: 0x4B8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt HCJLOAPJKMC;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: HCJLOAPJKMC and: FADIKGAMJPK
    char __padding157[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt FADIKGAMJPK
    // Size: 0x19
    // Offset: 0x4D8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt FADIKGAMJPK;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: FADIKGAMJPK and: AOKDJBIMHDL
    char __padding158[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt AOKDJBIMHDL
    // Size: 0x19
    // Offset: 0x4F8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt AOKDJBIMHDL;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: AOKDJBIMHDL and: EBBLBJKBJBD
    char __padding159[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt EBBLBJKBJBD
    // Size: 0x19
    // Offset: 0x518
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt EBBLBJKBJBD;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: EBBLBJKBJBD and: HFJEFOFOKBF
    char __padding160[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObscuredBool HFJEFOFOKBF
    // Size: 0xB
    // Offset: 0x538
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool HFJEFOFOKBF;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool) == 0xB);
    // Padding between fields: HFJEFOFOKBF and: goodPointGuidePrefab
    char __padding161[0x5] = {};
    // public UnityEngine.GameObject goodPointGuidePrefab
    // Size: 0x8
    // Offset: 0x548
    ::UnityEngine::GameObject* goodPointGuidePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject[] EFJLLKPCFBO
    // Size: 0x8
    // Offset: 0x550
    ::ArrayW<::UnityEngine::GameObject*> EFJLLKPCFBO;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt ELNKOMDHGLM
    // Size: 0x19
    // Offset: 0x558
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt ELNKOMDHGLM;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: ELNKOMDHGLM and: BFNAAAOPPFL
    char __padding164[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt BFNAAAOPPFL
    // Size: 0x19
    // Offset: 0x578
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt BFNAAAOPPFL;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: BFNAAAOPPFL and: FLKKDJMNEBK
    char __padding165[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObscuredBool FLKKDJMNEBK
    // Size: 0xB
    // Offset: 0x598
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool FLKKDJMNEBK;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool) == 0xB);
    // Padding between fields: FLKKDJMNEBK and: JFJMDPIJBDH
    char __padding166[0x5] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt JFJMDPIJBDH
    // Size: 0x19
    // Offset: 0x5A8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt JFJMDPIJBDH;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: JFJMDPIJBDH and: NAFDDOEJEJB
    char __padding167[0x7] = {};
    // private MagicalActual.OrbusBillboard[] NAFDDOEJEJB
    // Size: 0x8
    // Offset: 0x5C8
    ::ArrayW<::MagicalActual::OrbusBillboard*> NAFDDOEJEJB;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::OrbusBillboard*>) == 0x8);
    // public UnityEngine.GameObject honorKillNoticePrefab
    // Size: 0x8
    // Offset: 0x5D0
    ::UnityEngine::GameObject* honorKillNoticePrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject grindToolPrefab
    // Size: 0x8
    // Offset: 0x5D8
    ::UnityEngine::GameObject* grindToolPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> boostBombPrefabs
    // Size: 0x8
    // Offset: 0x5E0
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* boostBombPrefabs;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public UnityEngine.GameObject ToolTipPointer
    // Size: 0x8
    // Offset: 0x5E8
    ::UnityEngine::GameObject* ToolTipPointer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Events.UnityEvent InventoryChangedEvent
    // Size: 0x8
    // Offset: 0x5F0
    ::UnityEngine::Events::UnityEvent* InventoryChangedEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public MagicalActual.ClimableWall currentClimableWall
    // Size: 0x8
    // Offset: 0x5F8
    ::MagicalActual::ClimableWall* currentClimableWall;
    // Field size check
    static_assert(sizeof(::MagicalActual::ClimableWall*) == 0x8);
    // public System.Boolean isFalling
    // Size: 0x1
    // Offset: 0x600
    bool isFalling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isFalling and: badObjectOverlay
    char __padding175[0x7] = {};
    // public UnityEngine.SpriteRenderer badObjectOverlay
    // Size: 0x8
    // Offset: 0x608
    ::UnityEngine::SpriteRenderer* badObjectOverlay;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpriteRenderer*) == 0x8);
    // private UnityEngine.RaycastHit[] FGGNFCILCCH
    // Size: 0x8
    // Offset: 0x610
    ::ArrayW<::UnityEngine::RaycastHit> FGGNFCILCCH;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt BGJNAJFEGKK
    // Size: 0x19
    // Offset: 0x618
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt BGJNAJFEGKK;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: BGJNAJFEGKK and: BMAEKONGKJG
    char __padding178[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt BMAEKONGKJG
    // Size: 0x19
    // Offset: 0x638
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt BMAEKONGKJG;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: BMAEKONGKJG and: BMLHFLPNLJJ
    char __padding179[0x7] = {};
    // private System.Boolean BMLHFLPNLJJ
    // Size: 0x1
    // Offset: 0x658
    bool BMLHFLPNLJJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BMLHFLPNLJJ and: nearbyPlayers
    char __padding180[0x7] = {};
