// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MagicalActual.DynamicEvent
#include "MagicalActual/DynamicEvent.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PortalEventNetComponent
  class PortalEventNetComponent;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PortalEventNetComponent);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PortalEventNetComponent*, "MagicalActual", "PortalEventNetComponent");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PortalEventNetComponent
  // [TokenAttribute] Offset: FFFFFFFF
  class PortalEventNetComponent : public ::MagicalActual::DynamicEvent {
    public:
    // Writing base type padding for base size: 0x92 to desired offset: 0x98
    char ___base_padding[0x6] = {};
    public:
    // private UnityEngine.GameObject portal
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::GameObject* portal;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 baseProgressNeeded
    // Size: 0x4
    // Offset: 0xA0
    int baseProgressNeeded;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 progressNeededPerAdditionalPlayer
    // Size: 0x4
    // Offset: 0xA4
    int progressNeededPerAdditionalPlayer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean spawnInWaves
    // Size: 0x1
    // Offset: 0xA8
    bool spawnInWaves;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: spawnInWaves and: CEJDIBBJBPJ
    char __padding3[0x3] = {};
    // protected System.Single CEJDIBBJBPJ
    // Size: 0x4
    // Offset: 0xAC
    float CEJDIBBJBPJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.GameObject portal
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_portal();
    // Get instance field reference: private System.Int32 baseProgressNeeded
    [[deprecated("Use field access instead!")]] int& dyn_baseProgressNeeded();
    // Get instance field reference: private System.Int32 progressNeededPerAdditionalPlayer
    [[deprecated("Use field access instead!")]] int& dyn_progressNeededPerAdditionalPlayer();
    // Get instance field reference: private System.Boolean spawnInWaves
    [[deprecated("Use field access instead!")]] bool& dyn_spawnInWaves();
    // Get instance field reference: protected System.Single CEJDIBBJBPJ
    [[deprecated("Use field access instead!")]] float& dyn_CEJDIBBJBPJ();
    // protected System.Void LOLECAOJPIM(System.String CAGOMPGOIPH)
    // Offset: 0x1B05A98
    void LOLECAOJPIM(::StringW CAGOMPGOIPH);
    // protected System.Void HPNBLGKPLFA()
    // Offset: 0x1B05AEC
    void HPNBLGKPLFA();
    // private System.Void KDJEPHJPLND(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B05C70
    void KDJEPHJPLND(::Il2CppObject* OMLPNCLFFMJ);
    // protected System.Void EIKKCFCMBEB()
    // Offset: 0x1B05D18
    void EIKKCFCMBEB();
    // protected System.Void GGEIGNKIOMG()
    // Offset: 0x1B05DB4
    void GGEIGNKIOMG();
    // public System.Void NEMKNLGDEAK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1B05E50
    void NEMKNLGDEAK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void LKIANHCIHBM()
    // Offset: 0x1B05F14
    void LKIANHCIHBM();
    // private System.Void JAABPAELPGH(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B0604C
    void JAABPAELPGH(::Il2CppObject* OMLPNCLFFMJ);
    // protected System.Void CKKKFHFOODI()
    // Offset: 0x1B060F4
    void CKKKFHFOODI();
    // public System.Void KMPPLBBIMGJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1B06148
    void KMPPLBBIMGJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void GOKMOBEADLE()
    // Offset: 0x1B0620C
    void GOKMOBEADLE();
    // protected System.Void JLCBACMOLGG()
    // Offset: 0x1B06394
    void JLCBACMOLGG();
    // protected System.Void HPNALKDLLFK()
    // Offset: 0x1B063E0
    void HPNALKDLLFK();
    // public System.Void HMKJKOKPOBP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1B0647C
    void HMKJKOKPOBP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void OPHIEKNBONA()
    // Offset: 0x1B06540
    void OPHIEKNBONA();
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1B0658C
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected System.Void NBABOIHAGDO(System.String CAGOMPGOIPH)
    // Offset: 0x1B06714
    void NBABOIHAGDO(::StringW CAGOMPGOIPH);
    // protected System.Void HHODANFNPGN()
    // Offset: 0x1B06804
    void HHODANFNPGN();
    // protected System.Void MOCCIJJHION()
    // Offset: 0x1B069D0
    void MOCCIJJHION();
    // protected System.Void IPIFMKAGODD()
    // Offset: 0x1B06B54
    void IPIFMKAGODD();
    // protected System.Void CHDHKHKKHBO(System.String CAGOMPGOIPH)
    // Offset: 0x1B06BB0
    void CHDHKHKKHBO(::StringW CAGOMPGOIPH);
    // private System.Void MJCMIAOBLPB(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B06C04
    void MJCMIAOBLPB(::Il2CppObject* OMLPNCLFFMJ);
    // protected System.Void BLBOFGLGKNL()
    // Offset: 0x1B06CAC
    void BLBOFGLGKNL();
    // protected System.Void EPPEGOHGDAM(System.String CAGOMPGOIPH)
    // Offset: 0x1B06D48
    void EPPEGOHGDAM(::StringW CAGOMPGOIPH);
    // private System.Void MLLJMAHILIA(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B06D9C
    void MLLJMAHILIA(::Il2CppObject* OMLPNCLFFMJ);
    // protected System.Void OEMMGAMOIHF()
    // Offset: 0x1B06E44
    void OEMMGAMOIHF();
    // protected System.Void OKMFFNKFMBP()
    // Offset: 0x1B06EE0
    void OKMFFNKFMBP();
    // protected System.Void EKPMJBDKAOD()
    // Offset: 0x1B06F7C
    void EKPMJBDKAOD();
    // protected System.Void BBHLGNCKNIA()
    // Offset: 0x1B07018
    void BBHLGNCKNIA();
    // protected System.Void EEDOOBJLGJB()
    // Offset: 0x1B070B4
    void EEDOOBJLGJB();
    // protected System.Void BFBHGDHDJOE()
    // Offset: 0x1B07238
    void BFBHGDHDJOE();
    // private System.Void ELNLHPDPPEM(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B07284
    void ELNLHPDPPEM(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void DFKNDJPFOHB(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B0732C
    void DFKNDJPFOHB(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void LJAJEBELPMP(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B073D4
    void LJAJEBELPMP(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void JGLIEBCBMGJ(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B0747C
    void JGLIEBCBMGJ(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FGKPHGCJGJE(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B07524
    void FGKPHGCJGJE(::Il2CppObject* OMLPNCLFFMJ);
    // protected System.Void EDHBPPDFBDE()
    // Offset: 0x1B075CC
    void EDHBPPDFBDE();
    // private System.Void BGNFEFLKJMA(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B07618
    void BGNFEFLKJMA(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void FMBNFLCJMMF(System.Object OMLPNCLFFMJ)
    // Offset: 0x1B076C0
    void FMBNFLCJMMF(::Il2CppObject* OMLPNCLFFMJ);
    // protected override System.Void KFFCCALBHMA()
    // Offset: 0x1B05FB0
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::KFFCCALBHMA()
    void KFFCCALBHMA();
    // protected override System.Void Start()
    // Offset: 0x1B06140
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::Start()
    void Start();
    // protected override System.Void AKMECKCJAJF()
    // Offset: 0x1B06214
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::AKMECKCJAJF()
    void AKMECKCJAJF();
    // public override System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x1B06650
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // protected override System.Void EEKJFACLAJO()
    // Offset: 0x1B06768
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::EEKJFACLAJO()
    void EEKJFACLAJO();
    // protected override System.Void GOCPJLOLIKK()
    // Offset: 0x1B06984
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::GOCPJLOLIKK()
    void GOCPJLOLIKK();
    // protected override System.Void PMFPHOLFCFI(System.String CAGOMPGOIPH)
    // Offset: 0x1B06B5C
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::PMFPHOLFCFI(System.String CAGOMPGOIPH)
    void PMFPHOLFCFI(::StringW CAGOMPGOIPH);
    // public System.Void .ctor()
    // Offset: 0x1B07768
    // Implemented from: MagicalActual.DynamicEvent
    // Base method: System.Void DynamicEvent::.ctor()
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static PortalEventNetComponent* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::PortalEventNetComponent::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<PortalEventNetComponent*, creationType>()));
    }
  }; // MagicalActual.PortalEventNetComponent
  #pragma pack(pop)
  static check_size<sizeof(PortalEventNetComponent), 172 + sizeof(float)> __MagicalActual_PortalEventNetComponentSizeCheck;
  static_assert(sizeof(PortalEventNetComponent) == 0xB0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::PortalEventNetComponent::LOLECAOJPIM
// Il2CppName: LOLECAOJPIM
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::PortalEventNetComponent::*)(::StringW)>(&MagicalActual::PortalEventNetComponent::LOLECAOJPIM)> {
  static const MethodInfo* get() {
    static auto* CAGOMPGOIPH = &::il2cpp_utils::GetClassFromName("System", "String")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::PortalEventNetComponent*), "LOLECAOJPIM", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CAGOMPGOIPH});
  }
};
// Writing MetadataGetter for method: MagicalActual::PortalEventNetComponent::HPNBLGKPLFA
// Il2CppName: HPNBLGKPLFA
template<>
