// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: BezierSplineWalker
  class BezierSplineWalker;
  // Forward declaring type: BezierSpline
  class BezierSpline;
  // Forward declaring type: SlugInteractable
  class SlugInteractable;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PortalArrow
  class PortalArrow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::PortalArrow);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::PortalArrow*, "MagicalActual", "PortalArrow");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x97
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.PortalArrow
  // [TokenAttribute] Offset: FFFFFFFF
  class PortalArrow : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::PortalArrow::$$c
    class $$c;
    public:
    // private UnityEngine.Transform arrow
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* arrow;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private MagicalActual.BezierSplineWalker walker
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::BezierSplineWalker* walker;
    // Field size check
    static_assert(sizeof(::MagicalActual::BezierSplineWalker*) == 0x8);
    // private MagicalActual.BezierSpline spline
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::BezierSpline* spline;
    // Field size check
    static_assert(sizeof(::MagicalActual::BezierSpline*) == 0x8);
    // private UnityEngine.Transform endTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* endTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform slugStart
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* slugStart;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public MagicalActual.SlugInteractable slug
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::SlugInteractable* slug;
    // Field size check
    static_assert(sizeof(::MagicalActual::SlugInteractable*) == 0x8);
    // private System.Single timeUntilMonster
    // Size: 0x4
    // Offset: 0x48
    float timeUntilMonster;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: timeUntilMonster and: INIFCCFINGH
    char __padding6[0x4] = {};
    // private PhysicsInteractable INIFCCFINGH
    // Size: 0x8
    // Offset: 0x50
    ::GlobalNamespace::PhysicsInteractable* INIFCCFINGH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.Transform DNFLFKPOKIK
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* DNFLFKPOKIK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Rigidbody COAGEBHFBCF
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Rigidbody* COAGEBHFBCF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Vector3 KCOKPGCNCLA
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 KCOKPGCNCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 CPJOODOLKCD
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 CPJOODOLKCD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // protected MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x80
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x88
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.UInt16 PAAOBEIDFPN
    // Size: 0x2
    // Offset: 0x90
    uint16_t PAAOBEIDFPN;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.Boolean FCBDBGELBGF
    // Size: 0x1
    // Offset: 0x92
    bool FCBDBGELBGF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AHMEMCFDOPO
    // Size: 0x1
    // Offset: 0x93
    bool AHMEMCFDOPO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AAHFDLDPBHE
    // Size: 0x1
    // Offset: 0x94
    bool AAHFDLDPBHE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GAAHPJIFLGF
    // Size: 0x1
    // Offset: 0x95
    bool GAAHPJIFLGF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AGBJPGKPEEJ
    // Size: 0x1
    // Offset: 0x96
    bool AGBJPGKPEEJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Transform arrow
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_arrow();
    // Get instance field reference: private MagicalActual.BezierSplineWalker walker
    [[deprecated("Use field access instead!")]] ::MagicalActual::BezierSplineWalker*& dyn_walker();
    // Get instance field reference: private MagicalActual.BezierSpline spline
    [[deprecated("Use field access instead!")]] ::MagicalActual::BezierSpline*& dyn_spline();
    // Get instance field reference: private UnityEngine.Transform endTransform
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_endTransform();
