// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: JournalPage
  class JournalPage;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PageCurl
  class PageCurl;
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: LODGroup
  class LODGroup;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ReadableBook
  class ReadableBook;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ReadableBook);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ReadableBook*, "MagicalActual", "ReadableBook");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ReadableBook
  // [TokenAttribute] Offset: FFFFFFFF
  class ReadableBook : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::ReadableBook::$FlipToPageIdx$d__47
    class $FlipToPageIdx$d__47;
    public:
    // private PageCurl OELCNEHKCNI
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::PageCurl* OELCNEHKCNI;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PageCurl*) == 0x8);
    // private PageCurl LMAJHLLHBKP
    // Size: 0x8
    // Offset: 0x20
    ::GlobalNamespace::PageCurl* LMAJHLLHBKP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PageCurl*) == 0x8);
    // private System.Boolean DNNOHKCMIMC
    // Size: 0x1
    // Offset: 0x28
    bool DNNOHKCMIMC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DNNOHKCMIMC and: EGINMDGJGPB
    char __padding2[0x7] = {};
    // private UnityEngine.GameObject EGINMDGJGPB
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* EGINMDGJGPB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bookFrontCover
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* bookFrontCover;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject bookBackCover
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* bookBackCover;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.AudioSource GHPLEIOBCOD
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::AudioSource* GHPLEIOBCOD;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioClip bookOpenSfx
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AudioClip* bookOpenSfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip pageTurnSfx
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::AudioClip* pageTurnSfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // private System.Int32 KHIJICBNJBC
    // Size: 0x4
    // Offset: 0x60
    int KHIJICBNJBC;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: KHIJICBNJBC and: OACOBKMNPAK
    char __padding9[0x4] = {};
    // private System.Collections.Generic.List`1<PageCurl> OACOBKMNPAK
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::GlobalNamespace::PageCurl*>* OACOBKMNPAK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::PageCurl*>*) == 0x8);
    // private System.Collections.Generic.List`1<PageCurl> COINNKFIBAC
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::GlobalNamespace::PageCurl*>* COINNKFIBAC;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::PageCurl*>*) == 0x8);
    // private UnityEngine.Texture2D[] NAKKCNMFGMD
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Texture2D*> NAKKCNMFGMD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // private System.Single IOPBDHFNAJG
    // Size: 0x4
    // Offset: 0x80
    float IOPBDHFNAJG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: IOPBDHFNAJG and: KKAIAAEEHGK
    char __padding13[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE4DE0
    // private System.Collections.Generic.List`1<MagicalActual.JournalPage> <KKAIAAEEHGK>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::MagicalActual::JournalPage*>* KKAIAAEEHGK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::JournalPage*>*) == 0x8);
    // private System.Int32 GLOKLPOAFGJ
    // Size: 0x4
    // Offset: 0x90
    int GLOKLPOAFGJ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 IIODPKPCIOC
    // Size: 0x4
    // Offset: 0x94
    int IIODPKPCIOC;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean GBOEBPEHGOA
    // Size: 0x1
    // Offset: 0x98
    bool GBOEBPEHGOA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GBOEBPEHGOA and: ABGIGCCOIND
    char __padding17[0x3] = {};
    // private System.Single ABGIGCCOIND
    // Size: 0x4
    // Offset: 0x9C
    float ABGIGCCOIND;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 FEMADPFCMND
    // Size: 0x4
    // Offset: 0xA0
    int FEMADPFCMND;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 ACACHKIIBGC
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 ACACHKIIBGC;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 BPIGECHIBHK
    // Size: 0xC
    // Offset: 0xB0
    ::UnityEngine::Vector3 BPIGECHIBHK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 FIJNBFPPNAA
    // Size: 0xC
    // Offset: 0xBC
    ::UnityEngine::Vector3 FIJNBFPPNAA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 EOLJDBILNJJ
    // Size: 0xC
    // Offset: 0xC8
    ::UnityEngine::Vector3 EOLJDBILNJJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean closeWhenDropped
    // Size: 0x1
    // Offset: 0xD4
    bool closeWhenDropped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: closeWhenDropped and: EIPMBKLODIJ
    char __padding24[0x3] = {};
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private PhysicsInteractable NENLBJKDCFP
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::PhysicsInteractable* NENLBJKDCFP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.Vector3 FKKFPPDHEBJ
    // Size: 0xC
    // Offset: 0xE8
    ::UnityEngine::Vector3 FKKFPPDHEBJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion BAHHCAAFOIP
    // Size: 0x10
    // Offset: 0xF4
    ::UnityEngine::Quaternion BAHHCAAFOIP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: BAHHCAAFOIP and: OEEIAGLNEPK
    char __padding28[0x4] = {};
    // private UnityEngine.LODGroup OEEIAGLNEPK
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::LODGroup* OEEIAGLNEPK;
    // Field size check
    static_assert(sizeof(::UnityEngine::LODGroup*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private PageCurl OELCNEHKCNI
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PageCurl*& dyn_OELCNEHKCNI();
    // Get instance field reference: private PageCurl LMAJHLLHBKP
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PageCurl*& dyn_LMAJHLLHBKP();
    // Get instance field reference: private System.Boolean DNNOHKCMIMC
    [[deprecated("Use field access instead!")]] bool& dyn_DNNOHKCMIMC();
    // Get instance field reference: private UnityEngine.GameObject EGINMDGJGPB
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_EGINMDGJGPB();
