// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: RelocationGrabPoint
  class RelocationGrabPoint;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::RelocationGrabPoint);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::RelocationGrabPoint*, "MagicalActual", "RelocationGrabPoint");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.RelocationGrabPoint
  // [TokenAttribute] Offset: FFFFFFFF
  class RelocationGrabPoint : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x18
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: EENJNFDNJBD
    char __padding0[0x7] = {};
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private PhysicsInteractable NENLBJKDCFP
    // Size: 0x8
    // Offset: 0x30
    ::GlobalNamespace::PhysicsInteractable* NENLBJKDCFP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private UnityEngine.MeshRenderer PKMIHKFEJDO
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshRenderer* PKMIHKFEJDO;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Vector3 FKKFPPDHEBJ
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 FKKFPPDHEBJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion BAHHCAAFOIP
    // Size: 0x10
    // Offset: 0x4C
    ::UnityEngine::Quaternion BAHHCAAFOIP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: BAHHCAAFOIP and: JNBOAIGLFGP
    char __padding6[0x4] = {};
    // private UnityEngine.Transform JNBOAIGLFGP
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* JNBOAIGLFGP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject objectToMove
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* objectToMove;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 GFKCJOCPBND
    // Size: 0xC
    // Offset: 0x70
    ::UnityEngine::Vector3 GFKCJOCPBND;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 EHEEKKBGHLG
    // Size: 0xC
    // Offset: 0x7C
    ::UnityEngine::Vector3 EHEEKKBGHLG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 PBOJKNHFCPG
    // Size: 0xC
    // Offset: 0x88
    ::UnityEngine::Vector3 PBOJKNHFCPG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean DLCHEMODKHH
    // Size: 0x1
    // Offset: 0x94
    bool DLCHEMODKHH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PLLJBLCOOLJ
    // Size: 0x1
    // Offset: 0x95
    bool PLLJBLCOOLJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PLLJBLCOOLJ and: objectToMoveName
    char __padding13[0x2] = {};
    // public System.String objectToMoveName
    // Size: 0x8
    // Offset: 0x98
    ::StringW objectToMoveName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
    // Get instance field reference: private MagicalActual.PlayerAvatar EENJNFDNJBD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerAvatar*& dyn_EENJNFDNJBD();
    // Get instance field reference: private UnityEngine.Rigidbody EIPMBKLODIJ
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_EIPMBKLODIJ();
    // Get instance field reference: private PhysicsInteractable NENLBJKDCFP
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::PhysicsInteractable*& dyn_NENLBJKDCFP();
