// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: RigBasedAdjustment
  class RigBasedAdjustment;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::RigBasedAdjustment);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::RigBasedAdjustment*, "MagicalActual", "RigBasedAdjustment");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x89
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.RigBasedAdjustment
  // [TokenAttribute] Offset: FFFFFFFF
  class RigBasedAdjustment : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.Vector3 rotationAdjustmentTouch
    // Size: 0xC
    // Offset: 0x18
    ::UnityEngine::Vector3 rotationAdjustmentTouch;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 positionAdjustmentTouch
    // Size: 0xC
    // Offset: 0x24
    ::UnityEngine::Vector3 positionAdjustmentTouch;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion finalQuaternionTouch
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Quaternion finalQuaternionTouch;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 rotationAdjustmentSteam
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 rotationAdjustmentSteam;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 positionAdjustmentSteam
    // Size: 0xC
    // Offset: 0x4C
    ::UnityEngine::Vector3 positionAdjustmentSteam;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rotationAdjustmentIndex
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 rotationAdjustmentIndex;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 positionAdjustmentIndex
    // Size: 0xC
    // Offset: 0x64
    ::UnityEngine::Vector3 positionAdjustmentIndex;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 KIHMHNKNFAE
    // Size: 0xC
    // Offset: 0x70
    ::UnityEngine::Vector3 KIHMHNKNFAE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 GIKPHCEBBDE
    // Size: 0xC
    // Offset: 0x7C
    ::UnityEngine::Vector3 GIKPHCEBBDE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean adjustmentApplied
    // Size: 0x1
    // Offset: 0x88
    bool adjustmentApplied;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Vector3 rotationAdjustmentTouch
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_rotationAdjustmentTouch();
    // Get instance field reference: public UnityEngine.Vector3 positionAdjustmentTouch
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_positionAdjustmentTouch();
    // Get instance field reference: public UnityEngine.Quaternion finalQuaternionTouch
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_finalQuaternionTouch();
    // Get instance field reference: public UnityEngine.Vector3 rotationAdjustmentSteam
