// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: DamageParams
  class DamageParams;
  // Skipping declaration: AI_STATE because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: MeshCollider
  class MeshCollider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: RockBoss
  class RockBoss;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::RockBoss);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::RockBoss*, "MagicalActual", "RockBoss");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x9C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.RockBoss
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD7A9C
  // [RequireComponent] Offset: AD7A9C
  class RockBoss : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::RockBoss::AI_STATE
    struct AI_STATE;
    // Nested type: ::MagicalActual::RockBoss::$finishSpawn$d__29
    class $finishSpawn$d__29;
    // Nested type: ::MagicalActual::RockBoss::$FinishGroundSlam$d__32
    class $FinishGroundSlam$d__32;
    // Nested type: ::MagicalActual::RockBoss::$FinishRockThrow$d__35
    class $FinishRockThrow$d__35;
    // Nested type: ::MagicalActual::RockBoss::$DropBoulders$d__40
    class $DropBoulders$d__40;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.RockBoss/AI_STATE
    // [TokenAttribute] Offset: FFFFFFFF
    struct AI_STATE/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AI_STATE
      constexpr AI_STATE(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.RockBoss/AI_STATE FNCIFCNLJBM
      static constexpr const int FNCIFCNLJBM = 0;
      // Get static field: static public MagicalActual.RockBoss/AI_STATE FNCIFCNLJBM
      static ::MagicalActual::RockBoss::AI_STATE _get_FNCIFCNLJBM();
      // Set static field: static public MagicalActual.RockBoss/AI_STATE FNCIFCNLJBM
      static void _set_FNCIFCNLJBM(::MagicalActual::RockBoss::AI_STATE value);
      // static field const value: static public MagicalActual.RockBoss/AI_STATE PMGGPLGBCNH
      static constexpr const int PMGGPLGBCNH = 1;
      // Get static field: static public MagicalActual.RockBoss/AI_STATE PMGGPLGBCNH
      static ::MagicalActual::RockBoss::AI_STATE _get_PMGGPLGBCNH();
      // Set static field: static public MagicalActual.RockBoss/AI_STATE PMGGPLGBCNH
      static void _set_PMGGPLGBCNH(::MagicalActual::RockBoss::AI_STATE value);
      // static field const value: static public MagicalActual.RockBoss/AI_STATE NMGAECHJKEO
      static constexpr const int NMGAECHJKEO = 2;
      // Get static field: static public MagicalActual.RockBoss/AI_STATE NMGAECHJKEO
      static ::MagicalActual::RockBoss::AI_STATE _get_NMGAECHJKEO();
      // Set static field: static public MagicalActual.RockBoss/AI_STATE NMGAECHJKEO
      static void _set_NMGAECHJKEO(::MagicalActual::RockBoss::AI_STATE value);
      // static field const value: static public MagicalActual.RockBoss/AI_STATE JBJOCEINIHD
      static constexpr const int JBJOCEINIHD = 4;
      // Get static field: static public MagicalActual.RockBoss/AI_STATE JBJOCEINIHD
      static ::MagicalActual::RockBoss::AI_STATE _get_JBJOCEINIHD();
      // Set static field: static public MagicalActual.RockBoss/AI_STATE JBJOCEINIHD
      static void _set_JBJOCEINIHD(::MagicalActual::RockBoss::AI_STATE value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.RockBoss/AI_STATE
    #pragma pack(pop)
    static check_size<sizeof(RockBoss::AI_STATE), 0 + sizeof(int)> __MagicalActual_RockBoss_AI_STATESizeCheck;
    static_assert(sizeof(RockBoss::AI_STATE) == 0x4);
    public:
    // public UnityEngine.GameObject[] orbitingBoulders
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::GameObject*> orbitingBoulders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.GameObject[] IDBGAHCFNAD
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::GameObject*> IDBGAHCFNAD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private UnityEngine.Animator NBNKFBECLJG
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Animator* NBNKFBECLJG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.MeshCollider BBOMOHLELBB
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::MeshCollider* BBOMOHLELBB;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshCollider*) == 0x8);
    // private System.Single BBONPLEDFLA
    // Size: 0x4
    // Offset: 0x40
    float BBONPLEDFLA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CCMLIMLLHCP
    // Size: 0x4
    // Offset: 0x44
    float CCMLIMLLHCP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean AEPELIIAEGH
    // Size: 0x1
    // Offset: 0x48
    bool AEPELIIAEGH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GJKOLILBJAP
    // Size: 0x1
    // Offset: 0x49
    bool GJKOLILBJAP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GAOFEMHIEPN
    // Size: 0x1
    // Offset: 0x4A
    bool GAOFEMHIEPN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GAOFEMHIEPN and: CHAOEEDPMNH
    char __padding9[0x1] = {};
    // private System.Single CHAOEEDPMNH
    // Size: 0x4
    // Offset: 0x4C
    float CHAOEEDPMNH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single COJEHKOEOLN
    // Size: 0x4
    // Offset: 0x50
    float COJEHKOEOLN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single KGDHKLHPKJD
    // Size: 0x4
    // Offset: 0x54
    float KGDHKLHPKJD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.GameObject HEDCBMIACJI
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* HEDCBMIACJI;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3 KFFKKPCPPOE
    // Size: 0xC
    // Offset: 0x60
    ::UnityEngine::Vector3 KFFKKPCPPOE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 HOIFEENPHDB
    // Size: 0xC
    // Offset: 0x6C
    ::UnityEngine::Vector3 HOIFEENPHDB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single BJOHKIHOEMB
    // Size: 0x4
    // Offset: 0x78
    float BJOHKIHOEMB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single GCFPAGNBFBC
    // Size: 0x4
    // Offset: 0x7C
    float GCFPAGNBFBC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IEIEKLNEHOF
    // Size: 0x4
    // Offset: 0x80
    float IEIEKLNEHOF;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: IEIEKLNEHOF and: HMCEFHDBDOI
    char __padding18[0x4] = {};
    // private MagicalActual.PlayerCharacter HMCEFHDBDOI
    // Size: 0x8
    // Offset: 0x88
    ::MagicalActual::PlayerCharacter* HMCEFHDBDOI;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // public UnityEngine.GameObject eyeBeam
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* eyeBeam;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.RockBoss/AI_STATE GPFLJOAGINM
    // Size: 0x4
    // Offset: 0x98
    ::MagicalActual::RockBoss::AI_STATE GPFLJOAGINM;
    // Field size check
    static_assert(sizeof(::MagicalActual::RockBoss::AI_STATE) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject[] orbitingBoulders
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_orbitingBoulders();
    // Get instance field reference: private UnityEngine.GameObject[] IDBGAHCFNAD
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_IDBGAHCFNAD();
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private UnityEngine.Animator NBNKFBECLJG
