// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: RockGolemBoss
  class RockGolemBoss;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::RockGolemBoss);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::RockGolemBoss*, "MagicalActual", "RockGolemBoss");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.RockGolemBoss
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD3C78
  class RockGolemBoss : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean KOCGIEBMCEN
    // Size: 0x1
    // Offset: 0x38
    bool KOCGIEBMCEN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean KOCGIEBMCEN
    [[deprecated("Use field access instead!")]] bool& dyn_KOCGIEBMCEN();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12F9348
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12F93FC
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void PPKPHFHCELO(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12F94B0
    void PPKPHFHCELO(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KMPPLBBIMGJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12F9564
    void KMPPLBBIMGJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void ALKHPPEDLNC()
    // Offset: 0x12F9618
    void ALKHPPEDLNC();
    // private System.Void DKJFPDMDIAA(System.Object OMLPNCLFFMJ)
    // Offset: 0x12F983C
    void DKJFPDMDIAA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void DKILGFBCKHD()
    // Offset: 0x12F993C
    void DKILGFBCKHD();
    // public System.Void FMFOGAKFJGJ()
    // Offset: 0x12F9B60
    void FMFOGAKFJGJ();
    // public System.Void HMCPNNAOPLG()
    // Offset: 0x12F9D84
    void HMCPNNAOPLG();
    // public System.Void IKDGLCBOCJG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12F9FA8
    void IKDGLCBOCJG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void CIJLNGBOFCL(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FA05C
    void CIJLNGBOFCL(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void ALNIJOPENCE(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FA15C
    void ALNIJOPENCE(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void KILJDKHADHJ()
    // Offset: 0x12FA25C
    void KILJDKHADHJ();
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FA2B4
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void JBEJCKDIKIE()
    // Offset: 0x12FA368
    void JBEJCKDIKIE();
    // private System.Void JCJCMKPOAKK()
    // Offset: 0x12FA3C0
    void JCJCMKPOAKK();
    // public System.Void .ctor()
    // Offset: 0x12FA418
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RockGolemBoss* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::RockGolemBoss::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RockGolemBoss*, creationType>()));
    }
    // private System.Void KKEABMBACIC()
    // Offset: 0x12FA470
    void KKEABMBACIC();
    // public System.Void AMBHFINDKPK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FA4C8
    void AMBHFINDKPK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HJADIOCKECN()
    // Offset: 0x12FA57C
    void HJADIOCKECN();
    // public System.Void MMGEIKLBBOH()
    // Offset: 0x12FA7A0
    void MMGEIKLBBOH();
    // public System.Void Slash()
    // Offset: 0x12FA9C4
    void Slash();
    // private System.Void JDJILFHNOGP()
    // Offset: 0x12FABDC
    void JDJILFHNOGP();
    // public System.Void DBOKLBMPMJO()
    // Offset: 0x12FAC34
    void DBOKLBMPMJO();
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FAE58
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DGELIHGGOKB()
    // Offset: 0x12FAF0C
    void DGELIHGGOKB();
    // public System.Void GHHAMAIIFFG()
    // Offset: 0x12FAF64
    void GHHAMAIIFFG();
    // public System.Void OMFMIKPMPEL()
    // Offset: 0x12FB188
    void OMFMIKPMPEL();
    // private System.Void CELBFCFNKAO(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FB3AC
    void CELBFCFNKAO(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void AKEEGHHHCKK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FB4AC
    void AKEEGHHHCKK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FEJNAOBCKJK()
    // Offset: 0x12FB560
    void FEJNAOBCKJK();
    // private System.Void IGIJBKHAMJH()
    // Offset: 0x12FB5B8
    void IGIJBKHAMJH();
    // public System.Void JFBOMHHGFDN()
    // Offset: 0x12FB610
    void JFBOMHHGFDN();
    // public System.Void KDPEOPPDLLP()
    // Offset: 0x12FB834
    void KDPEOPPDLLP();
    // public System.Void KIBDAOLFNJM()
    // Offset: 0x12FBA58
    void KIBDAOLFNJM();
    // public System.Void DICPOOMKKKB(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FBC7C
    void DICPOOMKKKB(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void MJJCECBPFHN(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FBD30
    void MJJCECBPFHN(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void BFEOMBNEICE()
    // Offset: 0x12FBE30
    void BFEOMBNEICE();
    // private System.Void Awake()
    // Offset: 0x12FC054
    void Awake();
    // public System.Void OAMOHIMHKEK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FC0AC
    void OAMOHIMHKEK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GDDMNDHBECL(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FC160
    void GDDMNDHBECL(::Il2CppObject* OMLPNCLFFMJ);
  }; // MagicalActual.RockGolemBoss
  #pragma pack(pop)
  static check_size<sizeof(RockGolemBoss), 56 + sizeof(bool)> __MagicalActual_RockGolemBossSizeCheck;
  static_assert(sizeof(RockGolemBoss) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::RockGolemBoss::orbusNetInit
// Il2CppName: orbusNetInit
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::RockGolemBoss::*)(::MagicalActual::NetEntity*)>(&MagicalActual::RockGolemBoss::orbusNetInit)> {
  static const MethodInfo* get() {
    static auto* CMLIHJCOINC = &::il2cpp_utils::GetClassFromName("MagicalActual", "NetEntity")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::RockGolemBoss*), "orbusNetInit", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CMLIHJCOINC});
  }
};
// Writing MetadataGetter for method: MagicalActual::RockGolemBoss::EGJMIHFLOKP
// Il2CppName: EGJMIHFLOKP
template<>
