// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: BoxCollider
  class BoxCollider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: RockGolemBossStal
  class RockGolemBossStal;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::RockGolemBossStal);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::RockGolemBossStal*, "MagicalActual", "RockGolemBossStal");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.RockGolemBossStal
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD3CDC
  class RockGolemBossStal : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxExplode
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxExplode;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean BBBJONOEMKK
    // Size: 0x1
    // Offset: 0x30
    bool BBBJONOEMKK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BBBJONOEMKK and: BBOMOHLELBB
    char __padding3[0x7] = {};
    // private UnityEngine.BoxCollider BBOMOHLELBB
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::BoxCollider* BBOMOHLELBB;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private System.Single AMBKICPFEKG
    // Size: 0x4
    // Offset: 0x40
    float AMBKICPFEKG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: AMBKICPFEKG and: IJJGNKLFGJN
    char __padding5[0x4] = {};
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxExplode
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxExplode();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private System.Boolean BBBJONOEMKK
    [[deprecated("Use field access instead!")]] bool& dyn_BBBJONOEMKK();
    // Get instance field reference: private UnityEngine.BoxCollider BBOMOHLELBB
    [[deprecated("Use field access instead!")]] ::UnityEngine::BoxCollider*& dyn_BBOMOHLELBB();
    // Get instance field reference: private System.Single AMBKICPFEKG
    [[deprecated("Use field access instead!")]] float& dyn_AMBKICPFEKG();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // public System.Void IKDGLCBOCJG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FC260
    void IKDGLCBOCJG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FC314
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FixedUpdate()
    // Offset: 0x12FC3C8
    void FixedUpdate();
    // private System.Void ELPKOLBFKKH(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FC80C
    void ELPKOLBFKKH(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void IPKKJINNGAF()
    // Offset: 0x12FC8CC
    void IPKKJINNGAF();
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x12FCD24
    void MLGBKBMHHLE();
    // private System.Void CBMDGNKFPIO()
    // Offset: 0x12FCD94
    void CBMDGNKFPIO();
    // private System.Void NLFOPEAGLDJ()
    // Offset: 0x12FCE04
    void NLFOPEAGLDJ();
    // private System.Void KCGMGLFHADE(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FD25C
    void KCGMGLFHADE(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FD31C
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void MDHBNHLHENF(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FD3D0
    void MDHBNHLHENF(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void IEDNIMMEJBL(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FD490
    void IEDNIMMEJBL(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void JPHNAIDIBKL()
    // Offset: 0x12FD544
    void JPHNAIDIBKL();
    // private System.Void KBDGAPMJGLG()
    // Offset: 0x12FD998
    void KBDGAPMJGLG();
    // private System.Void BLIPCIAAIHI()
    // Offset: 0x12FDA08
    void BLIPCIAAIHI();
    // private System.Void ADEAANMBJHG(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FDE5C
    void ADEAANMBJHG(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void HPLMDBLBIGA(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FDF1C
    void HPLMDBLBIGA(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void DKDBFFDLADP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FDFDC
    void DKDBFFDLADP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void HMKJKOKPOBP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FE090
    void HMKJKOKPOBP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void KPKMPPAFLIP(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FE144
    void KPKMPPAFLIP(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void Start()
    // Offset: 0x12FE204
    void Start();
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FE274
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void AMIPIMKIJMO()
    // Offset: 0x12FE328
    void AMIPIMKIJMO();
    // private System.Void CBONELJOGDI(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FE77C
    void CBONELJOGDI(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void MMJIKEBHBJF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FE83C
    void MMJIKEBHBJF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FMBPKKIEOJF(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FE8F0
    void FMBPKKIEOJF(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void OBCBPLBPHJJ(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FE9B0
    void OBCBPLBPHJJ(::Il2CppObject* OMLPNCLFFMJ);
    // public System.Void JOGPGAPOBBK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FEA70
    void JOGPGAPOBBK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void OAMOHIMHKEK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FEB24
    void OAMOHIMHKEK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void BHBFEEJHKIH()
    // Offset: 0x12FEBD8
    void BHBFEEJHKIH();
    // public System.Void OFDMFGNMEOP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FF02C
    void OFDMFGNMEOP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void .ctor()
    // Offset: 0x12FF0E0
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RockGolemBossStal* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::RockGolemBossStal::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RockGolemBossStal*, creationType>()));
    }
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FF138
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x12FF1EC
    void FGIFGGNGKPK();
    // private System.Void GKIOLADOCOK()
    // Offset: 0x12FF25C
    void GKIOLADOCOK();
    // private System.Void MFBFFBOCFOB(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FF2CC
    void MFBFFBOCFOB(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void NNBODOLEAFK()
    // Offset: 0x12FF38C
    void NNBODOLEAFK();
    // private System.Void HABDJCEKMNH()
    // Offset: 0x12FF7E4
    void HABDJCEKMNH();
    // private System.Void NCEAHDIMALO(System.Object OMLPNCLFFMJ)
    // Offset: 0x12FFC3C
    void NCEAHDIMALO(::Il2CppObject* OMLPNCLFFMJ);
    // private System.Void OACMGPBCPEL()
    // Offset: 0x12FFCFC
    void OACMGPBCPEL();
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x12FFD6C
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
  }; // MagicalActual.RockGolemBossStal
  #pragma pack(pop)
  static check_size<sizeof(RockGolemBossStal), 72 + sizeof(::MagicalActual::NetEntity*)> __MagicalActual_RockGolemBossStalSizeCheck;
  static_assert(sizeof(RockGolemBossStal) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::RockGolemBossStal::IKDGLCBOCJG
// Il2CppName: IKDGLCBOCJG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::RockGolemBossStal::*)(::MagicalActual::NetEntity*)>(&MagicalActual::RockGolemBossStal::IKDGLCBOCJG)> {
  static const MethodInfo* get() {
    static auto* CMLIHJCOINC = &::il2cpp_utils::GetClassFromName("MagicalActual", "NetEntity")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::RockGolemBossStal*), "IKDGLCBOCJG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{CMLIHJCOINC});
  }
};
// Writing MetadataGetter for method: MagicalActual::RockGolemBossStal::KHOMLKJBDGE
// Il2CppName: KHOMLKJBDGE
template<>
