// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObscuredBool
#include "CodeStage/AntiCheat/ObscuredTypes/ObscuredBool.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: OrbusNetManager
  class OrbusNetManager;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
// Forward declaring namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: VectorLine
  class VectorLine;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: PDollarGestureRecognizer
namespace PDollarGestureRecognizer {
  // Forward declaring type: Point
  class Point;
  // Forward declaring type: Gesture
  class Gesture;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Runemage
  class Runemage;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Runemage);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Runemage*, "MagicalActual", "Runemage");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x19C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Runemage
  // [TokenAttribute] Offset: FFFFFFFF
  class Runemage : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Runemage::wandState
    struct wandState;
    // Nested type: ::MagicalActual::Runemage::orbusNetMethodIdx
    struct orbusNetMethodIdx;
    // Nested type: ::MagicalActual::Runemage::orbusIncomingMethodIdx
    struct orbusIncomingMethodIdx;
    // Nested type: ::MagicalActual::Runemage::spellIdx
    struct spellIdx;
    // Nested type: ::MagicalActual::Runemage::$$c__DisplayClass74_0
    class $$c__DisplayClass74_0;
    // Nested type: ::MagicalActual::Runemage::$$c__DisplayClass88_0
    class $$c__DisplayClass88_0;
    // Nested type: ::MagicalActual::Runemage::$$c__DisplayClass89_0
    class $$c__DisplayClass89_0;
    // Nested type: ::MagicalActual::Runemage::$$c
    class $$c;
    // Nested type: ::MagicalActual::Runemage::$$c__DisplayClass102_0
    class $$c__DisplayClass102_0;
    // Nested type: ::MagicalActual::Runemage::$$c__DisplayClass102_1
    class $$c__DisplayClass102_1;
    // Nested type: ::MagicalActual::Runemage::$$c__DisplayClass117_0
    class $$c__DisplayClass117_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.Runemage/wandState
    // [TokenAttribute] Offset: FFFFFFFF
    struct wandState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: wandState
      constexpr wandState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.Runemage/wandState FNCIFCNLJBM
      static constexpr const int FNCIFCNLJBM = 0;
      // Get static field: static public MagicalActual.Runemage/wandState FNCIFCNLJBM
      static ::MagicalActual::Runemage::wandState _get_FNCIFCNLJBM();
      // Set static field: static public MagicalActual.Runemage/wandState FNCIFCNLJBM
      static void _set_FNCIFCNLJBM(::MagicalActual::Runemage::wandState value);
      // static field const value: static public MagicalActual.Runemage/wandState GMDPCEBCCOP
      static constexpr const int GMDPCEBCCOP = 1;
      // Get static field: static public MagicalActual.Runemage/wandState GMDPCEBCCOP
      static ::MagicalActual::Runemage::wandState _get_GMDPCEBCCOP();
      // Set static field: static public MagicalActual.Runemage/wandState GMDPCEBCCOP
      static void _set_GMDPCEBCCOP(::MagicalActual::Runemage::wandState value);
      // static field const value: static public MagicalActual.Runemage/wandState HHFOPNCDBAN
      static constexpr const int HHFOPNCDBAN = 2;
      // Get static field: static public MagicalActual.Runemage/wandState HHFOPNCDBAN
      static ::MagicalActual::Runemage::wandState _get_HHFOPNCDBAN();
      // Set static field: static public MagicalActual.Runemage/wandState HHFOPNCDBAN
      static void _set_HHFOPNCDBAN(::MagicalActual::Runemage::wandState value);
      // static field const value: static public MagicalActual.Runemage/wandState GDDPMGGPLPF
      static constexpr const int GDDPMGGPLPF = 4;
      // Get static field: static public MagicalActual.Runemage/wandState GDDPMGGPLPF
      static ::MagicalActual::Runemage::wandState _get_GDDPMGGPLPF();
      // Set static field: static public MagicalActual.Runemage/wandState GDDPMGGPLPF
      static void _set_GDDPMGGPLPF(::MagicalActual::Runemage::wandState value);
      // static field const value: static public MagicalActual.Runemage/wandState OHHMFBOMPEK
      static constexpr const int OHHMFBOMPEK = 8;
      // Get static field: static public MagicalActual.Runemage/wandState OHHMFBOMPEK
      static ::MagicalActual::Runemage::wandState _get_OHHMFBOMPEK();
      // Set static field: static public MagicalActual.Runemage/wandState OHHMFBOMPEK
      static void _set_OHHMFBOMPEK(::MagicalActual::Runemage::wandState value);
      // static field const value: static public MagicalActual.Runemage/wandState PMIOAMHGOPB
      static constexpr const int PMIOAMHGOPB = 16;
      // Get static field: static public MagicalActual.Runemage/wandState PMIOAMHGOPB
      static ::MagicalActual::Runemage::wandState _get_PMIOAMHGOPB();
      // Set static field: static public MagicalActual.Runemage/wandState PMIOAMHGOPB
      static void _set_PMIOAMHGOPB(::MagicalActual::Runemage::wandState value);
      // static field const value: static public MagicalActual.Runemage/wandState NMOKNPGCLEA
      static constexpr const int NMOKNPGCLEA = 32;
      // Get static field: static public MagicalActual.Runemage/wandState NMOKNPGCLEA
      static ::MagicalActual::Runemage::wandState _get_NMOKNPGCLEA();
      // Set static field: static public MagicalActual.Runemage/wandState NMOKNPGCLEA
      static void _set_NMOKNPGCLEA(::MagicalActual::Runemage::wandState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.Runemage/wandState
    #pragma pack(pop)
    static check_size<sizeof(Runemage::wandState), 0 + sizeof(int)> __MagicalActual_Runemage_wandStateSizeCheck;
    static_assert(sizeof(Runemage::wandState) == 0x4);
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.OrbusNetManager KPMLFHPFLBL
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::OrbusNetManager* KPMLFHPFLBL;
    // Field size check
    static_assert(sizeof(::MagicalActual::OrbusNetManager*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x30
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x31
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HIKIBDCNDAA and: ODFJDNJPMKL
    char __padding4[0x6] = {};
    // private Vectrosity.VectorLine[] ODFJDNJPMKL
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::Vectrosity::VectorLine*> ODFJDNJPMKL;
    // Field size check
    static_assert(sizeof(::ArrayW<::Vectrosity::VectorLine*>) == 0x8);
    // private System.Collections.Generic.List`1<PDollarGestureRecognizer.Point> JJOMPINMIBH
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Point*>* JJOMPINMIBH;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Point*>*) == 0x8);
    // private System.Collections.Generic.List`1<PDollarGestureRecognizer.Gesture> JCJMLNLHAMO
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Gesture*>* JCJMLNLHAMO;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::PDollarGestureRecognizer::Gesture*>*) == 0x8);
    // private System.Int32 GBAINJLBOIK
    // Size: 0x4
    // Offset: 0x50
    int GBAINJLBOIK;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single FNLBLHGMMBL
    // Size: 0x4
    // Offset: 0x54
    float FNLBLHGMMBL;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IEECKABMODP
    // Size: 0x4
    // Offset: 0x58
    float IEECKABMODP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean LMKBPNONGCC
    // Size: 0x1
    // Offset: 0x5C
    bool LMKBPNONGCC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: LMKBPNONGCC and: emptyGO
    char __padding11[0x3] = {};
    // public UnityEngine.GameObject emptyGO
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* emptyGO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject wand
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* wand;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject mageSpark
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* mageSpark;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject duplicationPoint1
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* duplicationPoint1;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject duplicationPoint2
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* duplicationPoint2;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE42C8
    // private UnityEngine.GameObject <IDDLMJEGBDN>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* IDDLMJEGBDN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject ICGNDALJKGL
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* ICGNDALJKGL;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Color spellLineColor
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Color spellLineColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.GameObject vfxSupercast
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* vfxSupercast;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxFizzle
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* vfxFizzle;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.ParticleSystem IKGEFIIFEAK
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::ParticleSystem* IKGEFIIFEAK;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private System.Boolean MELGNEMADBG
    // Size: 0x1
    // Offset: 0xC8
    bool MELGNEMADBG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GKGDNIONPEN
    // Size: 0x1
    // Offset: 0xC9
    bool GKGDNIONPEN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GKGDNIONPEN and: PEAKPGDDEJN
    char __padding25[0x2] = {};
    // private MagicalActual.Runemage/wandState PEAKPGDDEJN
    // Size: 0x4
    // Offset: 0xCC
    ::MagicalActual::Runemage::wandState PEAKPGDDEJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::Runemage::wandState) == 0x4);
    // private System.Int32 HOCHEMNFAIA
    // Size: 0x4
    // Offset: 0xD0
    int HOCHEMNFAIA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 BGJIKHDAJAO
    // Size: 0x4
    // Offset: 0xD4
    int BGJIKHDAJAO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 DIFLAOFCDAG
    // Size: 0x4
    // Offset: 0xD8
    int DIFLAOFCDAG;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean JJNCILANNED
    // Size: 0x1
    // Offset: 0xDC
    bool JJNCILANNED;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JJNCILANNED and: recordingSessionName
    char __padding30[0x3] = {};
    // public System.String recordingSessionName
    // Size: 0x8
    // Offset: 0xE0
    ::StringW recordingSessionName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0xE8
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0xF0
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE42D8
    // private MagicalActual.PlayerAvatar <PEKPJNGCADH>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::MagicalActual::PlayerAvatar* PEKPJNGCADH;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0x110
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0x111
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GHBBMIFHKGO and: forceKillPersistentSpell
    char __padding38[0x2] = {};
    // public CodeStage.AntiCheat.ObscuredTypes.ObscuredBool forceKillPersistentSpell
    // Size: 0xB
    // Offset: 0x114
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool forceKillPersistentSpell;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool) == 0xB);
    // Padding between fields: forceKillPersistentSpell and: persistentSpellAlreadyActive
    char __padding39[0x1] = {};
    // public CodeStage.AntiCheat.ObscuredTypes.ObscuredBool persistentSpellAlreadyActive
    // Size: 0xB
    // Offset: 0x120
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool persistentSpellAlreadyActive;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool) == 0xB);
    // Padding between fields: persistentSpellAlreadyActive and: spellVfxPreparing
    char __padding40[0x5] = {};
    // public UnityEngine.GameObject[] spellVfxPreparing
    // Size: 0x8
    // Offset: 0x130
    ::ArrayW<::UnityEngine::GameObject*> spellVfxPreparing;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] spellVfxRays
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<::UnityEngine::GameObject*> spellVfxRays;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject vfxCastSpark
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::GameObject* vfxCastSpark;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 PCNGMJFOMNJ
    // Size: 0x4
    // Offset: 0x148
    int PCNGMJFOMNJ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: PCNGMJFOMNJ and: EMPAGHKLJEK
    char __padding44[0x4] = {};
    // private UnityEngine.GameObject EMPAGHKLJEK
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::GameObject* EMPAGHKLJEK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject JOFBIKNNINM
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::GameObject* JOFBIKNNINM;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject DDDMBPHGFMG
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::GameObject* DDDMBPHGFMG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject CCJJKKAGECJ
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::GameObject* CCJJKKAGECJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single OKCNACNHNKJ
    // Size: 0x4
    // Offset: 0x170
    float OKCNACNHNKJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single LHMEIBFFNMK
    // Size: 0x4
    // Offset: 0x174
    float LHMEIBFFNMK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 JHOJNPHBIGJ
    // Size: 0x4
    // Offset: 0x178
    int JHOJNPHBIGJ;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single EKLFFHLHKEA
    // Size: 0x4
    // Offset: 0x17C
    float EKLFFHLHKEA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single FEFADFECKJM
    // Size: 0x4
    // Offset: 0x180
    float FEFADFECKJM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single GFGLHKABFII
    // Size: 0x4
    // Offset: 0x184
    float GFGLHKABFII;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Byte LDPHPLHJMIC
    // Size: 0x1
    // Offset: 0x188
    uint8_t LDPHPLHJMIC;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean NMCNFODEAIC
    // Size: 0x1
    // Offset: 0x189
    bool NMCNFODEAIC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte FFCBGJLHDBF
    // Size: 0x1
    // Offset: 0x18A
    uint8_t FFCBGJLHDBF;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte LKMMPOGJEMI
    // Size: 0x1
    // Offset: 0x18B
    uint8_t LKMMPOGJEMI;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean FPBDCAGBGCH
    // Size: 0x1
    // Offset: 0x18C
    bool FPBDCAGBGCH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean FDEKHJIDAEP
    // Size: 0x1
    // Offset: 0x18D
    bool FDEKHJIDAEP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: FDEKHJIDAEP and: HJPHJACOKID
    char __padding60[0x2] = {};
    // private UnityEngine.Vector3 HJPHJACOKID
    // Size: 0xC
    // Offset: 0x190
    ::UnityEngine::Vector3 HJPHJACOKID;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.OrbusNetManager KPMLFHPFLBL
