// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPooling
#include "GlobalNamespace/IPooling.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Runemage
  class Runemage;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: RunemageMissile
  class RunemageMissile;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::RunemageMissile);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::RunemageMissile*, "MagicalActual", "RunemageMissile");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.RunemageMissile
  // [TokenAttribute] Offset: FFFFFFFF
  class RunemageMissile : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPooling*/ {
    public:
    public:
    // public UnityEngine.GameObject[] vfx
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::GameObject*> vfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] collideVfx
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::GameObject*> collideVfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.GameObject[] OOOFKPLJEIL
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::GameObject*> OOOFKPLJEIL;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public MagicalActual.Runemage myMage
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::Runemage* myMage;
    // Field size check
    static_assert(sizeof(::MagicalActual::Runemage*) == 0x8);
    // public CodeStage.AntiCheat.ObscuredTypes.ObFlt speed
    // Size: 0x19
    // Offset: 0x40
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt speed;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: speed and: KNPCNCAKAIO
    char __padding5[0x7] = {};
    // private System.Single KNPCNCAKAIO
    // Size: 0x4
    // Offset: 0x60
    float KNPCNCAKAIO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: KNPCNCAKAIO and: arrowMaxTime
    char __padding6[0x4] = {};
    // public CodeStage.AntiCheat.ObscuredTypes.ObFlt arrowMaxTime
    // Size: 0x19
    // Offset: 0x68
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt arrowMaxTime;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: arrowMaxTime and: fired
    char __padding7[0x7] = {};
    // public System.Boolean fired
    // Size: 0x1
    // Offset: 0x88
    bool fired;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fired and: arrowId
    char __padding8[0x3] = {};
    // public System.Int32 arrowId
    // Size: 0x4
    // Offset: 0x8C
    int arrowId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.GameObject> LIHHDKMPDLK
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* LIHHDKMPDLK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public System.Boolean onWand
    // Size: 0x1
    // Offset: 0xA0
    bool onWand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MCIBDIEGOAG
    // Size: 0x1
    // Offset: 0xA1
    bool MCIBDIEGOAG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: MCIBDIEGOAG and: spellId
    char __padding13[0x2] = {};
    // public System.Int32 spellId
    // Size: 0x4
    // Offset: 0xA4
    int spellId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPooling
    operator ::GlobalNamespace::IPooling() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPooling*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject[] vfx
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_vfx();
    // Get instance field reference: public UnityEngine.GameObject[] collideVfx
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_collideVfx();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
