// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObscuredBool
#include "CodeStage/AntiCheat/ObscuredTypes/ObscuredBool.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: ShamanMissile
  class ShamanMissile;
  // Forward declaring type: PhysicsObject
  class PhysicsObject;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Shaman
  class Shaman;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ShamanSpawnedTotem
  class ShamanSpawnedTotem;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ShamanSpawnedTotem);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ShamanSpawnedTotem*, "MagicalActual", "ShamanSpawnedTotem");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xE1
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ShamanSpawnedTotem
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD3F70
  class ShamanSpawnedTotem : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::ShamanSpawnedTotem::SetThrowDelegate
    class SetThrowDelegate;
    // Nested type: ::MagicalActual::ShamanSpawnedTotem::$$c__DisplayClass41_0
    class $$c__DisplayClass41_0;
    // Nested type: ::MagicalActual::ShamanSpawnedTotem::$$c
    class $$c;
    // Nested type: ::MagicalActual::ShamanSpawnedTotem::$$c__DisplayClass43_0
    class $$c__DisplayClass43_0;
    // Nested type: ::MagicalActual::ShamanSpawnedTotem::$$c__DisplayClass44_0
    class $$c__DisplayClass44_0;
    // Nested type: ::MagicalActual::ShamanSpawnedTotem::$$c__DisplayClass50_0
    class $$c__DisplayClass50_0;
    public:
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // public UnityEngine.GameObject vfxSlash
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* vfxSlash;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject[] throwMissiles
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::UnityEngine::GameObject*> throwMissiles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] pulseVfx
    // Size: 0x8
    // Offset: 0x30
    ::ArrayW<::UnityEngine::GameObject*> pulseVfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] explosionVfx
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::UnityEngine::GameObject*> explosionVfx;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x40
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean locallyControlled
    // Size: 0x1
    // Offset: 0x48
    bool locallyControlled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: locallyControlled and: summonPoint
    char __padding6[0x3] = {};
    // public UnityEngine.Vector3 summonPoint
    // Size: 0xC
    // Offset: 0x4C
    ::UnityEngine::Vector3 summonPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAE4388
    // private MagicalActual.PlayerAvatar <PEKPJNGCADH>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::PlayerAvatar* PEKPJNGCADH;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // public MagicalActual.ShamanMissile availableMissile
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::ShamanMissile* availableMissile;
    // Field size check
    static_assert(sizeof(::MagicalActual::ShamanMissile*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.ShamanMissile> MMJHLPOAEPF
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::MagicalActual::ShamanMissile*>* MMJHLPOAEPF;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::ShamanMissile*>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.ShamanMissile> CFNFGMKAPAI
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::MagicalActual::ShamanMissile*>* CFNFGMKAPAI;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::ShamanMissile*>*) == 0x8);
    // public MagicalActual.PhysicsObject objectController
    // Size: 0x8
    // Offset: 0x78
    ::MagicalActual::PhysicsObject* objectController;
    // Field size check
    static_assert(sizeof(::MagicalActual::PhysicsObject*) == 0x8);
    // private MagicalActual.ShamanSpawnedTotem/SetThrowDelegate AMEGIAFKCFI
    // Size: 0x8
    // Offset: 0x80
    ::MagicalActual::ShamanSpawnedTotem::SetThrowDelegate* AMEGIAFKCFI;
    // Field size check
    static_assert(sizeof(::MagicalActual::ShamanSpawnedTotem::SetThrowDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4398
    // private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    // Size: 0x8
    // Offset: 0x88
    ::MagicalActual::NetEntity* JANFCAJMFMP;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Byte HGIGDEMGOOD
    // Size: 0x1
    // Offset: 0x90
    uint8_t HGIGDEMGOOD;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: HGIGDEMGOOD and: PONBFMMLOCB
    char __padding15[0x3] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObscuredBool PONBFMMLOCB
    // Size: 0xB
    // Offset: 0x94
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool PONBFMMLOCB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredBool) == 0xB);
    // Padding between fields: PONBFMMLOCB and: OGOBGFNDNNE
    char __padding16[0x1] = {};
    // private System.UInt16 OGOBGFNDNNE
    // Size: 0x2
    // Offset: 0xA0
    uint16_t OGOBGFNDNNE;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // public System.Boolean hasTalent31
    // Size: 0x1
    // Offset: 0xA2
    bool hasTalent31;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hasTalent52
    // Size: 0x1
    // Offset: 0xA3
    bool hasTalent52;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PGKGNELPAPJ
    // Size: 0x1
    // Offset: 0xA4
    bool PGKGNELPAPJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PGKGNELPAPJ and: JBKMOLJDEOP
    char __padding20[0x3] = {};
    // private System.Int32 JBKMOLJDEOP
    // Size: 0x4
    // Offset: 0xA8
    int JBKMOLJDEOP;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: JBKMOLJDEOP and: HLDIFNMGPIO
    char __padding21[0x4] = {};
    // private MagicalActual.Shaman HLDIFNMGPIO
    // Size: 0x8
    // Offset: 0xB0
    ::MagicalActual::Shaman* HLDIFNMGPIO;
    // Field size check
    static_assert(sizeof(::MagicalActual::Shaman*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE43A8
    // private MagicalActual.Grabber <JCFKEGHKMFK>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::MagicalActual::Grabber* JCFKEGHKMFK;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt PMOGEBGBCKI
    // Size: 0x19
    // Offset: 0xC0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt PMOGEBGBCKI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: PMOGEBGBCKI and: KNAPCJAANID
    char __padding24[0x7] = {};
    // private System.Boolean KNAPCJAANID
    // Size: 0x1
    // Offset: 0xE0
    bool KNAPCJAANID;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: public UnityEngine.GameObject vfxSlash
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_vfxSlash();
    // Get instance field reference: public UnityEngine.GameObject[] throwMissiles
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_throwMissiles();
    // Get instance field reference: public UnityEngine.GameObject[] pulseVfx
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::GameObject*>& dyn_pulseVfx();
