// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: ShamanSpawnedTotem
  class ShamanSpawnedTotem;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItem
  class InventoryItem;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Shaman
  class Shaman;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Shaman);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Shaman*, "MagicalActual", "Shaman");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xEF
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Shaman
  // [TokenAttribute] Offset: FFFFFFFF
  class Shaman : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Shaman::arrowSpellIdx
    struct arrowSpellIdx;
    // Nested type: ::MagicalActual::Shaman::$$c
    class $$c;
    // Nested type: ::MagicalActual::Shaman::$$c__DisplayClass62_0
    class $$c__DisplayClass62_0;
    // Nested type: ::MagicalActual::Shaman::$$c__DisplayClass71_0
    class $$c__DisplayClass71_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x28
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: FNINBDEICCD
    char __padding2[0x7] = {};
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // private UnityEngine.GameObject JJDMDLCCPDD
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* JJDMDLCCPDD;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 KHIKJLICKKF
    // Size: 0x4
    // Offset: 0x60
    int KHIKJLICKKF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 FJPBNPLIKHA
    // Size: 0x4
    // Offset: 0x64
    int FJPBNPLIKHA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.GameObject PPJCBODBHOH
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* PPJCBODBHOH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject superVfx
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* superVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0x78
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0x79
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x7A
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0x7B
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Single AMKEKINLGLH
    // Size: 0x4
    // Offset: 0x7C
    float AMKEKINLGLH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PJNDMIEHENA
    // Size: 0x4
    // Offset: 0x80
    float PJNDMIEHENA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PLLELMKFNDD
    // Size: 0x4
    // Offset: 0x84
    float PLLELMKFNDD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.GameObject totemHolder
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::GameObject* totemHolder;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject mask
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* mask;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject[] LJKGLEOPOFK
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::GameObject*> LJKGLEOPOFK;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public System.Collections.Generic.List`1<MagicalActual.ShamanSpawnedTotem> activeTotems
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::MagicalActual::ShamanSpawnedTotem*>* activeTotems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::ShamanSpawnedTotem*>*) == 0x8);
    // private System.Boolean DLIKANCFGGN
    // Size: 0x1
    // Offset: 0xA8
    bool DLIKANCFGGN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DLIKANCFGGN and: KEPIOBADOOK
    char __padding24[0x3] = {};
    // private System.Single KEPIOBADOOK
    // Size: 0x4
    // Offset: 0xAC
    float KEPIOBADOOK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single IAHDAENGLNH
    // Size: 0x4
    // Offset: 0xB0
    float IAHDAENGLNH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: IAHDAENGLNH and: EPPIPLHANGD
    char __padding26[0x4] = {};
    // private UnityEngine.RaycastHit[] EPPIPLHANGD
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<::UnityEngine::RaycastHit> EPPIPLHANGD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Transform ADKPNHFAGFF
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Transform* ADKPNHFAGFF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.GameObject EEJLAGDKGFM
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* EEJLAGDKGFM;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean GFENBLHLBHH
    // Size: 0x1
    // Offset: 0xD0
    bool GFENBLHLBHH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean EEEGNIBDONP
    // Size: 0x1
    // Offset: 0xD1
    bool EEEGNIBDONP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EEEGNIBDONP and: BKKAHCFNGPH
    char __padding31[0x6] = {};
    // private MagicalActual.ShamanSpawnedTotem BKKAHCFNGPH
    // Size: 0x8
    // Offset: 0xD8
    ::MagicalActual::ShamanSpawnedTotem* BKKAHCFNGPH;
    // Field size check
    static_assert(sizeof(::MagicalActual::ShamanSpawnedTotem*) == 0x8);
    // private MagicalActual.ShamanSpawnedTotem JMJOHLPMIIM
    // Size: 0x8
    // Offset: 0xE0
    ::MagicalActual::ShamanSpawnedTotem* JMJOHLPMIIM;
    // Field size check
    static_assert(sizeof(::MagicalActual::ShamanSpawnedTotem*) == 0x8);
    // private System.Byte AMEHAHENPCD
    // Size: 0x1
    // Offset: 0xE8
    uint8_t AMEHAHENPCD;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte OPOBPKDLAHC
    // Size: 0x1
    // Offset: 0xE9
    uint8_t OPOBPKDLAHC;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte OFLDKIABLBN
    // Size: 0x1
    // Offset: 0xEA
    uint8_t OFLDKIABLBN;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte LONFMBGCIHF
    // Size: 0x1
    // Offset: 0xEB
    uint8_t LONFMBGCIHF;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean KICABPFBLIK
    // Size: 0x1
    // Offset: 0xEC
    bool KICABPFBLIK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean DNMDJDFOIJM
    // Size: 0x1
    // Offset: 0xED
    bool DNMDJDFOIJM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MJBFFAKNMCM
    // Size: 0x1
    // Offset: 0xEE
    bool MJBFFAKNMCM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private System.Boolean HNFCLAFDJBD
    [[deprecated("Use field access instead!")]] bool& dyn_HNFCLAFDJBD();
