// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Rigidbody
  class Rigidbody;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ShamanSpawnedTotem
  class ShamanSpawnedTotem;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ShamanMissile
  class ShamanMissile;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ShamanMissile);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ShamanMissile*, "MagicalActual", "ShamanMissile");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ShamanMissile
  // [TokenAttribute] Offset: FFFFFFFF
  class ShamanMissile : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // public System.Boolean isThrown
    // Size: 0x1
    // Offset: 0x20
    bool isThrown;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isSummoning
    // Size: 0x1
    // Offset: 0x21
    bool isSummoning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSummoning and: myTotem
    char __padding2[0x6] = {};
    // public MagicalActual.ShamanSpawnedTotem myTotem
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::ShamanSpawnedTotem* myTotem;
    // Field size check
    static_assert(sizeof(::MagicalActual::ShamanSpawnedTotem*) == 0x8);
    // public UnityEngine.Rigidbody myRigidbody
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Rigidbody* myRigidbody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // public UnityEngine.Vector3 summonVelocity
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 summonVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: summonVelocity and: myPhysicsInteractable
    char __padding5[0x4] = {};
    // public PhysicsInteractable myPhysicsInteractable
    // Size: 0x8
    // Offset: 0x48
    ::GlobalNamespace::PhysicsInteractable* myPhysicsInteractable;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // public System.Boolean checkedTalent31
    // Size: 0x1
    // Offset: 0x50
    bool checkedTalent31;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: checkedTalent31 and: FCDNLCMGDPC
    char __padding7[0x3] = {};
    // private System.Single FCDNLCMGDPC
    // Size: 0x4
    // Offset: 0x54
    float FCDNLCMGDPC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Collider[] JGOGJDHABHN
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Collider*>& dyn_JGOGJDHABHN();
    // Get instance field reference: public System.Boolean isThrown
    [[deprecated("Use field access instead!")]] bool& dyn_isThrown();
    // Get instance field reference: public System.Boolean isSummoning
    [[deprecated("Use field access instead!")]] bool& dyn_isSummoning();
    // Get instance field reference: public MagicalActual.ShamanSpawnedTotem myTotem
    [[deprecated("Use field access instead!")]] ::MagicalActual::ShamanSpawnedTotem*& dyn_myTotem();
    // Get instance field reference: public UnityEngine.Rigidbody myRigidbody
