// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: ParticleSystem
  class ParticleSystem;
  // Forward declaring type: AudioSource
  class AudioSource;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
  // Forward declaring type: Grabber
  class Grabber;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Shrinker
  class Shrinker;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Shrinker);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Shrinker*, "MagicalActual", "Shrinker");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x4D
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Shrinker
  // [TokenAttribute] Offset: FFFFFFFF
  class Shrinker : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.ParticleSystem boltsEffect
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::ParticleSystem* boltsEffect;
    // Field size check
    static_assert(sizeof(::UnityEngine::ParticleSystem*) == 0x8);
    // private UnityEngine.AudioSource boltsSound
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::AudioSource* boltsSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource goodScan
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::AudioSource* goodScan;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource badScan
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::AudioSource* badScan;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private MagicalActual.PlayerTool FKJHGIFOJKD
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::PlayerTool* FKJHGIFOJKD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    // private System.Single LNFJGOLBGBB
    // Size: 0x4
    // Offset: 0x40
    float LNFJGOLBGBB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single CHLBNKPLICD
    // Size: 0x4
    // Offset: 0x44
    float CHLBNKPLICD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single MKLMFNHLEHA
    // Size: 0x4
    // Offset: 0x48
    float MKLMFNHLEHA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean ILGPCBIMPEN
    // Size: 0x1
    // Offset: 0x4C
    bool ILGPCBIMPEN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.ParticleSystem boltsEffect
    [[deprecated("Use field access instead!")]] ::UnityEngine::ParticleSystem*& dyn_boltsEffect();
    // Get instance field reference: private UnityEngine.AudioSource boltsSound
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_boltsSound();
    // Get instance field reference: private UnityEngine.AudioSource goodScan
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_goodScan();
    // Get instance field reference: private UnityEngine.AudioSource badScan
    [[deprecated("Use field access instead!")]] ::UnityEngine::AudioSource*& dyn_badScan();
