// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: SlowMovingProjectile
  class SlowMovingProjectile;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::SlowMovingProjectile);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::SlowMovingProjectile*, "MagicalActual", "SlowMovingProjectile");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x38
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.SlowMovingProjectile
  // [TokenAttribute] Offset: FFFFFFFF
  class SlowMovingProjectile : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private UnityEngine.GameObject PLPCLIEAJMC
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* PLPCLIEAJMC;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject MKFHKKKOEBG
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* MKFHKKKOEBG;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private UnityEngine.GameObject PLPCLIEAJMC
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_PLPCLIEAJMC();
    // Get instance field reference: private UnityEngine.GameObject MKFHKKKOEBG
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_MKFHKKKOEBG();
    // private System.Void HKINNMLBMMG()
    // Offset: 0x107CF28
    void HKINNMLBMMG();
    // private System.Void BOKIGFNOBPE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107D004
    void BOKIGFNOBPE(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void ABIHCGOKNCL()
    // Offset: 0x107D188
    void ABIHCGOKNCL();
    // private System.Void AHPDCIGFMJI()
    // Offset: 0x107D264
    void AHPDCIGFMJI();
    // private System.Void AOIAEMNLBND(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107D340
    void AOIAEMNLBND(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void KEGEKFNLCJD(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107D4C4
    void KEGEKFNLCJD(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KHOMLKJBDGE(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107D5C8
    void KHOMLKJBDGE(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x107D6CC
    void MLGBKBMHHLE();
    // private System.Void CBMDGNKFPIO()
    // Offset: 0x107D7A8
    void CBMDGNKFPIO();
    // public System.Void LCMLLJGPKEM(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107D884
    void LCMLLJGPKEM(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void .ctor()
    // Offset: 0x107D988
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static SlowMovingProjectile* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::SlowMovingProjectile::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<SlowMovingProjectile*, creationType>()));
    }
    // private System.Void EIIKFEMCNKM()
    // Offset: 0x107D9E0
    void EIIKFEMCNKM();
    // private System.Void JNHNEBOHOIB()
    // Offset: 0x107DABC
    void JNHNEBOHOIB();
    // public System.Void NEMKNLGDEAK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107DB98
    void NEMKNLGDEAK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void Start()
    // Offset: 0x107DC9C
    void Start();
    // private System.Void MMILPNOJDFM(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107DD78
    void MMILPNOJDFM(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void KMPPLBBIMGJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107DEF8
    void KMPPLBBIMGJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void NFJANCHLOLE(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107DFFC
    void NFJANCHLOLE(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107E180
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void GPFBGGFPINB()
    // Offset: 0x107E284
    void GPFBGGFPINB();
    // private System.Void PFABJJGAOMM()
    // Offset: 0x107E360
    void PFABJJGAOMM();
    // private System.Void KJHOHOJOFBO(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107E43C
    void KJHOHOJOFBO(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void GFHPFJHINBN(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107E5BC
    void GFHPFJHINBN(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void JENOIOBAEPG()
    // Offset: 0x107E740
    void JENOIOBAEPG();
    // private System.Void LPLGKBGLPOK()
    // Offset: 0x107E81C
    void LPLGKBGLPOK();
    // public System.Void AKAJICBGGIG(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107E8F8
    void AKAJICBGGIG(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void DFCOAPEIKLN()
    // Offset: 0x107E9FC
    void DFCOAPEIKLN();
    // private System.Void NOODBODJNMF(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107EAD8
    void NOODBODJNMF(::System::Collections::ArrayList* HPEANAHIBAH);
    // public System.Void HMKJKOKPOBP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107EC58
    void HMKJKOKPOBP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void KIDNJNOFOFF(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107ED5C
    void KIDNJNOFOFF(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void HKMAPCOKCFC(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107EE60
    void HKMAPCOKCFC(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x107EFE0
    void EPCHNEGNKNF();
    // private System.Void GECHLDPLPCC()
    // Offset: 0x107F0BC
    void GECHLDPLPCC();
    // private System.Void KDBJMJAPJEI(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107F198
    void KDBJMJAPJEI(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void EOAMFNGMGPO(System.Collections.ArrayList HPEANAHIBAH)
    // Offset: 0x107F318
    void EOAMFNGMGPO(::System::Collections::ArrayList* HPEANAHIBAH);
    // private System.Void AFIACGLCIPB()
    // Offset: 0x107F498
    void AFIACGLCIPB();
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x107F574
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
  }; // MagicalActual.SlowMovingProjectile
  #pragma pack(pop)
  static check_size<sizeof(SlowMovingProjectile), 48 + sizeof(::UnityEngine::GameObject*)> __MagicalActual_SlowMovingProjectileSizeCheck;
  static_assert(sizeof(SlowMovingProjectile) == 0x38);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::SlowMovingProjectile::HKINNMLBMMG
// Il2CppName: HKINNMLBMMG
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::SlowMovingProjectile::*)()>(&MagicalActual::SlowMovingProjectile::HKINNMLBMMG)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::SlowMovingProjectile*), "HKINNMLBMMG", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::SlowMovingProjectile::BOKIGFNOBPE
// Il2CppName: BOKIGFNOBPE
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::SlowMovingProjectile::*)(::System::Collections::ArrayList*)>(&MagicalActual::SlowMovingProjectile::BOKIGFNOBPE)> {
  static const MethodInfo* get() {
