// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Monster
  class Monster;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: SpiderBoss
  class SpiderBoss;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::SpiderBoss);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::SpiderBoss*, "MagicalActual", "SpiderBoss");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.SpiderBoss
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD7CF8
  class SpiderBoss : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.Monster BIIBEOELIHH
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::Monster* BIIBEOELIHH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private UnityEngine.Transform shield
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* shield;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform shieldAnchor
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* shieldAnchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Animator burrowController
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Animator* burrowController;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.Transform spider
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* spider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.GameObject leapHit
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* leapHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x50
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean EAIGIJFGLHK
    // Size: 0x1
    // Offset: 0x58
    bool EAIGIJFGLHK;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EAIGIJFGLHK and: KCOKPGCNCLA
    char __padding8[0x3] = {};
    // private UnityEngine.Vector3 KCOKPGCNCLA
    // Size: 0xC
    // Offset: 0x5C
    ::UnityEngine::Vector3 KCOKPGCNCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 HMDMGGFFOGD
    // Size: 0xC
    // Offset: 0x68
    ::UnityEngine::Vector3 HMDMGGFFOGD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single JLJLOCMFBKA
    // Size: 0x4
    // Offset: 0x74
    float JLJLOCMFBKA;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single ANPNFLJBCNI
    // Size: 0x4
    // Offset: 0x78
    float ANPNFLJBCNI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single shieldRotationSpeed
    // Size: 0x4
    // Offset: 0x7C
    float shieldRotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean JLCJAOHEOFA
    // Size: 0x1
    // Offset: 0x80
    bool JLCJAOHEOFA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: JLCJAOHEOFA and: EINNLBIEKGL
    char __padding14[0x3] = {};
    // private UnityEngine.Vector3 EINNLBIEKGL
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 EINNLBIEKGL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.NetEntity IJJGNKLFGJN
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_IJJGNKLFGJN();
    // Get instance field reference: private MagicalActual.Monster BIIBEOELIHH
    [[deprecated("Use field access instead!")]] ::MagicalActual::Monster*& dyn_BIIBEOELIHH();
    // Get instance field reference: private UnityEngine.Transform shield
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_shield();
    // Get instance field reference: private UnityEngine.Transform shieldAnchor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_shieldAnchor();
