// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: StatusEffectParams
  class StatusEffectParams;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::StatusEffectParams);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::StatusEffectParams*, "MagicalActual", "StatusEffectParams");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x24
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.StatusEffectParams
  // [TokenAttribute] Offset: FFFFFFFF
  class StatusEffectParams : public ::Il2CppObject {
    public:
    public:
    // public System.String KBJBBFMPJNN
    // Size: 0x8
    // Offset: 0x10
    ::StringW KBJBBFMPJNN;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single HOMHLNJOGHK
    // Size: 0x4
    // Offset: 0x18
    float HOMHLNJOGHK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single MGAGNJMBEDP
    // Size: 0x4
    // Offset: 0x1C
    float MGAGNJMBEDP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single LGBPNOJNJHI
    // Size: 0x4
    // Offset: 0x20
    float LGBPNOJNJHI;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public System.String KBJBBFMPJNN
    [[deprecated("Use field access instead!")]] ::StringW& dyn_KBJBBFMPJNN();
    // Get instance field reference: public System.Single HOMHLNJOGHK
    [[deprecated("Use field access instead!")]] float& dyn_HOMHLNJOGHK();
    // Get instance field reference: public System.Single MGAGNJMBEDP
    [[deprecated("Use field access instead!")]] float& dyn_MGAGNJMBEDP();
    // Get instance field reference: public System.Single LGBPNOJNJHI
    [[deprecated("Use field access instead!")]] float& dyn_LGBPNOJNJHI();
    // public System.Void .ctor(System.String FPMDFOGBJEJ, System.Single GOMPKIKDCDD, System.Single AFKDOJFIBDL, System.Single FOKAHGDMFCL)
    // Offset: 0x167FE4C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static StatusEffectParams* New_ctor(::StringW FPMDFOGBJEJ, float GOMPKIKDCDD, float AFKDOJFIBDL, float FOKAHGDMFCL) {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::StatusEffectParams::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<StatusEffectParams*, creationType>(FPMDFOGBJEJ, GOMPKIKDCDD, AFKDOJFIBDL, FOKAHGDMFCL)));
    }
  }; // MagicalActual.StatusEffectParams
  #pragma pack(pop)
  static check_size<sizeof(StatusEffectParams), 32 + sizeof(float)> __MagicalActual_StatusEffectParamsSizeCheck;
  static_assert(sizeof(StatusEffectParams) == 0x24);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::StatusEffectParams::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
