// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: IPlayerClass
#include "GlobalNamespace/IPlayerClass.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
// Including type: UnityEngine.Ray
#include "UnityEngine/Ray.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObFlt
#include "CodeStage/AntiCheat/ObscuredTypes/ObFlt.hpp"
// Including type: CodeStage.AntiCheat.ObscuredTypes.ObInt
#include "CodeStage/AntiCheat/ObscuredTypes/ObInt.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: PlayerClass
  class PlayerClass;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: AttackVfxController
  class AttackVfxController;
  // Forward declaring type: SwordHit
  class SwordHit;
  // Forward declaring type: ShieldHit
  class ShieldHit;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: TrailRenderer
  class TrailRenderer;
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Swordboard
  class Swordboard;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Swordboard);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Swordboard*, "MagicalActual", "Swordboard");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x590
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Swordboard
  // [TokenAttribute] Offset: FFFFFFFF
  class Swordboard : public ::UnityEngine::MonoBehaviour/*, public ::GlobalNamespace::IPlayerClass*/ {
    public:
    // Nested type: ::MagicalActual::Swordboard::$$c__DisplayClass151_0
    class $$c__DisplayClass151_0;
    // Nested type: ::MagicalActual::Swordboard::$$c__DisplayClass151_1
    class $$c__DisplayClass151_1;
    // Nested type: ::MagicalActual::Swordboard::$$c__DisplayClass151_2
    class $$c__DisplayClass151_2;
    // Nested type: ::MagicalActual::Swordboard::$$c__DisplayClass151_3
    class $$c__DisplayClass151_3;
    // Nested type: ::MagicalActual::Swordboard::$$c
    class $$c;
    // Nested type: ::MagicalActual::Swordboard::$$c__DisplayClass159_0
    class $$c__DisplayClass159_0;
    public:
    // private System.Single LEGNJPIEHKE
    // Size: 0x4
    // Offset: 0x18
    float LEGNJPIEHKE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single PMGMDMHOPMP
    // Size: 0x4
    // Offset: 0x1C
    float PMGMDMHOPMP;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 HFGIDHPFBLD
    // Size: 0x4
    // Offset: 0x20
    int HFGIDHPFBLD;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single HitBoxX
    // Size: 0x4
    // Offset: 0x24
    float HitBoxX;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single HitBoxY
    // Size: 0x4
    // Offset: 0x28
    float HitBoxY;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single HitBoxZ
    // Size: 0x4
    // Offset: 0x2C
    float HitBoxZ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x30
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private System.Boolean HNFCLAFDJBD
    // Size: 0x1
    // Offset: 0x40
    bool HNFCLAFDJBD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HNFCLAFDJBD and: FNINBDEICCD
    char __padding8[0x7] = {};
    // private MagicalActual.PlayerClass FNINBDEICCD
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::PlayerClass* FNINBDEICCD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerClass*) == 0x8);
    // private MagicalActual.PlayerAvatar EENJNFDNJBD
    // Size: 0x8
    // Offset: 0x50
    ::MagicalActual::PlayerAvatar* EENJNFDNJBD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private MagicalActual.PlayerCharacter HCFELEODBLD
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::PlayerCharacter* HCFELEODBLD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // public UnityEngine.GameObject shield
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* shield;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.BoxCollider IKKIMNOLKPP
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::BoxCollider* IKKIMNOLKPP;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // public UnityEngine.GameObject sword
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* sword;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject KAJIJDJAAKK
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* KAJIJDJAAKK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform JJDMDLCCPDD
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Transform* JJDMDLCCPDD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single focusDistance
    // Size: 0x4
    // Offset: 0x88
    float focusDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 HEFAPBNPAPK
    // Size: 0x4
    // Offset: 0x8C
    int HEFAPBNPAPK;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 HFKELBOMOCO
    // Size: 0x4
    // Offset: 0x90
    int HFKELBOMOCO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: HFKELBOMOCO and: JEJAAPDDFCH
    char __padding19[0x4] = {};
    // private UnityEngine.RaycastHit[] JEJAAPDDFCH
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<::UnityEngine::RaycastHit> JEJAAPDDFCH;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Ray CFJNLPEPFNH
    // Size: 0x18
    // Offset: 0xA0
    ::UnityEngine::Ray CFJNLPEPFNH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Ray) == 0x18);
    // private System.Boolean LHCGGEJOAMF
    // Size: 0x1
    // Offset: 0xB8
    bool LHCGGEJOAMF;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PDOGIKMODPI
    // Size: 0x1
    // Offset: 0xB9
    bool PDOGIKMODPI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean CILLHAJIDIB
    // Size: 0x1
    // Offset: 0xBA
    bool CILLHAJIDIB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: CILLHAJIDIB and: focusTarget
    char __padding24[0x5] = {};
    // public UnityEngine.GameObject focusTarget
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::GameObject* focusTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxHit
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* vfxHit;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject[] vfxBlood
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::GameObject*> vfxBlood;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject[] vfxSlash
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::UnityEngine::GameObject*> vfxSlash;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject vfxComboAggro
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::GameObject* vfxComboAggro;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxComboDamage
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* vfxComboDamage;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxComboHamstring
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::GameObject* vfxComboHamstring;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxComboCleave
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* vfxComboCleave;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxTaunt
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::GameObject* vfxTaunt;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxStun
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::GameObject* vfxStun;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxBlock
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::GameObject* vfxBlock;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject superVfx
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::GameObject* superVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject collisionBoxPrefab
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::GameObject* collisionBoxPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxHeman
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::GameObject* vfxHeman;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject vfxHemanReady
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::GameObject* vfxHemanReady;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject PPJCBODBHOH
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::GameObject* PPJCBODBHOH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject HDMKCGKJCLA
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::GameObject* HDMKCGKJCLA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.AttackVfxController[] ACNMJOJPLMB
    // Size: 0x8
    // Offset: 0x148
    ::ArrayW<::MagicalActual::AttackVfxController*> ACNMJOJPLMB;
    // Field size check
    static_assert(sizeof(::ArrayW<::MagicalActual::AttackVfxController*>) == 0x8);
    // private MagicalActual.AttackVfxController FLAMDFGHEJH
    // Size: 0x8
    // Offset: 0x150
    ::MagicalActual::AttackVfxController* FLAMDFGHEJH;
    // Field size check
    static_assert(sizeof(::MagicalActual::AttackVfxController*) == 0x8);
    // public UnityEngine.GameObject tauntHorn
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::GameObject* tauntHorn;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Material shieldEnabledMaterial
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Material* shieldEnabledMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material shieldDisabledMaterial
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Material* shieldDisabledMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private OrbusTrackedController IKCANGJCBED
    // Size: 0x8
    // Offset: 0x170
    ::GlobalNamespace::OrbusTrackedController* IKCANGJCBED;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private OrbusTrackedController HKFGNKJKLPH
    // Size: 0x8
    // Offset: 0x178
    ::GlobalNamespace::OrbusTrackedController* HKFGNKJKLPH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private UnityEngine.GameObject CCEMBLKGKLN
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::GameObject* CCEMBLKGKLN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject GKJEHAKEABK
    // Size: 0x8
    // Offset: 0x188
    ::UnityEngine::GameObject* GKJEHAKEABK;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject BGFIJNGFMFO
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::GameObject* BGFIJNGFMFO;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean GCCMBLOGLBA
    // Size: 0x1
    // Offset: 0x198
    bool GCCMBLOGLBA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GHBBMIFHKGO
    // Size: 0x1
    // Offset: 0x199
    bool GHBBMIFHKGO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HIKIBDCNDAA
    // Size: 0x1
    // Offset: 0x19A
    bool HIKIBDCNDAA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IMNDEEOEOKA
    // Size: 0x1
    // Offset: 0x19B
    bool IMNDEEOEOKA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Int32 KHIKJLICKKF
    // Size: 0x4
    // Offset: 0x19C
    int KHIKJLICKKF;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 FJPBNPLIKHA
    // Size: 0x4
    // Offset: 0x1A0
    int FJPBNPLIKHA;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: FJPBNPLIKHA and: DKBAJEHLDMP
    char __padding57[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt DKBAJEHLDMP
    // Size: 0x19
    // Offset: 0x1A8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt DKBAJEHLDMP;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: DKBAJEHLDMP and: OJHGBHCKPCB
    char __padding58[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt OJHGBHCKPCB
    // Size: 0x19
    // Offset: 0x1C8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt OJHGBHCKPCB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: OJHGBHCKPCB and: EKMNMNLFENN
    char __padding59[0x7] = {};
    // private System.Boolean EKMNMNLFENN
    // Size: 0x1
    // Offset: 0x1E8
    bool EKMNMNLFENN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: EKMNMNLFENN and: KBFBPJGLNMA
    char __padding60[0x7] = {};
    // private UnityEngine.GameObject KBFBPJGLNMA
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::GameObject* KBFBPJGLNMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single OKGLIFFGAGE
    // Size: 0x4
    // Offset: 0x1F8
    float OKGLIFFGAGE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 KCAHPJFPBAH
    // Size: 0xC
    // Offset: 0x1FC
    ::UnityEngine::Vector3 KCAHPJFPBAH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 GAEJBDLAPEK
    // Size: 0xC
    // Offset: 0x208
    ::UnityEngine::Vector3 GAEJBDLAPEK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 DGOMGJKIHLK
    // Size: 0xC
    // Offset: 0x214
    ::UnityEngine::Vector3 DGOMGJKIHLK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 AIKDIMABMDG
    // Size: 0xC
    // Offset: 0x220
    ::UnityEngine::Vector3 AIKDIMABMDG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 FAIGECBHGJK
    // Size: 0xC
    // Offset: 0x22C
    ::UnityEngine::Vector3 FAIGECBHGJK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 OPLJCKCEAOP
    // Size: 0xC
    // Offset: 0x238
    ::UnityEngine::Vector3 OPLJCKCEAOP;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 LABLJCLAGAH
    // Size: 0xC
    // Offset: 0x244
    ::UnityEngine::Vector3 LABLJCLAGAH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 IBKIPLACFPI
    // Size: 0xC
    // Offset: 0x250
    ::UnityEngine::Vector3 IBKIPLACFPI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 LAJKIBBOMMH
    // Size: 0xC
    // Offset: 0x25C
    ::UnityEngine::Vector3 LAJKIBBOMMH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 GKNJLGMHGCH
    // Size: 0xC
    // Offset: 0x268
    ::UnityEngine::Vector3 GKNJLGMHGCH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 OGPCFHFCNBK
    // Size: 0xC
    // Offset: 0x274
    ::UnityEngine::Vector3 OGPCFHFCNBK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 OJDNMNLHGAN
    // Size: 0xC
    // Offset: 0x280
    ::UnityEngine::Vector3 OJDNMNLHGAN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: OJDNMNLHGAN and: NDFMINDFCND
    char __padding74[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt NDFMINDFCND
    // Size: 0x19
    // Offset: 0x290
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt NDFMINDFCND;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: NDFMINDFCND and: IOGGBIPFCFC
    char __padding75[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt IOGGBIPFCFC
    // Size: 0x19
    // Offset: 0x2B0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt IOGGBIPFCFC;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: IOGGBIPFCFC and: ABMKILKCODB
    char __padding76[0x7] = {};
    // private System.Boolean ABMKILKCODB
    // Size: 0x1
    // Offset: 0x2D0
    bool ABMKILKCODB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ABMKILKCODB and: LCNIHHAOGOK
    char __padding77[0x7] = {};
    // private System.Collections.Generic.List`1<MagicalActual.SwordHit> LCNIHHAOGOK
    // Size: 0x8
    // Offset: 0x2D8
    ::System::Collections::Generic::List_1<::MagicalActual::SwordHit*>* LCNIHHAOGOK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::SwordHit*>*) == 0x8);
    // private System.Boolean NGOOKDNMCNG
    // Size: 0x1
    // Offset: 0x2E0
    bool NGOOKDNMCNG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: NGOOKDNMCNG and: KPMHJKHFAFG
    char __padding79[0x7] = {};
    // private System.Collections.Generic.List`1<MagicalActual.ShieldHit> KPMHJKHFAFG
    // Size: 0x8
    // Offset: 0x2E8
    ::System::Collections::Generic::List_1<::MagicalActual::ShieldHit*>* KPMHJKHFAFG;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::ShieldHit*>*) == 0x8);
    // private System.Int32 LJOIIEHFLPB
    // Size: 0x4
    // Offset: 0x2F0
    int LJOIIEHFLPB;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: LJOIIEHFLPB and: LNFJGOLBGBB
    char __padding81[0x4] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt LNFJGOLBGBB
    // Size: 0x19
    // Offset: 0x2F8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt LNFJGOLBGBB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: LNFJGOLBGBB and: FOHNMMBGCOL
    char __padding82[0x7] = {};
    // private System.Boolean FOHNMMBGCOL
    // Size: 0x1
    // Offset: 0x318
    bool FOHNMMBGCOL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GJGDPJMMHEC
    // Size: 0x1
    // Offset: 0x319
    bool GJGDPJMMHEC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GJGDPJMMHEC and: JGOFCLGJBAA
    char __padding84[0x6] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt JGOFCLGJBAA
    // Size: 0x19
    // Offset: 0x320
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt JGOFCLGJBAA;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: JGOFCLGJBAA and: MIAPIDLBHID
    char __padding85[0x7] = {};
    // private System.Byte MIAPIDLBHID
    // Size: 0x1
    // Offset: 0x340
    uint8_t MIAPIDLBHID;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean OMMPLPMLPAP
    // Size: 0x1
    // Offset: 0x341
    bool OMMPLPMLPAP;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: OMMPLPMLPAP and: trailRenderer
    char __padding87[0x6] = {};
    // private UnityEngine.TrailRenderer trailRenderer
    // Size: 0x8
    // Offset: 0x348
    ::UnityEngine::TrailRenderer* trailRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::TrailRenderer*) == 0x8);
    // private UnityEngine.Gradient damageColor
    // Size: 0x8
    // Offset: 0x350
    ::UnityEngine::Gradient* damageColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Gradient cleaveColor
    // Size: 0x8
    // Offset: 0x358
    ::UnityEngine::Gradient* cleaveColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Gradient provokeColor
    // Size: 0x8
    // Offset: 0x360
    ::UnityEngine::Gradient* provokeColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Gradient hamstringColor
    // Size: 0x8
    // Offset: 0x368
    ::UnityEngine::Gradient* hamstringColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Gradient IFPBJIALLDM
    // Size: 0x8
    // Offset: 0x370
    ::UnityEngine::Gradient* IFPBJIALLDM;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.AudioSource chargedSound
    // Size: 0x8
    // Offset: 0x378
    ::UnityEngine::AudioSource* chargedSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource chargingSound
    // Size: 0x8
    // Offset: 0x380
    ::UnityEngine::AudioSource* chargingSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt AOLJBMLMFMB
    // Size: 0x19
    // Offset: 0x388
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt AOLJBMLMFMB;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: AOLJBMLMFMB and: LNCEKCNBMFH
    char __padding96[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt LNCEKCNBMFH
    // Size: 0x19
    // Offset: 0x3A8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt LNCEKCNBMFH;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: LNCEKCNBMFH and: shieldPlantIcon
    char __padding97[0x7] = {};
    // public UnityEngine.UI.Image shieldPlantIcon
    // Size: 0x8
    // Offset: 0x3C8
    ::UnityEngine::UI::Image* shieldPlantIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt COODJJNCBFE
    // Size: 0x19
    // Offset: 0x3D0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt COODJJNCBFE;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: COODJJNCBFE and: HDLEEPKBAAA
    char __padding99[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt HDLEEPKBAAA
    // Size: 0x19
    // Offset: 0x3F0
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt HDLEEPKBAAA;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: HDLEEPKBAAA and: stunIcon
    char __padding100[0x7] = {};
    // public UnityEngine.UI.Image stunIcon
    // Size: 0x8
    // Offset: 0x410
    ::UnityEngine::UI::Image* stunIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt MNAFHEKDOEM
    // Size: 0x19
    // Offset: 0x418
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt MNAFHEKDOEM;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: MNAFHEKDOEM and: GJHPDBEPBKN
    char __padding102[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt GJHPDBEPBKN
    // Size: 0x19
    // Offset: 0x438
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt GJHPDBEPBKN;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: GJHPDBEPBKN and: NDFEKEDKBNK
    char __padding103[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObInt NDFEKEDKBNK
    // Size: 0x11
    // Offset: 0x458
    ::CodeStage::AntiCheat::ObscuredTypes::ObInt NDFEKEDKBNK;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObInt) == 0x11);
    // Padding between fields: NDFEKEDKBNK and: teleportIcon
    char __padding104[0x7] = {};
    // public UnityEngine.UI.Image teleportIcon
    // Size: 0x8
    // Offset: 0x470
    ::UnityEngine::UI::Image* teleportIcon;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image rush1On
    // Size: 0x8
    // Offset: 0x478
    ::UnityEngine::UI::Image* rush1On;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image rush1Off
    // Size: 0x8
    // Offset: 0x480
    ::UnityEngine::UI::Image* rush1Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image rush2On
    // Size: 0x8
    // Offset: 0x488
    ::UnityEngine::UI::Image* rush2On;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.UI.Image rush2Off
    // Size: 0x8
    // Offset: 0x490
    ::UnityEngine::UI::Image* rush2Off;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private UnityEngine.Vector3 HACCECAIEBG
    // Size: 0xC
    // Offset: 0x498
    ::UnityEngine::Vector3 HACCECAIEBG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean DLIKANCFGGN
    // Size: 0x1
    // Offset: 0x4A4
    bool DLIKANCFGGN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DLIKANCFGGN and: EPPIPLHANGD
    char __padding111[0x3] = {};
    // private UnityEngine.RaycastHit[] EPPIPLHANGD
    // Size: 0x8
    // Offset: 0x4A8
    ::ArrayW<::UnityEngine::RaycastHit> EPPIPLHANGD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.GameObject EEJLAGDKGFM
    // Size: 0x8
    // Offset: 0x4B0
    ::UnityEngine::GameObject* EEJLAGDKGFM;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> DLOHFFHLDGF
    // Size: 0x8
    // Offset: 0x4B8
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* DLOHFFHLDGF;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private UnityEngine.Collider[] NPJAMHKBLLM
    // Size: 0x8
    // Offset: 0x4C0
    ::ArrayW<::UnityEngine::Collider*> NPJAMHKBLLM;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt CEGIEONPEBG
    // Size: 0x19
    // Offset: 0x4C8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt CEGIEONPEBG;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: CEGIEONPEBG and: EBFEFPEEDDI
    char __padding116[0x7] = {};
    // private CodeStage.AntiCheat.ObscuredTypes.ObFlt EBFEFPEEDDI
    // Size: 0x19
    // Offset: 0x4E8
    ::CodeStage::AntiCheat::ObscuredTypes::ObFlt EBFEFPEEDDI;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObFlt) == 0x19);
    // Padding between fields: EBFEFPEEDDI and: GBHKPAEJMNN
    char __padding117[0x7] = {};
    // private System.Boolean GBHKPAEJMNN
    // Size: 0x1
    // Offset: 0x508
    bool GBHKPAEJMNN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean KCCOPEFIBBJ
    // Size: 0x1
    // Offset: 0x509
    bool KCCOPEFIBBJ;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KCCOPEFIBBJ and: BFCJHLPFNAM
    char __padding119[0x2] = {};
    // private System.Int32 BFCJHLPFNAM
    // Size: 0x4
    // Offset: 0x50C
    int BFCJHLPFNAM;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 GBPFNHBJEME
    // Size: 0x4
    // Offset: 0x510
    int GBPFNHBJEME;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean CHGIKGLFLJB
    // Size: 0x1
    // Offset: 0x514
    bool CHGIKGLFLJB;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean AHFDBJLDKCO
    // Size: 0x1
    // Offset: 0x515
    bool AHFDBJLDKCO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean IICBIEPKJII
    // Size: 0x1
    // Offset: 0x516
    bool IICBIEPKJII;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IICBIEPKJII and: JGOGJDHABHN
    char __padding124[0x1] = {};
    // private UnityEngine.Collider[] JGOGJDHABHN
    // Size: 0x8
    // Offset: 0x518
    ::ArrayW<::UnityEngine::Collider*> JGOGJDHABHN;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.Collider[] NLPMPHDHCHK
    // Size: 0x8
    // Offset: 0x520
    ::ArrayW<::UnityEngine::Collider*> NLPMPHDHCHK;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private UnityEngine.RaycastHit[] EHLLMIKFMJG
    // Size: 0x8
    // Offset: 0x528
    ::ArrayW<::UnityEngine::RaycastHit> EHLLMIKFMJG;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Transform AABJEILHKDE
    // Size: 0x8
    // Offset: 0x530
    ::UnityEngine::Transform* AABJEILHKDE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform ADKPNHFAGFF
    // Size: 0x8
    // Offset: 0x538
    ::UnityEngine::Transform* ADKPNHFAGFF;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform CNDOFMMMACK
    // Size: 0x8
    // Offset: 0x540
    ::UnityEngine::Transform* CNDOFMMMACK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform IFLDMGKNCEK
    // Size: 0x8
    // Offset: 0x548
    ::UnityEngine::Transform* IFLDMGKNCEK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform NJPCCEMDCNA
    // Size: 0x8
    // Offset: 0x550
    ::UnityEngine::Transform* NJPCCEMDCNA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform DMNHBEIHGMA
    // Size: 0x8
    // Offset: 0x558
    ::UnityEngine::Transform* DMNHBEIHGMA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Vector3 ICEMBFHMBPG
    // Size: 0xC
    // Offset: 0x560
    ::UnityEngine::Vector3 ICEMBFHMBPG;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 CNDANAGGNGA
    // Size: 0xC
    // Offset: 0x56C
    ::UnityEngine::Vector3 CNDANAGGNGA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 BNNHHDKILGL
    // Size: 0xC
    // Offset: 0x578
    ::UnityEngine::Vector3 BNNHHDKILGL;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 EJAJCBNCPLD
    // Size: 0xC
    // Offset: 0x584
    ::UnityEngine::Vector3 EJAJCBNCPLD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::IPlayerClass
    operator ::GlobalNamespace::IPlayerClass() noexcept {
      return *reinterpret_cast<::GlobalNamespace::IPlayerClass*>(this);
    }
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single LEGNJPIEHKE
    [[deprecated("Use field access instead!")]] float& dyn_LEGNJPIEHKE();
    // Get instance field reference: private System.Single PMGMDMHOPMP
    [[deprecated("Use field access instead!")]] float& dyn_PMGMDMHOPMP();
    // Get instance field reference: private System.Int32 HFGIDHPFBLD
    [[deprecated("Use field access instead!")]] int& dyn_HFGIDHPFBLD();
