// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: SyncedObject
  class SyncedObject;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::SyncedObject);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::SyncedObject*, "MagicalActual", "SyncedObject");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x5C
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.SyncedObject
  // [TokenAttribute] Offset: FFFFFFFF
  class SyncedObject : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.GameObject obj
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::GameObject* obj;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Vector3 prevPos
    // Size: 0xC
    // Offset: 0x18
    ::UnityEngine::Vector3 prevPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 curPos
    // Size: 0xC
    // Offset: 0x24
    ::UnityEngine::Vector3 curPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion prevRot
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Quaternion prevRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion curRot
    // Size: 0x10
    // Offset: 0x40
    ::UnityEngine::Quaternion curRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Single timeSinceReceivedPositionUpdate
    // Size: 0x4
    // Offset: 0x50
    float timeSinceReceivedPositionUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeSinceReceivedRotationUpdate
    // Size: 0x4
    // Offset: 0x54
    float timeSinceReceivedRotationUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single timeSinceRacePositionUpdate
    // Size: 0x4
    // Offset: 0x58
    float timeSinceRacePositionUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: public UnityEngine.GameObject obj
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_obj();
    // Get instance field reference: public UnityEngine.Vector3 prevPos
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_prevPos();
    // Get instance field reference: public UnityEngine.Vector3 curPos
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_curPos();
    // Get instance field reference: public UnityEngine.Quaternion prevRot
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_prevRot();
    // Get instance field reference: public UnityEngine.Quaternion curRot
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_curRot();
