// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Ray
#include "UnityEngine/Ray.hpp"
// Including type: UnityEngine.RaycastHit
#include "UnityEngine/RaycastHit.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: SpriteRenderer
  class SpriteRenderer;
  // Forward declaring type: Animator
  class Animator;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: LineRenderer
  class LineRenderer;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: Collider
  class Collider;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Monster
  class Monster;
  // Forward declaring type: PlayerTool
  class PlayerTool;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Tagger
  class Tagger;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Tagger);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Tagger*, "MagicalActual", "Tagger");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x120
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Tagger
  // [TokenAttribute] Offset: FFFFFFFF
  class Tagger : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Transform shootingPoint
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Transform* shootingPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single shootingDistance
    // Size: 0x4
    // Offset: 0x20
    float shootingDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Byte targetType
    // Size: 0x1
    // Offset: 0x24
    uint8_t targetType;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: targetType and: highlightColor
    char __padding2[0x3] = {};
    // private UnityEngine.Color highlightColor
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Color highlightColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Transform nobGripTransform
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Transform* nobGripTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single spriteDistance
    // Size: 0x4
    // Offset: 0x40
    float spriteDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single spriteHeightOffset
    // Size: 0x4
    // Offset: 0x44
    float spriteHeightOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Transform nobTransform
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* nobTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Sprite[] sprites
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::UnityEngine::Sprite*> sprites;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Sprite*>) == 0x8);
    // private UnityEngine.Vector3 CCAMEFGEBBE
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 CCAMEFGEBBE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: CCAMEFGEBBE and: spriteRenderer
    char __padding9[0x4] = {};
    // private UnityEngine.SpriteRenderer spriteRenderer
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::SpriteRenderer* spriteRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::SpriteRenderer*) == 0x8);
    // private UnityEngine.Animator spriteAnimator
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Animator* spriteAnimator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private UnityEngine.AudioSource nobAudio
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::AudioSource* nobAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.AudioSource fireAudio
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::AudioSource* fireAudio;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // private UnityEngine.Transform CLHENPKKKKD
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Transform* CLHENPKKKKD;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Ray MLJGHGOBIJE
    // Size: 0x18
    // Offset: 0x90
    ::UnityEngine::Ray MLJGHGOBIJE;
    // Field size check
    static_assert(sizeof(::UnityEngine::Ray) == 0x18);
    // private System.Int32 HFKELBOMOCO
    // Size: 0x4
    // Offset: 0xA8
    int HFKELBOMOCO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean PGMFIFINKIH
    // Size: 0x1
    // Offset: 0xAC
    bool PGMFIFINKIH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean CIGMJJBLKBM
    // Size: 0x1
    // Offset: 0xAD
    bool CIGMJJBLKBM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ADMHDHJNACN
    // Size: 0x1
    // Offset: 0xAE
    bool ADMHDHJNACN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ADMHDHJNACN and: JJHPPCDPBNJ
    char __padding19[0x1] = {};
    // private System.Single JJHPPCDPBNJ
    // Size: 0x4
    // Offset: 0xB0
    float JJHPPCDPBNJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EIJBECJKGOE
    // Size: 0x4
    // Offset: 0xB4
    float EIJBECJKGOE;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.LineRenderer ILOMBBPAAPF
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::LineRenderer* ILOMBBPAAPF;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // private OrbusTrackedController MLFAOLPJNIF
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::OrbusTrackedController* MLFAOLPJNIF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private OrbusTrackedController GNJHALGCEHE
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::OrbusTrackedController* GNJHALGCEHE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private UnityEngine.Transform LKCGHPCDEML
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Transform* LKCGHPCDEML;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.BoxCollider MLDFAPMCOMG
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::BoxCollider* MLDFAPMCOMG;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // private MagicalActual.Monster JNHNONMLIIG
    // Size: 0x8
    // Offset: 0xE0
    ::MagicalActual::Monster* JNHNONMLIIG;
    // Field size check
    static_assert(sizeof(::MagicalActual::Monster*) == 0x8);
    // private UnityEngine.RaycastHit[] BOPNDNCHJHM
    // Size: 0x8
    // Offset: 0xE8
    ::ArrayW<::UnityEngine::RaycastHit> BOPNDNCHJHM;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RaycastHit>) == 0x8);
    // private UnityEngine.Collider[] AIGEPDPMBKD
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<::UnityEngine::Collider*> AIGEPDPMBKD;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private ClickedEventHandler MOHACFAMFIF
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::ClickedEventHandler* MOHACFAMFIF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler DOHCOGANKCE
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::ClickedEventHandler* DOHCOGANKCE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler JHBPFFCEFAE
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::ClickedEventHandler* JHBPFFCEFAE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler JPFBCLBJHCF
    // Size: 0x8
    // Offset: 0x110
    ::GlobalNamespace::ClickedEventHandler* JPFBCLBJHCF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE57F0
    // private MagicalActual.PlayerTool <DGACPEMHNJJ>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::MagicalActual::PlayerTool* DGACPEMHNJJ;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Transform shootingPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_shootingPoint();
    // Get instance field reference: private System.Single shootingDistance
    [[deprecated("Use field access instead!")]] float& dyn_shootingDistance();
    // Get instance field reference: private System.Byte targetType
    [[deprecated("Use field access instead!")]] uint8_t& dyn_targetType();
    // Get instance field reference: private UnityEngine.Color highlightColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_highlightColor();
