// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Swordboard
  class Swordboard;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: WaitForSeconds
  class WaitForSeconds;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: TauntHorn
  class TauntHorn;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::TauntHorn);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::TauntHorn*, "MagicalActual", "TauntHorn");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.TauntHorn
  // [TokenAttribute] Offset: FFFFFFFF
  class TauntHorn : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::TauntHorn::$SnapBack$d__10
    class $SnapBack$d__10;
    // Nested type: ::MagicalActual::TauntHorn::$DoTaunt$d__13
    class $DoTaunt$d__13;
    public:
    // private UnityEngine.Rigidbody EIPMBKLODIJ
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rigidbody* EIPMBKLODIJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.Transform ONANMANNPAN
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* ONANMANNPAN;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Quaternion IDFEBFFILHO
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Quaternion IDFEBFFILHO;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 BHKMOANPDJK
    // Size: 0xC
    // Offset: 0x38
    ::UnityEngine::Vector3 BHKMOANPDJK;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean GGIIBLPLFDE
    // Size: 0x1
    // Offset: 0x44
    bool GGIIBLPLFDE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GGIIBLPLFDE and: mySwordboard
    char __padding4[0x3] = {};
    // public MagicalActual.Swordboard mySwordboard
    // Size: 0x8
    // Offset: 0x48
    ::MagicalActual::Swordboard* mySwordboard;
    // Field size check
    static_assert(sizeof(::MagicalActual::Swordboard*) == 0x8);
    // private System.Boolean BGAMFIMIADO
    // Size: 0x1
    // Offset: 0x50
    bool BGAMFIMIADO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HKFLFLKOPNG
    // Size: 0x1
    // Offset: 0x51
    bool HKFLFLKOPNG;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HKFLFLKOPNG and: JHIDIGHMEIB
    char __padding7[0x6] = {};
    // private UnityEngine.WaitForSeconds JHIDIGHMEIB
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::WaitForSeconds* JHIDIGHMEIB;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForSeconds*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.Rigidbody EIPMBKLODIJ
    [[deprecated("Use field access instead!")]] ::UnityEngine::Rigidbody*& dyn_EIPMBKLODIJ();
    // Get instance field reference: private UnityEngine.Transform ONANMANNPAN
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_ONANMANNPAN();
    // Get instance field reference: private UnityEngine.Quaternion IDFEBFFILHO
    [[deprecated("Use field access instead!")]] ::UnityEngine::Quaternion& dyn_IDFEBFFILHO();
    // Get instance field reference: private UnityEngine.Vector3 BHKMOANPDJK
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_BHKMOANPDJK();
