// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Taxi
  class Taxi;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Taxi);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Taxi*, "MagicalActual", "Taxi");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x39
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Taxi
  // [TokenAttribute] Offset: FFFFFFFF
  class Taxi : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.Vector4[] wayPoints
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::Vector4> wayPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector4>) == 0x8);
    // public System.Int32 startingWaypoint
    // Size: 0x4
    // Offset: 0x20
    int startingWaypoint;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: startingWaypoint and: OrbusNetComponent
    char __padding1[0x4] = {};
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x28
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE4FE0
    // private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::NetEntity* JANFCAJMFMP;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // public System.Boolean isDocked
    // Size: 0x1
    // Offset: 0x38
    bool isDocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Vector4[] wayPoints
    [[deprecated("Use field access instead!")]] ::ArrayW<::UnityEngine::Vector4>& dyn_wayPoints();
    // Get instance field reference: public System.Int32 startingWaypoint
    [[deprecated("Use field access instead!")]] int& dyn_startingWaypoint();
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity <JANFCAJMFMP>k__BackingField
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_$JANFCAJMFMP$k__BackingField();
    // Get instance field reference: public System.Boolean isDocked
    [[deprecated("Use field access instead!")]] bool& dyn_isDocked();
    // private System.Void GDDBINCPIAJ()
    // Offset: 0x166E294
    void GDDBINCPIAJ();
    // private System.Void CIFIJDAJKEK()
    // Offset: 0x166E468
    void CIFIJDAJKEK();
    // public System.Void OFDMFGNMEOP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166E608
    void OFDMFGNMEOP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void JJEJNGMIMOI(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166E6D8
    void JJEJNGMIMOI(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void FBONHOOJHBG()
    // Offset: 0x166E7A8
    void FBONHOOJHBG();
    // public System.Void OAMOHIMHKEK(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166E98C
    void OAMOHIMHKEK(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void OGALJHFFLHP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166EA58
    void OGALJHFFLHP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void JNFEEDCNFMH(System.Object LPBDOKJFOJI)
    // Offset: 0x166EB24
    void JNFEEDCNFMH(::Il2CppObject* LPBDOKJFOJI);
    // public MagicalActual.NetEntity KDDNJODNAKE()
    // Offset: 0x166ED3C
    ::MagicalActual::NetEntity* KDDNJODNAKE();
    // public MagicalActual.NetEntity FEJJNMAIHGI()
    // Offset: 0x166ED44
    ::MagicalActual::NetEntity* FEJJNMAIHGI();
    // public System.Void .ctor()
    // Offset: 0x166ED4C
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static Taxi* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::Taxi::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<Taxi*, creationType>()));
    }
    // private System.Void DHKPPAENLLA(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166EA50
    void DHKPPAENLLA(::MagicalActual::NetEntity* MMMEIONJJFJ);
    // private System.Void ALPOMOEPBFL()
    // Offset: 0x166EDA4
    void ALPOMOEPBFL();
    // private System.Void MHNAEMEFCOL(System.Object LPBDOKJFOJI)
    // Offset: 0x166EF6C
    void MHNAEMEFCOL(::Il2CppObject* LPBDOKJFOJI);
    // private System.Void PEBEGKADCEL(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166E7A0
    void PEBEGKADCEL(::MagicalActual::NetEntity* MMMEIONJJFJ);
    // public MagicalActual.NetEntity get_myEntity()
    // Offset: 0x166F184
    ::MagicalActual::NetEntity* get_myEntity();
    // private System.Void NNNJFEHEDPP(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166F18C
    void NNNJFEHEDPP(::MagicalActual::NetEntity* MMMEIONJJFJ);
    // public System.Void EGJMIHFLOKP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166F194
    void EGJMIHFLOKP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void EKFFDPIMDPP()
    // Offset: 0x166F264
    void EKFFDPIMDPP();
    // private System.Void LODHEFIKMLD()
    // Offset: 0x166EFD8
    void LODHEFIKMLD();
    // public MagicalActual.NetEntity FIGPLOCFPNF()
    // Offset: 0x166F42C
    ::MagicalActual::NetEntity* FIGPLOCFPNF();
    // public MagicalActual.NetEntity PKEIAHOANMK()
    // Offset: 0x166F434
    ::MagicalActual::NetEntity* PKEIAHOANMK();
    // public MagicalActual.NetEntity EGFAGMEPAPB()
    // Offset: 0x166F43C
    ::MagicalActual::NetEntity* EGFAGMEPAPB();
    // public System.Void IOOBCJAJKCJ(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166F444
    void IOOBCJAJKCJ(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public MagicalActual.NetEntity JKOLNACNGMC()
    // Offset: 0x166F50C
    ::MagicalActual::NetEntity* JKOLNACNGMC();
    // public MagicalActual.NetEntity AGJMDNHKJFK()
    // Offset: 0x166F514
    ::MagicalActual::NetEntity* AGJMDNHKJFK();
    // public MagicalActual.NetEntity HPJAGCLIFEP()
    // Offset: 0x166F51C
    ::MagicalActual::NetEntity* HPJAGCLIFEP();
    // private System.Void CCFLCJLOFCI()
    // Offset: 0x166F524
    void CCFLCJLOFCI();
    // private System.Void Start()
    // Offset: 0x166F6F8
    void Start();
    // private System.Void PLPGMIILDJA(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166EB1C
    void PLPGMIILDJA(::MagicalActual::NetEntity* MMMEIONJJFJ);
    // public MagicalActual.NetEntity AKIFBHFAMJE()
    // Offset: 0x166F708
    ::MagicalActual::NetEntity* AKIFBHFAMJE();
    // private System.Void JENOIOBAEPG()
    // Offset: 0x166F710
    void JENOIOBAEPG();
    // private System.Void BFPCKHBCHHJ(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166F25C
    void BFPCKHBCHHJ(::MagicalActual::NetEntity* MMMEIONJJFJ);
    // public System.Void DKDBFFDLADP(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166F720
    void DKDBFFDLADP(::MagicalActual::NetEntity* CMLIHJCOINC);
    // public System.Void orbusNetInit(MagicalActual.NetEntity CMLIHJCOINC)
    // Offset: 0x166F7E4
    void orbusNetInit(::MagicalActual::NetEntity* CMLIHJCOINC);
    // private System.Void CLKPBFHCJNN(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166F8AC
    void CLKPBFHCJNN(::MagicalActual::NetEntity* MMMEIONJJFJ);
    // private System.Void BCBNCEMNGHI()
    // Offset: 0x166E7B8
    void BCBNCEMNGHI();
    // public MagicalActual.NetEntity MEFPIBHPFMO()
    // Offset: 0x166F8B4
    ::MagicalActual::NetEntity* MEFPIBHPFMO();
    // private System.Void APMNGLNBFNP()
    // Offset: 0x166F8BC
    void APMNGLNBFNP();
    // private System.Void FGIFGGNGKPK()
    // Offset: 0x166F8CC
    void FGIFGGNGKPK();
    // public MagicalActual.NetEntity EMNFBGDGMOA()
    // Offset: 0x166F8DC
    ::MagicalActual::NetEntity* EMNFBGDGMOA();
    // private System.Void DGIKKMCHFGM(System.Object LPBDOKJFOJI)
    // Offset: 0x166F8E4
    void DGIKKMCHFGM(::Il2CppObject* LPBDOKJFOJI);
    // private System.Void KCGPJGPCPJI(System.Object LPBDOKJFOJI)
    // Offset: 0x166F950
    void KCGPJGPCPJI(::Il2CppObject* LPBDOKJFOJI);
    // private System.Void KEOPPGPHEBB()
    // Offset: 0x166EB90
    void KEOPPGPHEBB();
    // private System.Void BLLLIJPBEMC(System.Object LPBDOKJFOJI)
    // Offset: 0x166F9BC
    void BLLLIJPBEMC(::Il2CppObject* LPBDOKJFOJI);
    // private System.Void EHPCJNJCACO(MagicalActual.NetEntity MMMEIONJJFJ)
    // Offset: 0x166E6D0
    void EHPCJNJCACO(::MagicalActual::NetEntity* MMMEIONJJFJ);
  }; // MagicalActual.Taxi
  #pragma pack(pop)
  static check_size<sizeof(Taxi), 56 + sizeof(bool)> __MagicalActual_TaxiSizeCheck;
  static_assert(sizeof(Taxi) == 0x39);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::Taxi::GDDBINCPIAJ
// Il2CppName: GDDBINCPIAJ
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::Taxi::*)()>(&MagicalActual::Taxi::GDDBINCPIAJ)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::Taxi*), "GDDBINCPIAJ", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::Taxi::CIFIJDAJKEK
// Il2CppName: CIFIJDAJKEK
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::Taxi::*)()>(&MagicalActual::Taxi::CIFIJDAJKEK)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::Taxi*), "CIFIJDAJKEK", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
