// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Taxi
  class Taxi;
  // Forward declaring type: NavigationTaxi
  class NavigationTaxi;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: TaxiDock
  class TaxiDock;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::TaxiDock);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::TaxiDock*, "MagicalActual", "TaxiDock");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.TaxiDock
  // [TokenAttribute] Offset: FFFFFFFF
  class TaxiDock : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.Taxi BCLOKHFCCFJ
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::Taxi* BCLOKHFCCFJ;
    // Field size check
    static_assert(sizeof(::MagicalActual::Taxi*) == 0x8);
    // public MagicalActual.NavigationTaxi teleportTaxi
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NavigationTaxi* teleportTaxi;
    // Field size check
    static_assert(sizeof(::MagicalActual::NavigationTaxi*) == 0x8);
    // public MagicalActual.NavigationTaxi exitTaxi
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::NavigationTaxi* exitTaxi;
    // Field size check
    static_assert(sizeof(::MagicalActual::NavigationTaxi*) == 0x8);
    // public UnityEngine.GameObject drawBridge
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* drawBridge;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single MNEBMPCAKBH
    // Size: 0x4
    // Offset: 0x38
    float MNEBMPCAKBH;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DEKGICKCJOK
    // Size: 0x4
    // Offset: 0x3C
    float DEKGICKCJOK;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.Taxi BCLOKHFCCFJ
    [[deprecated("Use field access instead!")]] ::MagicalActual::Taxi*& dyn_BCLOKHFCCFJ();
    // Get instance field reference: public MagicalActual.NavigationTaxi teleportTaxi
    [[deprecated("Use field access instead!")]] ::MagicalActual::NavigationTaxi*& dyn_teleportTaxi();
    // Get instance field reference: public MagicalActual.NavigationTaxi exitTaxi
    [[deprecated("Use field access instead!")]] ::MagicalActual::NavigationTaxi*& dyn_exitTaxi();
    // Get instance field reference: public UnityEngine.GameObject drawBridge
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_drawBridge();
    // Get instance field reference: private System.Single MNEBMPCAKBH
    [[deprecated("Use field access instead!")]] float& dyn_MNEBMPCAKBH();
    // Get instance field reference: private System.Single DEKGICKCJOK
    [[deprecated("Use field access instead!")]] float& dyn_DEKGICKCJOK();
    // private System.Void HJEMGEKCDJL()
    // Offset: 0x166FA28
    void HJEMGEKCDJL();
    // private System.Void HEILJFMKPCH()
    // Offset: 0x166FAB0
    void HEILJFMKPCH();
    // private System.Void GDLDHEMDDAC()
    // Offset: 0x166FBD0
    void GDLDHEMDDAC();
    // private System.Void NBMIGEDAJKL()
    // Offset: 0x166FCF0
    void NBMIGEDAJKL();
    // private System.Void OJACFGALJGI()
    // Offset: 0x166FE10
    void OJACFGALJGI();
    // private System.Void BKPJLJHMGOO(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x166FE98
    void BKPJLJHMGOO(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void BMCHLHCEOKC()
    // Offset: 0x16700D4
    void BMCHLHCEOKC();
    // private System.Void NLBHHPFOKEL()
    // Offset: 0x16701F4
    void NLBHHPFOKEL();
    // private System.Void AMIPIMKIJMO()
    // Offset: 0x167027C
    void AMIPIMKIJMO();
    // private System.Void HJKFJENIJFO()
    // Offset: 0x16705D4
    void HJKFJENIJFO();
    // private System.Void PPKGLOIDHPC(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x16706A4
    void PPKGLOIDHPC(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void NLFOPEAGLDJ()
    // Offset: 0x167073C
    void NLFOPEAGLDJ();
    // private System.Void DFCOAPEIKLN()
    // Offset: 0x1670A98
    void DFCOAPEIKLN();
    // private System.Void HNCFOMLACKG(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1670B68
    void HNCFOMLACKG(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void GBHCLNJDGLM()
    // Offset: 0x1670978
    void GBHCLNJDGLM();
    // private System.Void HLCJGDCAADP()
    // Offset: 0x1670DA4
    void HLCJGDCAADP();
    // private System.Void EPCHNEGNKNF()
    // Offset: 0x1670E2C
    void EPCHNEGNKNF();
    // private System.Void CBHNJJFFMOM()
    // Offset: 0x1670EFC
    void CBHNJJFFMOM();
    // private System.Void TaxiAvailable(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x167101C
    void TaxiAvailable(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void AHPPBBLDHBA(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1671254
    void AHPPBBLDHBA(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void EPFKDDFLMJF()
    // Offset: 0x16704B8
    void EPFKDDFLMJF();
    // private System.Void FixedUpdate()
    // Offset: 0x1671490
    void FixedUpdate();
    // private System.Void GGAFMPPDBOH()
    // Offset: 0x16716C0
    void GGAFMPPDBOH();
    // private System.Void BLIPCIAAIHI()
    // Offset: 0x1671A1C
    void BLIPCIAAIHI();
    // private System.Void GNMNHPHDANO(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1671C58
    void GNMNHPHDANO(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void GDNNDAFNAKD()
    // Offset: 0x1671CF0
    void GDNNDAFNAKD();
    // private System.Void IPIFMKAGODD()
    // Offset: 0x1671D78
    void IPIFMKAGODD();
    // private System.Void BFMLEIMIHIO()
    // Offset: 0x1671E48
    void BFMLEIMIHIO();
    // private System.Void TaxiUnavailable(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1671ED0
    void TaxiUnavailable(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void FPGHBPGMFEH(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1671F68
    void FPGHBPGMFEH(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void OIMFPMLEHKC()
    // Offset: 0x16721A4
    void OIMFPMLEHKC();
    // private System.Void MLGBKBMHHLE()
    // Offset: 0x167222C
    void MLGBKBMHHLE();
    // private System.Void NFIOIJCOOBF()
    // Offset: 0x16718FC
    void NFIOIJCOOBF();
    // private System.Void GMPKGINHKAC(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x16722FC
    void GMPKGINHKAC(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void LLBAENEGEMN()
    // Offset: 0x1672394
    void LLBAENEGEMN();
    // private System.Void AOHCBKACNPN(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x16725D0
    void AOHCBKACNPN(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void NEDFCIDMJBB()
    // Offset: 0x1672668
    void NEDFCIDMJBB();
    // private System.Void DGJGAFKDIDK()
    // Offset: 0x1672738
    void DGJGAFKDIDK();
    // private System.Void OACMGPBCPEL()
    // Offset: 0x1672808
    void OACMGPBCPEL();
    // public System.Void .ctor()
    // Offset: 0x16728D8
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static TaxiDock* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::MagicalActual::TaxiDock::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<TaxiDock*, creationType>()));
    }
    // private System.Void AHMLIMDJCJO()
    // Offset: 0x16728E0
    void AHMLIMDJCJO();
    // private System.Void Start()
    // Offset: 0x1672B10
    void Start();
    // private System.Void CLICNBNFEEP(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1672BDC
    void CLICNBNFEEP(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void EPIGHEHLDDP(MagicalActual.Taxi FOIEAOKBGLM)
    // Offset: 0x1672C74
    void EPIGHEHLDDP(::MagicalActual::Taxi* FOIEAOKBGLM);
    // private System.Void GEBDKEDAGEO()
    // Offset: 0x1672EB0
    void GEBDKEDAGEO();
    // private System.Void JCCJLPJGFBO()
    // Offset: 0x1672F38
    void JCCJLPJGFBO();
  }; // MagicalActual.TaxiDock
  #pragma pack(pop)
  static check_size<sizeof(TaxiDock), 60 + sizeof(float)> __MagicalActual_TaxiDockSizeCheck;
  static_assert(sizeof(TaxiDock) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: MagicalActual::TaxiDock::HJEMGEKCDJL
// Il2CppName: HJEMGEKCDJL
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::TaxiDock::*)()>(&MagicalActual::TaxiDock::HJEMGEKCDJL)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(MagicalActual::TaxiDock*), "HJEMGEKCDJL", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: MagicalActual::TaxiDock::HEILJFMKPCH
// Il2CppName: HEILJFMKPCH
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (MagicalActual::TaxiDock::*)()>(&MagicalActual::TaxiDock::HEILJFMKPCH)> {
  static const MethodInfo* get() {
