// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: LaserPointer
  class LaserPointer;
  // Forward declaring type: PlayerCharacter
  class PlayerCharacter;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: LineRenderer
  class LineRenderer;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Slider
  class Slider;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Teleporter
  class Teleporter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Teleporter);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Teleporter*, "MagicalActual", "Teleporter");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Teleporter
  // [TokenAttribute] Offset: FFFFFFFF
  class Teleporter : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::Teleporter::TeleporterState
    struct TeleporterState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.Teleporter/TeleporterState
    // [TokenAttribute] Offset: FFFFFFFF
    struct TeleporterState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: TeleporterState
      constexpr TeleporterState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.Teleporter/TeleporterState FNCIFCNLJBM
      static constexpr const int FNCIFCNLJBM = 1;
      // Get static field: static public MagicalActual.Teleporter/TeleporterState FNCIFCNLJBM
      static ::MagicalActual::Teleporter::TeleporterState _get_FNCIFCNLJBM();
      // Set static field: static public MagicalActual.Teleporter/TeleporterState FNCIFCNLJBM
      static void _set_FNCIFCNLJBM(::MagicalActual::Teleporter::TeleporterState value);
      // static field const value: static public MagicalActual.Teleporter/TeleporterState ANCLBBAOOMP
      static constexpr const int ANCLBBAOOMP = 2;
      // Get static field: static public MagicalActual.Teleporter/TeleporterState ANCLBBAOOMP
      static ::MagicalActual::Teleporter::TeleporterState _get_ANCLBBAOOMP();
      // Set static field: static public MagicalActual.Teleporter/TeleporterState ANCLBBAOOMP
      static void _set_ANCLBBAOOMP(::MagicalActual::Teleporter::TeleporterState value);
      // static field const value: static public MagicalActual.Teleporter/TeleporterState KKELIPGJJOP
      static constexpr const int KKELIPGJJOP = 3;
      // Get static field: static public MagicalActual.Teleporter/TeleporterState KKELIPGJJOP
      static ::MagicalActual::Teleporter::TeleporterState _get_KKELIPGJJOP();
      // Set static field: static public MagicalActual.Teleporter/TeleporterState KKELIPGJJOP
      static void _set_KKELIPGJJOP(::MagicalActual::Teleporter::TeleporterState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.Teleporter/TeleporterState
    #pragma pack(pop)
    static check_size<sizeof(Teleporter::TeleporterState), 0 + sizeof(int)> __MagicalActual_Teleporter_TeleporterStateSizeCheck;
    static_assert(sizeof(Teleporter::TeleporterState) == 0x4);
    public:
    // private OrbusTrackedController FIEOJOOJKCJ
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::OrbusTrackedController* FIEOJOOJKCJ;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private MagicalActual.LaserPointer LLDJNFONHFD
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::LaserPointer* LLDJNFONHFD;
    // Field size check
    static_assert(sizeof(::MagicalActual::LaserPointer*) == 0x8);
    // private UnityEngine.Vector3 HPEPOKANBPB
    // Size: 0xC
    // Offset: 0x28
    ::UnityEngine::Vector3 HPEPOKANBPB;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: HPEPOKANBPB and: AAAKFEDFHEH
    char __padding2[0x4] = {};
    // private UnityEngine.GameObject AAAKFEDFHEH
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* AAAKFEDFHEH;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public MagicalActual.PlayerCharacter myPlayer
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::PlayerCharacter* myPlayer;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerCharacter*) == 0x8);
    // public UnityEngine.UI.Slider chargeBar
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::UI::Slider* chargeBar;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Slider*) == 0x8);
    // public UnityEngine.GameObject teleportPointPrefab
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* teleportPointPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject ILNMGONPOPB
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* ILNMGONPOPB;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Vector3[] KKGJPMDJOMJ
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::UnityEngine::Vector3> KKGJPMDJOMJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.LineRenderer ADMMPKAAILI
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::LineRenderer* ADMMPKAAILI;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // private UnityEngine.GameObject CHOBOICMCCN
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* CHOBOICMCCN;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean IPMLIBBPOGE
    // Size: 0x1
    // Offset: 0x78
    bool IPMLIBBPOGE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IPMLIBBPOGE and: OFCKIEOKCHC
    char __padding11[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAE44A8
    // private System.Single <OFCKIEOKCHC>k__BackingField
    // Size: 0x4
    // Offset: 0x7C
    float OFCKIEOKCHC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE44B8
    // private System.Single <NIDFLJDJBLB>k__BackingField
    // Size: 0x4
    // Offset: 0x80
    float NIDFLJDJBLB;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single NKGIEOJMCFO
    // Size: 0x4
    // Offset: 0x84
    float NKGIEOJMCFO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single DKCCNKCGCBD
    // Size: 0x4
    // Offset: 0x88
    float DKCCNKCGCBD;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean autoRunEngaged
    // Size: 0x1
    // Offset: 0x8C
    bool autoRunEngaged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoRunEngaged and: IAJKBBMNAON
    char __padding16[0x3] = {};
    // private UnityEngine.Vector3 IAJKBBMNAON
    // Size: 0xC
    // Offset: 0x90
    ::UnityEngine::Vector3 IAJKBBMNAON;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: IAJKBBMNAON and: DOJJNJHKNLK
    char __padding17[0x4] = {};
    // private MagicalActual.Grabber DOJJNJHKNLK
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::Grabber* DOJJNJHKNLK;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private System.Single GMCGEKMLOKG
    // Size: 0x4
    // Offset: 0xA8
    float GMCGEKMLOKG;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE44D8
    // private System.Boolean <FDENODKKCAE>k__BackingField
    // Size: 0x1
    // Offset: 0xAC
    bool FDENODKKCAE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean GDECEEMKIPA
    // Size: 0x1
    // Offset: 0xAD
    bool GDECEEMKIPA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: GDECEEMKIPA and: IGOPFAFMIIP
    char __padding21[0x2] = {};
    // private System.Int32 IGOPFAFMIIP
    // Size: 0x4
    // Offset: 0xB0
    int IGOPFAFMIIP;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE44E8
    // private System.Single <KCCEABPHKFN>k__BackingField
    // Size: 0x4
    // Offset: 0xB4
    float KCCEABPHKFN;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAE44F8
    // private UnityEngine.Vector3 <OBGKJCDEDBI>k__BackingField
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::Vector3 OBGKJCDEDBI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAE4508
    // private System.Single <ONLLLFMHCFO>k__BackingField
    // Size: 0x4
    // Offset: 0xC4
    float ONLLLFMHCFO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.String OCLOJMPJONI
    // Size: 0x8
    // Offset: 0xC8
    ::StringW OCLOJMPJONI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String GNNCECPJLGO
    // Size: 0x8
    // Offset: 0xD0
    ::StringW GNNCECPJLGO;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean MDMPCFKHOFM
    // Size: 0x1
    // Offset: 0xD8
    bool MDMPCFKHOFM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isGrabberScrolling
    // Size: 0x1
    // Offset: 0xD9
    bool isGrabberScrolling;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isGrabberScrolling and: IICCABCMFCP
    char __padding29[0x2] = {};
    // private MagicalActual.Teleporter/TeleporterState IICCABCMFCP
    // Size: 0x4
    // Offset: 0xDC
    ::MagicalActual::Teleporter::TeleporterState IICCABCMFCP;
    // Field size check
    static_assert(sizeof(::MagicalActual::Teleporter::TeleporterState) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private OrbusTrackedController FIEOJOOJKCJ
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::OrbusTrackedController*& dyn_FIEOJOOJKCJ();
    // Get instance field reference: private MagicalActual.LaserPointer LLDJNFONHFD
    [[deprecated("Use field access instead!")]] ::MagicalActual::LaserPointer*& dyn_LLDJNFONHFD();
    // Get instance field reference: private UnityEngine.Vector3 HPEPOKANBPB
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_HPEPOKANBPB();
    // Get instance field reference: private UnityEngine.GameObject AAAKFEDFHEH
