// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerTool
  class PlayerTool;
  // Forward declaring type: Grabber
  class Grabber;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: TeleportationDevice
  class TeleportationDevice;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::TeleportationDevice);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::TeleportationDevice*, "MagicalActual", "TeleportationDevice");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x61
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.TeleportationDevice
  // [TokenAttribute] Offset: FFFFFFFF
  class TeleportationDevice : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private MagicalActual.PlayerTool FKJHGIFOJKD
    // Size: 0x8
    // Offset: 0x18
    ::MagicalActual::PlayerTool* FKJHGIFOJKD;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerTool*) == 0x8);
    // private System.Single LIBCNBNBLOO
    // Size: 0x4
    // Offset: 0x20
    float LIBCNBNBLOO;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single EEDKICDNHGM
    // Size: 0x4
    // Offset: 0x24
    float EEDKICDNHGM;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean BHDFMKPMCPM
    // Size: 0x1
    // Offset: 0x28
    bool BHDFMKPMCPM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean FOHNMMBGCOL
    // Size: 0x1
    // Offset: 0x29
    bool FOHNMMBGCOL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: FOHNMMBGCOL and: topGlobe
    char __padding4[0x6] = {};
    // public UnityEngine.GameObject topGlobe
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* topGlobe;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.AudioSource IJAJMBBHKHJ
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::AudioSource* IJAJMBBHKHJ;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public SuperTextMesh cooldownText
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::SuperTextMesh* cooldownText;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // private UnityEngine.MeshRenderer myMeshRenderer
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::MeshRenderer* myMeshRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.Events.UnityEvent doDeviceEffect
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Events::UnityEvent* doDeviceEffect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent onDeviceReleased
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Events::UnityEvent* onDeviceReleased;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // private System.Boolean EEPAKMFBOPA
    // Size: 0x1
    // Offset: 0x60
    bool EEPAKMFBOPA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private MagicalActual.PlayerTool FKJHGIFOJKD
    [[deprecated("Use field access instead!")]] ::MagicalActual::PlayerTool*& dyn_FKJHGIFOJKD();
    // Get instance field reference: private System.Single LIBCNBNBLOO
    [[deprecated("Use field access instead!")]] float& dyn_LIBCNBNBLOO();
    // Get instance field reference: private System.Single EEDKICDNHGM
    [[deprecated("Use field access instead!")]] float& dyn_EEDKICDNHGM();
    // Get instance field reference: private System.Boolean BHDFMKPMCPM
    [[deprecated("Use field access instead!")]] bool& dyn_BHDFMKPMCPM();
    // Get instance field reference: private System.Boolean FOHNMMBGCOL
