// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: WorldMenu
  class WorldMenu;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: TeleportPillar
  class TeleportPillar;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::TeleportPillar);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::TeleportPillar*, "MagicalActual", "TeleportPillar");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x58
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.TeleportPillar
  // [TokenAttribute] Offset: FFFFFFFF
  class TeleportPillar : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::TeleportPillar::$$c__DisplayClass10_0
    class $$c__DisplayClass10_0;
    public:
    // public System.String pillarKey
    // Size: 0x8
    // Offset: 0x18
    ::StringW pillarKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public UnityEngine.GameObject foundVfx
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* foundVfx;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single JDHBOCAFOOC
    // Size: 0x4
    // Offset: 0x28
    float JDHBOCAFOOC;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single GLEGHGCDIKJ
    // Size: 0x4
    // Offset: 0x2C
    float GLEGHGCDIKJ;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean ENKNDOCJIOM
    // Size: 0x1
    // Offset: 0x30
    bool ENKNDOCJIOM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ENKNDOCJIOM and: PHAHKGDIPKH
    char __padding4[0x7] = {};
    // private System.String[] PHAHKGDIPKH
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::StringW> PHAHKGDIPKH;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private MagicalActual.WorldMenu KNCKPELAKBH
    // Size: 0x8
    // Offset: 0x40
    ::MagicalActual::WorldMenu* KNCKPELAKBH;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // private System.Boolean KJLJAJMPNDI
    // Size: 0x1
    // Offset: 0x48
    bool KJLJAJMPNDI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: KJLJAJMPNDI and: BKMKMILINPK
    char __padding7[0x7] = {};
    // private PhysicsInteractable[] BKMKMILINPK
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::GlobalNamespace::PhysicsInteractable*> BKMKMILINPK;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::PhysicsInteractable*>) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String pillarKey
    [[deprecated("Use field access instead!")]] ::StringW& dyn_pillarKey();
    // Get instance field reference: public UnityEngine.GameObject foundVfx
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_foundVfx();
    // Get instance field reference: private System.Single JDHBOCAFOOC
    [[deprecated("Use field access instead!")]] float& dyn_JDHBOCAFOOC();
    // Get instance field reference: private System.Single GLEGHGCDIKJ
    [[deprecated("Use field access instead!")]] float& dyn_GLEGHGCDIKJ();
