// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ItemContainer
  class ItemContainer;
  // Forward declaring type: GenericChest
  class GenericChest;
  // Forward declaring type: ButtonPresser
  class ButtonPresser;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: WorldMenu
  class WorldMenu;
  // Forward declaring type: TinkerableObject
  class TinkerableObject;
  // Forward declaring type: BlueprintIcon
  class BlueprintIcon;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItem
  class InventoryItem;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: BinaryWriter
  class BinaryWriter;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: TinkererStation
  class TinkererStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::TinkererStation);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::TinkererStation*, "MagicalActual", "TinkererStation");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x140
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.TinkererStation
  // [TokenAttribute] Offset: FFFFFFFF
  class TinkererStation : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::TinkererStation::$$c__DisplayClass45_0
    class $$c__DisplayClass45_0;
    // Nested type: ::MagicalActual::TinkererStation::$DoRequestUnlockedBlueprints$d__46
    class $DoRequestUnlockedBlueprints$d__46;
    // Nested type: ::MagicalActual::TinkererStation::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Nested type: ::MagicalActual::TinkererStation::$ShowToolTip$d__53
    class $ShowToolTip$d__53;
    public:
    // private UnityEngine.GameObject tinkerableItemSpawnPoint
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* tinkerableItemSpawnPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject menuPoint
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::GameObject* menuPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject tinkerableMenuPoint
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::GameObject* tinkerableMenuPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject completedVFX
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* completedVFX;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject cancelButton
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* cancelButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject previewParticles
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* previewParticles;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject iconPrefab
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* iconPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject skinListContent
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* skinListContent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject buildButton
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* buildButton;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject toolTip
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* toolTip;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject cancelBuildPrompt
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* cancelBuildPrompt;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject buttonControls
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* buttonControls;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject buildParticles
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* buildParticles;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.UI.Text requirementsText
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::UI::Text* requirementsText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text insufficentText
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::UI::Text* insufficentText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text cancelBuildText
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::UI::Text* cancelBuildText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text unlockedBlueprintsText
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::UI::Text* unlockedBlueprintsText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private MagicalActual.ItemContainer myItemContainer
    // Size: 0x8
    // Offset: 0xA0
    ::MagicalActual::ItemContainer* myItemContainer;
    // Field size check
    static_assert(sizeof(::MagicalActual::ItemContainer*) == 0x8);
    // private MagicalActual.GenericChest myChest
    // Size: 0x8
    // Offset: 0xA8
    ::MagicalActual::GenericChest* myChest;
    // Field size check
    static_assert(sizeof(::MagicalActual::GenericChest*) == 0x8);
    // private MagicalActual.ButtonPresser rotateLeftButton
    // Size: 0x8
    // Offset: 0xB0
    ::MagicalActual::ButtonPresser* rotateLeftButton;
    // Field size check
    static_assert(sizeof(::MagicalActual::ButtonPresser*) == 0x8);
    // private MagicalActual.ButtonPresser rotateRightButton
    // Size: 0x8
    // Offset: 0xB8
    ::MagicalActual::ButtonPresser* rotateRightButton;
    // Field size check
    static_assert(sizeof(::MagicalActual::ButtonPresser*) == 0x8);
    // private UnityEngine.RectTransform scrollableContent
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::RectTransform* scrollableContent;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.TextAsset tooltipHtml
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::TextAsset* tooltipHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // private UnityEngine.Canvas uiCanvas
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Canvas* uiCanvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private System.Boolean FIHMKBLLNNE
    // Size: 0x1
    // Offset: 0xD8
    bool FIHMKBLLNNE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean LDDPFNHFAEL
    // Size: 0x1
    // Offset: 0xD9
    bool LDDPFNHFAEL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ABPHBJIJNNO
    // Size: 0x1
    // Offset: 0xDA
    bool ABPHBJIJNNO;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HDPKDEBPIEI
    // Size: 0x1
    // Offset: 0xDB
    bool HDPKDEBPIEI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HDPKDEBPIEI and: OrbusNetComponent
    char __padding27[0x4] = {};
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0xE0
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0xE8
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.WorldMenu KNCKPELAKBH
    // Size: 0x8
    // Offset: 0xF0
    ::MagicalActual::WorldMenu* KNCKPELAKBH;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // private UnityEngine.GameObject ILIDJGHKOIA
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::GameObject* ILIDJGHKOIA;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.TinkerableObject ECAHMKGMEOP
    // Size: 0x8
    // Offset: 0x100
    ::MagicalActual::TinkerableObject* ECAHMKGMEOP;
    // Field size check
    static_assert(sizeof(::MagicalActual::TinkerableObject*) == 0x8);
    // public System.Collections.Generic.List`1<System.Int32> unlockedBlueprints
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<int>* unlockedBlueprints;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.BlueprintIcon> NKDJOJCBCBK
    // Size: 0x8
    // Offset: 0x110
    ::System::Collections::Generic::List_1<::MagicalActual::BlueprintIcon*>* NKDJOJCBCBK;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::BlueprintIcon*>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.Texture2D> OOCFIPOBKML
    // Size: 0x8
    // Offset: 0x118
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Texture2D*>* OOCFIPOBKML;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Texture2D*>*) == 0x8);
    // private MagicalActual.BlueprintIcon BODIFGKDPMC
    // Size: 0x8
    // Offset: 0x120
    ::MagicalActual::BlueprintIcon* BODIFGKDPMC;
    // Field size check
    static_assert(sizeof(::MagicalActual::BlueprintIcon*) == 0x8);
    // private MagicalActual.BlueprintIcon FMPHGHDGCNC
    // Size: 0x8
    // Offset: 0x128
    ::MagicalActual::BlueprintIcon* FMPHGHDGCNC;
    // Field size check
    static_assert(sizeof(::MagicalActual::BlueprintIcon*) == 0x8);
    // private UnityEngine.Coroutine EJIGECDJKLH
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::Coroutine* EJIGECDJKLH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Coroutine DDCOELDJDHA
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::Coroutine* DDCOELDJDHA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private UnityEngine.GameObject tinkerableItemSpawnPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_tinkerableItemSpawnPoint();
    // Get instance field reference: private UnityEngine.GameObject menuPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_menuPoint();
    // Get instance field reference: public UnityEngine.GameObject tinkerableMenuPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_tinkerableMenuPoint();
    // Get instance field reference: private UnityEngine.GameObject completedVFX
