// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: ToolController
  class ToolController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::ToolController);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::ToolController*, "MagicalActual", "ToolController");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xC5
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.ToolController
  // [TokenAttribute] Offset: FFFFFFFF
  class ToolController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.Events.UnityEvent MainTriggerClickEvent
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Events::UnityEvent* MainTriggerClickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent MainTriggerUnclickEvent
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Events::UnityEvent* MainTriggerUnclickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent MainGripClickEvent
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Events::UnityEvent* MainGripClickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent MainGripUnclickEvent
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Events::UnityEvent* MainGripUnclickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent OffhandTriggerClickEvent
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Events::UnityEvent* OffhandTriggerClickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent OffhandTriggerUnclickEvent
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Events::UnityEvent* OffhandTriggerUnclickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent OffhandGripClickEvent
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Events::UnityEvent* OffhandGripClickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // public UnityEngine.Events.UnityEvent OffhandGripUnclickEvent
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Events::UnityEvent* OffhandGripUnclickEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // private OrbusTrackedController MLFAOLPJNIF
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::OrbusTrackedController* MLFAOLPJNIF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private OrbusTrackedController GNJHALGCEHE
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::OrbusTrackedController* GNJHALGCEHE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OrbusTrackedController*) == 0x8);
    // private UnityEngine.Transform BAHENOANEHA
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* BAHENOANEHA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform LKCGHPCDEML
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* LKCGHPCDEML;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private ClickedEventHandler AJDDOIGJNIJ
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::ClickedEventHandler* AJDDOIGJNIJ;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler NHMNCBAEJJD
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::ClickedEventHandler* NHMNCBAEJJD;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler BKHHPDICCFK
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::ClickedEventHandler* BKHHPDICCFK;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler BOFOHLPDBHD
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::ClickedEventHandler* BOFOHLPDBHD;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler ANAKCGBKFJH
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::ClickedEventHandler* ANAKCGBKFJH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler EIBIGHGAALL
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::ClickedEventHandler* EIBIGHGAALL;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler JFLHPHEMECF
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::ClickedEventHandler* JFLHPHEMECF;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private ClickedEventHandler LKMJOIGFIKG
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::ClickedEventHandler* LKMJOIGFIKG;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5810
    // private PhysicsInteractable <NPOPILONGLE>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::PhysicsInteractable* NPOPILONGLE;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable*) == 0x8);
    // private System.Boolean ADMHDHJNACN
    // Size: 0x1
    // Offset: 0xC0
    bool ADMHDHJNACN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean ONMBIAIEAFA
    // Size: 0x1
    // Offset: 0xC1
    bool ONMBIAIEAFA;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean INLLFFILHMC
    // Size: 0x1
    // Offset: 0xC2
    bool INLLFFILHMC;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean JDAGHMIDGOL
    // Size: 0x1
    // Offset: 0xC3
    bool JDAGHMIDGOL;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean COKJDMPDNPH
    // Size: 0x1
    // Offset: 0xC4
    bool COKJDMPDNPH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Events.UnityEvent MainTriggerClickEvent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Events::UnityEvent*& dyn_MainTriggerClickEvent();
    // Get instance field reference: public UnityEngine.Events.UnityEvent MainTriggerUnclickEvent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Events::UnityEvent*& dyn_MainTriggerUnclickEvent();
    // Get instance field reference: public UnityEngine.Events.UnityEvent MainGripClickEvent
    [[deprecated("Use field access instead!")]] ::UnityEngine::Events::UnityEvent*& dyn_MainGripClickEvent();
    // Get instance field reference: public UnityEngine.Events.UnityEvent MainGripUnclickEvent
