// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: ItemContainer
  class ItemContainer;
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
  // Forward declaring type: InventoryIcon
  class InventoryIcon;
  // Forward declaring type: EquipmentSlotInfo
  class EquipmentSlotInfo;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: WorldUI
  class WorldUI;
  // Forward declaring type: Element
  class Element;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
  // Forward declaring type: InventoryItem
  class InventoryItem;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LTDescr
  class LTDescr;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: TransmogStation
  class TransmogStation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::TransmogStation);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::TransmogStation*, "MagicalActual", "TransmogStation");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0x1C8
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.TransmogStation
  // [TokenAttribute] Offset: FFFFFFFF
  class TransmogStation : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::TransmogStation::weaponTypes
    struct weaponTypes;
    // Nested type: ::MagicalActual::TransmogStation::$SetupTooltip$d__51
    class $SetupTooltip$d__51;
    // Nested type: ::MagicalActual::TransmogStation::$UpdateDummyEquipment$d__52
    class $UpdateDummyEquipment$d__52;
    // Nested type: ::MagicalActual::TransmogStation::$$c__DisplayClass55_0
    class $$c__DisplayClass55_0;
    // Nested type: ::MagicalActual::TransmogStation::$DoUpdateInventoryList$d__55
    class $DoUpdateInventoryList$d__55;
    // Nested type: ::MagicalActual::TransmogStation::$$c__DisplayClass56_0
    class $$c__DisplayClass56_0;
    // Nested type: ::MagicalActual::TransmogStation::$$c__DisplayClass57_0
    class $$c__DisplayClass57_0;
    // Nested type: ::MagicalActual::TransmogStation::$ShowTooltip$d__58
    class $ShowTooltip$d__58;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.ItemContainer LNABACFKNBA
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::ItemContainer* LNABACFKNBA;
    // Field size check
    static_assert(sizeof(::MagicalActual::ItemContainer*) == 0x8);
    // private System.Int32 MMPBDJPOBNE
    // Size: 0x4
    // Offset: 0x30
    int MMPBDJPOBNE;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public UnityEngine.Color SelectedColor
    // Size: 0x10
    // Offset: 0x34
    ::UnityEngine::Color SelectedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color PreviewColor
    // Size: 0x10
    // Offset: 0x44
    ::UnityEngine::Color PreviewColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color SilverFoilColor
    // Size: 0x10
    // Offset: 0x54
    ::UnityEngine::Color SilverFoilColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color GoldFoilColor
    // Size: 0x10
    // Offset: 0x64
    ::UnityEngine::Color GoldFoilColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color CitadelFoilColor
    // Size: 0x10
    // Offset: 0x74
    ::UnityEngine::Color CitadelFoilColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: CitadelFoilColor and: UIPanels
    char __padding8[0x4] = {};
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> UIPanels
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* UIPanels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // private UnityEngine.Transform LeftUI
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Transform* LeftUI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform RightUI
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Transform* RightUI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject skinListContent
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::GameObject* skinListContent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject ConfirmPrompt
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::GameObject* ConfirmPrompt;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.UI.Text ConfirmText
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::UI::Text* ConfirmText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text ErrorText
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::UI::Text* ErrorText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public MagicalActual.PlayerAvatar PlayerDummy
    // Size: 0x8
    // Offset: 0xC0
    ::MagicalActual::PlayerAvatar* PlayerDummy;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // private UnityEngine.GameObject iconPrefab
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::GameObject* iconPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.TextAsset tooltipHtml
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::TextAsset* tooltipHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // private PowerUI.WorldUI IENFBPOPMAI
    // Size: 0x8
    // Offset: 0xD8
    ::PowerUI::WorldUI* IENFBPOPMAI;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // private PowerUI.Element MBGAGLBLILK
    // Size: 0x8
    // Offset: 0xE0
    ::PowerUI::Element* MBGAGLBLILK;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Transform> weapons
    // Size: 0x8
    // Offset: 0xE8
    ::System::Collections::Generic::List_1<::UnityEngine::Transform*>* weapons;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Transform*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5880
    // private System.Boolean <PGCNLMCGHDE>k__BackingField
    // Size: 0x1
    // Offset: 0xF0
    bool PGCNLMCGHDE;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PGCNLMCGHDE and: LIKAPAKJMDJ
    char __padding22[0x7] = {};
    // private ExtUI.InventoryItemInstance[] LIKAPAKJMDJ
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::ExtUI::InventoryItemInstance*> LIKAPAKJMDJ;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.InventoryIcon> ALDAMJCLJII
    // Size: 0x8
    // Offset: 0x100
    ::System::Collections::Generic::List_1<::MagicalActual::InventoryIcon*>* ALDAMJCLJII;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::InventoryIcon*>*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.InventoryIcon> ACELMPKMKBH
    // Size: 0x8
    // Offset: 0x108
    ::System::Collections::Generic::List_1<::MagicalActual::InventoryIcon*>* ACELMPKMKBH;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::InventoryIcon*>*) == 0x8);
    // private MagicalActual.InventoryIcon resetSkinIcon
    // Size: 0x8
    // Offset: 0x110
    ::MagicalActual::InventoryIcon* resetSkinIcon;
    // Field size check
    static_assert(sizeof(::MagicalActual::InventoryIcon*) == 0x8);
    // private UnityEngine.RectTransform scrollableContent
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::RectTransform* scrollableContent;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private UnityEngine.Canvas uiCanvas
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Canvas* uiCanvas;
    // Field size check
    static_assert(sizeof(::UnityEngine::Canvas*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,UnityEngine.Texture2D> OOCFIPOBKML
    // Size: 0x8
    // Offset: 0x128
    ::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Texture2D*>* OOCFIPOBKML;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::UnityEngine::Texture2D*>*) == 0x8);
    // private System.String DNIPJDNKMAM
    // Size: 0x8
    // Offset: 0x130
    ::StringW DNIPJDNKMAM;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String PCALNFLCFJK
    // Size: 0x8
    // Offset: 0x138
    ::StringW PCALNFLCFJK;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String MDAPFBBLIPF
    // Size: 0x8
    // Offset: 0x140
    ::StringW MDAPFBBLIPF;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> EAJJPCFCPLN
    // Size: 0x8
    // Offset: 0x148
    ::System::Collections::Generic::List_1<int>* EAJJPCFCPLN;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private UnityEngine.Coroutine EJIGECDJKLH
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Coroutine* EJIGECDJKLH;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private UnityEngine.Coroutine EDJAFOKJHOI
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Coroutine* EDJAFOKJHOI;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Collections.Generic.List`1<MagicalActual.EquipmentSlotInfo> equipmentSlots
    // Size: 0x8
    // Offset: 0x160
    ::System::Collections::Generic::List_1<::MagicalActual::EquipmentSlotInfo*>* equipmentSlots;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::MagicalActual::EquipmentSlotInfo*>*) == 0x8);
    // private MagicalActual.InventoryIcon JNHIPHEBMIN
    // Size: 0x8
    // Offset: 0x168
    ::MagicalActual::InventoryIcon* JNHIPHEBMIN;
    // Field size check
    static_assert(sizeof(::MagicalActual::InventoryIcon*) == 0x8);
    // private MagicalActual.InventoryIcon NOIMHOMPFCM
    // Size: 0x8
    // Offset: 0x170
    ::MagicalActual::InventoryIcon* NOIMHOMPFCM;
    // Field size check
    static_assert(sizeof(::MagicalActual::InventoryIcon*) == 0x8);
    // private UnityEngine.Coroutine DDCOELDJDHA
    // Size: 0x8
    // Offset: 0x178
    ::UnityEngine::Coroutine* DDCOELDJDHA;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean MGHDPNFNJAH
    // Size: 0x1
    // Offset: 0x180
    bool MGHDPNFNJAH;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean MOMCJKNENHN
    // Size: 0x1
    // Offset: 0x181
    bool MOMCJKNENHN;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean PHJBJNDPDCM
    // Size: 0x1
    // Offset: 0x182
    bool PHJBJNDPDCM;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PHJBJNDPDCM and: JPPKGMONHMP
    char __padding42[0x5] = {};
    // private System.String JPPKGMONHMP
    // Size: 0x8
    // Offset: 0x188
    ::StringW JPPKGMONHMP;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String PKDMJOEBAPP
    // Size: 0x8
    // Offset: 0x190
    ::StringW PKDMJOEBAPP;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private LTDescr LHLEJNPCINP
    // Size: 0x8
    // Offset: 0x198
    ::GlobalNamespace::LTDescr* LHLEJNPCINP;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LTDescr*) == 0x8);
    // private LTDescr OHDEOKDIJHH
    // Size: 0x8
    // Offset: 0x1A0
    ::GlobalNamespace::LTDescr* OHDEOKDIJHH;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LTDescr*) == 0x8);
    // private System.String OACEOBJHIGK
    // Size: 0x8
    // Offset: 0x1A8
    ::StringW OACEOBJHIGK;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String JNPKEBIEONG
    // Size: 0x8
    // Offset: 0x1B0
    ::StringW JNPKEBIEONG;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String KKEICCNIHNK
    // Size: 0x8
    // Offset: 0x1B8
    ::StringW KKEICCNIHNK;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String OKAGNFDHOEI
    // Size: 0x8
    // Offset: 0x1C0
    ::StringW OKAGNFDHOEI;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single DOGIBEBLBKB
    static constexpr const float DOGIBEBLBKB = 81.2;
    // Get static field: static private System.Single DOGIBEBLBKB
    static float _get_DOGIBEBLBKB();
    // Set static field: static private System.Single DOGIBEBLBKB
    static void _set_DOGIBEBLBKB(float value);
    // static field const value: static private System.Single MODOJFHNNLN
    static constexpr const float MODOJFHNNLN = 80.85;
    // Get static field: static private System.Single MODOJFHNNLN
    static float _get_MODOJFHNNLN();
    // Set static field: static private System.Single MODOJFHNNLN
    static void _set_MODOJFHNNLN(float value);
