// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Missions
  class Missions;
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: Mission
  class Mission;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
  // Forward declaring type: ArrayList
  class ArrayList;
}
// Completed forward declares
// Type namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Vendor
  class Vendor;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::MagicalActual::Vendor);
DEFINE_IL2CPP_ARG_TYPE(::MagicalActual::Vendor*, "MagicalActual", "Vendor");
// Type namespace: MagicalActual
namespace MagicalActual {
  // Size: 0xB2
  #pragma pack(push, 1)
  // Autogenerated type: MagicalActual.Vendor
  // [TokenAttribute] Offset: FFFFFFFF
  class Vendor : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::MagicalActual::Vendor::ReputationType
    struct ReputationType;
    // Nested type: ::MagicalActual::Vendor::$doOpenVendorInventory$d__47
    class $doOpenVendorInventory$d__47;
    // Nested type: ::MagicalActual::Vendor::$doUpdateOpenVendorInventory$d__49
    class $doUpdateOpenVendorInventory$d__49;
    // Nested type: ::MagicalActual::Vendor::$$c
    class $$c;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: MagicalActual.Vendor/ReputationType
    // [TokenAttribute] Offset: FFFFFFFF
    struct ReputationType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ReputationType
      constexpr ReputationType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public MagicalActual.Vendor/ReputationType MKNGDNPNIFL
      static constexpr const int MKNGDNPNIFL = 0;
      // Get static field: static public MagicalActual.Vendor/ReputationType MKNGDNPNIFL
      static ::MagicalActual::Vendor::ReputationType _get_MKNGDNPNIFL();
      // Set static field: static public MagicalActual.Vendor/ReputationType MKNGDNPNIFL
      static void _set_MKNGDNPNIFL(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType MFCDNJMIALF
      static constexpr const int MFCDNJMIALF = 1;
      // Get static field: static public MagicalActual.Vendor/ReputationType MFCDNJMIALF
      static ::MagicalActual::Vendor::ReputationType _get_MFCDNJMIALF();
      // Set static field: static public MagicalActual.Vendor/ReputationType MFCDNJMIALF
      static void _set_MFCDNJMIALF(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType BJMBLAMGJLO
      static constexpr const int BJMBLAMGJLO = 2;
      // Get static field: static public MagicalActual.Vendor/ReputationType BJMBLAMGJLO
      static ::MagicalActual::Vendor::ReputationType _get_BJMBLAMGJLO();
      // Set static field: static public MagicalActual.Vendor/ReputationType BJMBLAMGJLO
      static void _set_BJMBLAMGJLO(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType KPDICMGMJPO
      static constexpr const int KPDICMGMJPO = 3;
      // Get static field: static public MagicalActual.Vendor/ReputationType KPDICMGMJPO
      static ::MagicalActual::Vendor::ReputationType _get_KPDICMGMJPO();
      // Set static field: static public MagicalActual.Vendor/ReputationType KPDICMGMJPO
      static void _set_KPDICMGMJPO(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType AAJMDDNICFH
      static constexpr const int AAJMDDNICFH = 4;
      // Get static field: static public MagicalActual.Vendor/ReputationType AAJMDDNICFH
      static ::MagicalActual::Vendor::ReputationType _get_AAJMDDNICFH();
      // Set static field: static public MagicalActual.Vendor/ReputationType AAJMDDNICFH
      static void _set_AAJMDDNICFH(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType KNAFKKFBGOH
      static constexpr const int KNAFKKFBGOH = 5;
      // Get static field: static public MagicalActual.Vendor/ReputationType KNAFKKFBGOH
      static ::MagicalActual::Vendor::ReputationType _get_KNAFKKFBGOH();
      // Set static field: static public MagicalActual.Vendor/ReputationType KNAFKKFBGOH
      static void _set_KNAFKKFBGOH(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType EFGGDPOIELF
      static constexpr const int EFGGDPOIELF = 6;
      // Get static field: static public MagicalActual.Vendor/ReputationType EFGGDPOIELF
      static ::MagicalActual::Vendor::ReputationType _get_EFGGDPOIELF();
      // Set static field: static public MagicalActual.Vendor/ReputationType EFGGDPOIELF
      static void _set_EFGGDPOIELF(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType ICEDFHJJDAO
      static constexpr const int ICEDFHJJDAO = 7;
      // Get static field: static public MagicalActual.Vendor/ReputationType ICEDFHJJDAO
      static ::MagicalActual::Vendor::ReputationType _get_ICEDFHJJDAO();
      // Set static field: static public MagicalActual.Vendor/ReputationType ICEDFHJJDAO
      static void _set_ICEDFHJJDAO(::MagicalActual::Vendor::ReputationType value);
      // static field const value: static public MagicalActual.Vendor/ReputationType AHJKPKLPHJF
      static constexpr const int AHJKPKLPHJF = 8;
      // Get static field: static public MagicalActual.Vendor/ReputationType AHJKPKLPHJF
      static ::MagicalActual::Vendor::ReputationType _get_AHJKPKLPHJF();
      // Set static field: static public MagicalActual.Vendor/ReputationType AHJKPKLPHJF
      static void _set_AHJKPKLPHJF(::MagicalActual::Vendor::ReputationType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // MagicalActual.Vendor/ReputationType
    #pragma pack(pop)
    static check_size<sizeof(Vendor::ReputationType), 0 + sizeof(int)> __MagicalActual_Vendor_ReputationTypeSizeCheck;
    static_assert(sizeof(Vendor::ReputationType) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0xAE58E0
    // public MagicalActual.Vendor/ReputationType RepType
    // Size: 0x4
    // Offset: 0x18
    ::MagicalActual::Vendor::ReputationType RepType;
    // Field size check
    static_assert(sizeof(::MagicalActual::Vendor::ReputationType) == 0x4);
    // [TooltipAttribute] Offset: 0xAE5918
    // public System.Int32 numMissions
    // Size: 0x4
    // Offset: 0x1C
    int numMissions;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String dialogPeek
    // Size: 0x8
    // Offset: 0x20
    ::StringW dialogPeek;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Int32 DCBCIGNELLI
    // Size: 0x4
    // Offset: 0x28
    int DCBCIGNELLI;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 GMHAIFNFFIO
    // Size: 0x4
    // Offset: 0x2C
    int GMHAIFNFFIO;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private MagicalActual.Missions LNIGGBMJFEH
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::Missions* LNIGGBMJFEH;
    // Field size check
    static_assert(sizeof(::MagicalActual::Missions*) == 0x8);
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x38
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean offersRepair
    // Size: 0x1
    // Offset: 0x40
    bool offersRepair;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean buysItems
    // Size: 0x1
    // Offset: 0x41
    bool buysItems;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean infusesItems
    // Size: 0x1
    // Offset: 0x42
    bool infusesItems;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: infusesItems and: currencyItemId
    char __padding9[0x5] = {};
    // public System.String[] currencyItemId
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::StringW> currencyItemId;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String[] currencyItemIcon
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::StringW> currencyItemIcon;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Int32[] GOBOCELAKFL
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<int> GOBOCELAKFL;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private MagicalActual.NetEntity IJJGNKLFGJN
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::NetEntity* IJJGNKLFGJN;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5950
    // private ExtUI.InventoryItemInstance[] <PBOPBMCGMNP>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::ExtUI::InventoryItemInstance*> PBOPBMCGMNP;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5960
    // private System.Int32[] <GBHHAGAIBKJ>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<int> GBHHAGAIBKJ;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5970
    // private System.Int32[] <NIAHELPPFDF>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<int> NIAHELPPFDF;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5980
    // private System.String[] <CJGIGOJPOCP>k__BackingField
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::StringW> CJGIGOJPOCP;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE5990
    // private System.UInt16 <HHBPELGEDMB>k__BackingField
    // Size: 0x2
    // Offset: 0x88
    uint16_t HHBPELGEDMB;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: HHBPELGEDMB and: inventory
    char __padding18[0x6] = {};
    // public System.String inventory
    // Size: 0x8
    // Offset: 0x90
    ::StringW inventory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String prices
    // Size: 0x8
    // Offset: 0x98
    ::StringW prices;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String repLevelRequirements
    // Size: 0x8
    // Offset: 0xA0
    ::StringW repLevelRequirements;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String achievementRequirements
    // Size: 0x8
    // Offset: 0xA8
    ::StringW achievementRequirements;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean pricesNeedUpdate
    // Size: 0x1
    // Offset: 0xB0
    bool pricesNeedUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean HELEHMONNAD
    // Size: 0x1
    // Offset: 0xB1
    bool HELEHMONNAD;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public MagicalActual.Vendor/ReputationType RepType
    [[deprecated("Use field access instead!")]] ::MagicalActual::Vendor::ReputationType& dyn_RepType();
    // Get instance field reference: public System.Int32 numMissions
    [[deprecated("Use field access instead!")]] int& dyn_numMissions();
    // Get instance field reference: public System.String dialogPeek
    [[deprecated("Use field access instead!")]] ::StringW& dyn_dialogPeek();
    // Get instance field reference: private System.Int32 DCBCIGNELLI
    [[deprecated("Use field access instead!")]] int& dyn_DCBCIGNELLI();
    // Get instance field reference: private System.Int32 GMHAIFNFFIO
