// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: FMODUnity.FMODPlatform
#include "FMODUnity/FMODPlatform.hpp"
// Including type: FMOD.Studio.System
#include "FMOD/Studio/System.hpp"
// Including type: FMOD.System
#include "FMOD/System.hpp"
// Including type: FMOD.DSP
#include "FMOD/DSP.hpp"
// Including type: System.Guid
#include "System/Guid.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: FMODUnity
namespace FMODUnity {
  // Forward declaring type: SystemNotInitializedException
  class SystemNotInitializedException;
  // Skipping declaration: LoadedBank because it is already included!
  // Forward declaring type: Settings
  class Settings;
}
// Forward declaring namespace: FMOD
namespace FMOD {
  // Forward declaring type: RESULT
  struct RESULT;
  // Forward declaring type: DEBUG_FLAGS
  struct DEBUG_FLAGS;
  // Forward declaring type: StringWrapper
  struct StringWrapper;
}
// Forward declaring namespace: FMOD::Studio
namespace FMOD::Studio {
  // Skipping declaration: EventInstance because it is already included!
  // Skipping declaration: Bus because it is already included!
  // Skipping declaration: VCA because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: Rigidbody2D
  class Rigidbody2D;
  // Forward declaring type: TextAsset
  class TextAsset;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: FMODUnity
namespace FMODUnity {
  // Forward declaring type: RuntimeManager
  class RuntimeManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::FMODUnity::RuntimeManager);
DEFINE_IL2CPP_ARG_TYPE(::FMODUnity::RuntimeManager*, "FMODUnity", "RuntimeManager");
// Type namespace: FMODUnity
namespace FMODUnity {
  // Size: 0x74
  #pragma pack(push, 1)
  // Autogenerated type: FMODUnity.RuntimeManager
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: AC2084
  class RuntimeManager : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::FMODUnity::RuntimeManager::LoadedBank
    struct LoadedBank;
    // Nested type: ::FMODUnity::RuntimeManager::GuidComparer
    class GuidComparer;
    // Nested type: ::FMODUnity::RuntimeManager::AttachedInstance
    class AttachedInstance;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: FMODUnity.RuntimeManager/LoadedBank
    // [TokenAttribute] Offset: FFFFFFFF
    struct LoadedBank/*, public ::System::ValueType*/ {
      public:
      public:
      // public FMOD.Studio.Bank Bank
      // Size: 0x8
      // Offset: 0x0
      ::FMOD::Studio::Bank Bank;
      // Field size check
      static_assert(sizeof(::FMOD::Studio::Bank) == 0x8);
      // public System.Int32 RefCount
      // Size: 0x4
      // Offset: 0x8
      int RefCount;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LoadedBank
      constexpr LoadedBank(::FMOD::Studio::Bank Bank_ = {}, int RefCount_ = {}) noexcept : Bank{Bank_}, RefCount{RefCount_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public FMOD.Studio.Bank Bank
      [[deprecated("Use field access instead!")]] ::FMOD::Studio::Bank& dyn_Bank();
      // Get instance field reference: public System.Int32 RefCount
      [[deprecated("Use field access instead!")]] int& dyn_RefCount();
    }; // FMODUnity.RuntimeManager/LoadedBank
    #pragma pack(pop)
    static check_size<sizeof(RuntimeManager::LoadedBank), 8 + sizeof(int)> __FMODUnity_RuntimeManager_LoadedBankSizeCheck;
    static_assert(sizeof(RuntimeManager::LoadedBank) == 0xC);
    public:
    // private FMODUnity.FMODPlatform fmodPlatform
    // Size: 0x4
    // Offset: 0x18
    ::FMODUnity::FMODPlatform fmodPlatform;
    // Field size check
    static_assert(sizeof(::FMODUnity::FMODPlatform) == 0x4);
    // Padding between fields: fmodPlatform and: studioSystem
    char __padding0[0x4] = {};
    // private FMOD.Studio.System studioSystem
    // Size: 0x8
    // Offset: 0x20
    ::FMOD::Studio::System studioSystem;
    // Field size check
    static_assert(sizeof(::FMOD::Studio::System) == 0x8);
    // private FMOD.System lowlevelSystem
    // Size: 0x8
    // Offset: 0x28
    ::FMOD::System lowlevelSystem;
    // Field size check
    static_assert(sizeof(::FMOD::System) == 0x8);
    // private FMOD.DSP mixerHead
    // Size: 0x8
    // Offset: 0x30
    ::FMOD::DSP mixerHead;
    // Field size check
    static_assert(sizeof(::FMOD::DSP) == 0x8);
    // private System.Int64[] cachedPointers
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<int64_t> cachedPointers;
    // Field size check
    static_assert(sizeof(::ArrayW<int64_t>) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,FMODUnity.RuntimeManager/LoadedBank> loadedBanks
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::Dictionary_2<::StringW, ::FMODUnity::RuntimeManager::LoadedBank>* loadedBanks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::FMODUnity::RuntimeManager::LoadedBank>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.String,System.UInt32> loadedPlugins
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::Dictionary_2<::StringW, uint>* loadedPlugins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, uint>*) == 0x8);
    // private System.Collections.Generic.Dictionary`2<System.Guid,FMOD.Studio.EventDescription> cachedDescriptions
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Dictionary_2<::System::Guid, ::FMOD::Studio::EventDescription>* cachedDescriptions;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::System::Guid, ::FMOD::Studio::EventDescription>*) == 0x8);
    // private System.Collections.Generic.List`1<FMODUnity.RuntimeManager/AttachedInstance> attachedInstances
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::FMODUnity::RuntimeManager::AttachedInstance*>* attachedInstances;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::RuntimeManager::AttachedInstance*>*) == 0x8);
    // private System.Boolean listenerWarningIssued
    // Size: 0x1
    // Offset: 0x60
    bool listenerWarningIssued;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: listenerWarningIssued and: lastDebugText
    char __padding9[0x7] = {};
    // private System.String lastDebugText
    // Size: 0x8
    // Offset: 0x68
    ::StringW lastDebugText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Single lastDebugUpdate
    // Size: 0x4
    // Offset: 0x70
    float lastDebugUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private FMODUnity.SystemNotInitializedException initException
    static ::FMODUnity::SystemNotInitializedException* _get_initException();
    // Set static field: static private FMODUnity.SystemNotInitializedException initException
    static void _set_initException(::FMODUnity::SystemNotInitializedException* value);
    // Get static field: static private FMODUnity.RuntimeManager instance
    static ::FMODUnity::RuntimeManager* _get_instance();
    // Set static field: static private FMODUnity.RuntimeManager instance
    static void _set_instance(::FMODUnity::RuntimeManager* value);
    // Get static field: static private System.Boolean isQuitting
    static bool _get_isQuitting();
