// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
// Including type: FMODUnity.ImportType
#include "FMODUnity/ImportType.hpp"
// Including type: FMOD.DEBUG_FLAGS
#include "FMOD/DEBUG_FLAGS.hpp"
// Including type: FMODUnity.FMODPlatform
#include "FMODUnity/FMODPlatform.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: FMODUnity
namespace FMODUnity {
  // Forward declaring type: PlatformIntSetting
  class PlatformIntSetting;
  // Forward declaring type: PlatformBoolSetting
  class PlatformBoolSetting;
  // Forward declaring type: PlatformStringSetting
  class PlatformStringSetting;
  // Forward declaring type: PlatformSetting`1<T>
  template<typename T>
  class PlatformSetting_1;
  // Forward declaring type: PlatformSettingBase
  class PlatformSettingBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: FMODUnity
namespace FMODUnity {
  // Forward declaring type: Settings
  class Settings;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::FMODUnity::Settings);
DEFINE_IL2CPP_ARG_TYPE(::FMODUnity::Settings*, "FMODUnity", "Settings");
// Type namespace: FMODUnity
namespace FMODUnity {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: FMODUnity.Settings
  // [TokenAttribute] Offset: FFFFFFFF
  class Settings : public ::UnityEngine::ScriptableObject {
    public:
    // Nested type: ::FMODUnity::Settings::$$c__DisplayClass33_0_1<T>
    template<typename T>
    class $$c__DisplayClass33_0_1;
    // Nested type: ::FMODUnity::Settings::$$c__DisplayClass34_0_2<T, U>
    template<typename T, typename U>
    class $$c__DisplayClass34_0_2;
    // Nested type: ::FMODUnity::Settings::$$c__DisplayClass35_0_2<T, U>
    template<typename T, typename U>
    class $$c__DisplayClass35_0_2;
    // Nested type: ::FMODUnity::Settings::$$c__DisplayClass36_0_1<T>
    template<typename T>
    class $$c__DisplayClass36_0_1;
    public:
    // public System.Boolean HasSourceProject
    // Size: 0x1
    // Offset: 0x18
    bool HasSourceProject;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean HasPlatforms
    // Size: 0x1
    // Offset: 0x19
    bool HasPlatforms;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: HasPlatforms and: sourceProjectPath
    char __padding1[0x6] = {};
    // private System.String sourceProjectPath
    // Size: 0x8
    // Offset: 0x20
    ::StringW sourceProjectPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SourceProjectPathUnformatted
    // Size: 0x8
    // Offset: 0x28
    ::StringW SourceProjectPathUnformatted;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String sourceBankPath
    // Size: 0x8
    // Offset: 0x30
    ::StringW sourceBankPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String SourceBankPathUnformatted
    // Size: 0x8
    // Offset: 0x38
    ::StringW SourceBankPathUnformatted;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean AutomaticEventLoading
    // Size: 0x1
    // Offset: 0x40
    bool AutomaticEventLoading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AutomaticSampleLoading
    // Size: 0x1
    // Offset: 0x41
    bool AutomaticSampleLoading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AutomaticSampleLoading and: ImportType
    char __padding7[0x2] = {};
    // public FMODUnity.ImportType ImportType
    // Size: 0x4
    // Offset: 0x44
    ::FMODUnity::ImportType ImportType;
    // Field size check
    static_assert(sizeof(::FMODUnity::ImportType) == 0x4);
    // public System.String TargetAssetPath
    // Size: 0x8
    // Offset: 0x48
    ::StringW TargetAssetPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public FMOD.DEBUG_FLAGS LoggingLevel
    // Size: 0x4
    // Offset: 0x50
    ::FMOD::DEBUG_FLAGS LoggingLevel;
    // Field size check
    static_assert(sizeof(::FMOD::DEBUG_FLAGS) == 0x4);
    // Padding between fields: LoggingLevel and: SpeakerModeSettings
    char __padding10[0x4] = {};
    // public System.Collections.Generic.List`1<FMODUnity.PlatformIntSetting> SpeakerModeSettings
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>* SpeakerModeSettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformIntSetting> SampleRateSettings
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>* SampleRateSettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformBoolSetting> LiveUpdateSettings
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformBoolSetting*>* LiveUpdateSettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformBoolSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformBoolSetting> OverlaySettings
    // Size: 0x8
    // Offset: 0x70
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformBoolSetting*>* OverlaySettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformBoolSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformBoolSetting> LoggingSettings
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformBoolSetting*>* LoggingSettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformBoolSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformStringSetting> BankDirectorySettings
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformStringSetting*>* BankDirectorySettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformStringSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformIntSetting> VirtualChannelSettings
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>* VirtualChannelSettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<FMODUnity.PlatformIntSetting> RealChannelSettings
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>* RealChannelSettings;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::FMODUnity::PlatformIntSetting*>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> Plugins
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::StringW>* Plugins;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> MasterBanks
    // Size: 0x8
    // Offset: 0xA0
    ::System::Collections::Generic::List_1<::StringW>* MasterBanks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> Banks
    // Size: 0x8
    // Offset: 0xA8
    ::System::Collections::Generic::List_1<::StringW>* Banks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.String SettingsAssetName
    static constexpr const char* SettingsAssetName = "FMODStudioSettings";
    // Get static field: static private System.String SettingsAssetName
    static ::StringW _get_SettingsAssetName();
    // Set static field: static private System.String SettingsAssetName
    static void _set_SettingsAssetName(::StringW value);
    // Get static field: static private FMODUnity.Settings instance
    static ::FMODUnity::Settings* _get_instance();
    // Set static field: static private FMODUnity.Settings instance
    static void _set_instance(::FMODUnity::Settings* value);
