// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VivoxUnity.Private.AudioInputDevices
#include "VivoxUnity/Private/AudioInputDevices.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VivoxUnity
namespace VivoxUnity {
  // Forward declaring type: IAudioDevice
  class IAudioDevice;
  // Forward declaring type: AsyncNoResult
  class AsyncNoResult;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: vx_req_aux_set_capture_device_t
  class vx_req_aux_set_capture_device_t;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0);
DEFINE_IL2CPP_ARG_TYPE(::VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0*, "VivoxUnity.Private", "AudioInputDevices/<>c__DisplayClass23_0");
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: VivoxUnity.Private.AudioInputDevices/<>c__DisplayClass23_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: ABD7C8
  class AudioInputDevices::$$c__DisplayClass23_0 : public ::Il2CppObject {
    public:
    public:
    // public VivoxUnity.Private.AudioInputDevices <>4__this
    // Size: 0x8
    // Offset: 0x10
    ::VivoxUnity::Private::AudioInputDevices* $$4__this;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::AudioInputDevices*) == 0x8);
    // public VivoxUnity.IAudioDevice device
    // Size: 0x8
    // Offset: 0x18
    ::VivoxUnity::IAudioDevice* device;
    // Field size check
    static_assert(sizeof(::VivoxUnity::IAudioDevice*) == 0x8);
    // public VivoxUnity.AsyncNoResult result
    // Size: 0x8
    // Offset: 0x20
    ::VivoxUnity::AsyncNoResult* result;
    // Field size check
    static_assert(sizeof(::VivoxUnity::AsyncNoResult*) == 0x8);
    // public vx_req_aux_set_capture_device_t request
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::vx_req_aux_set_capture_device_t* request;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::vx_req_aux_set_capture_device_t*) == 0x8);
    public:
    // Get instance field reference: public VivoxUnity.Private.AudioInputDevices <>4__this
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Private::AudioInputDevices*& dyn_$$4__this();
    // Get instance field reference: public VivoxUnity.IAudioDevice device
    [[deprecated("Use field access instead!")]] ::VivoxUnity::IAudioDevice*& dyn_device();
    // Get instance field reference: public VivoxUnity.AsyncNoResult result
    [[deprecated("Use field access instead!")]] ::VivoxUnity::AsyncNoResult*& dyn_result();
    // Get instance field reference: public vx_req_aux_set_capture_device_t request
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::vx_req_aux_set_capture_device_t*& dyn_request();
    // public System.Void .ctor()
    // Offset: 0x14BAA78
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AudioInputDevices::$$c__DisplayClass23_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AudioInputDevices::$$c__DisplayClass23_0*, creationType>()));
    }
    // System.Void <BeginSetActiveDevice>b__0(System.IAsyncResult ar)
    // Offset: 0x14BB340
    void $BeginSetActiveDevice$b__0(::System::IAsyncResult* ar);
  }; // VivoxUnity.Private.AudioInputDevices/<>c__DisplayClass23_0
  #pragma pack(pop)
  static check_size<sizeof(AudioInputDevices::$$c__DisplayClass23_0), 40 + sizeof(::GlobalNamespace::vx_req_aux_set_capture_device_t*)> __VivoxUnity_Private_AudioInputDevices_$$c__DisplayClass23_0SizeCheck;
  static_assert(sizeof(AudioInputDevices::$$c__DisplayClass23_0) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0::$BeginSetActiveDevice$b__0
// Il2CppName: <BeginSetActiveDevice>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0::*)(::System::IAsyncResult*)>(&VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0::$BeginSetActiveDevice$b__0)> {
  static const MethodInfo* get() {
    static auto* ar = &::il2cpp_utils::GetClassFromName("System", "IAsyncResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VivoxUnity::Private::AudioInputDevices::$$c__DisplayClass23_0*), "<BeginSetActiveDevice>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ar});
  }
};
