// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VivoxUnity.IParticipant
#include "VivoxUnity/IParticipant.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VivoxUnity::Private
namespace VivoxUnity::Private {
  // Forward declaring type: ChannelSession
  class ChannelSession;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyChangedEventHandler
  class PropertyChangedEventHandler;
}
// Forward declaring namespace: VivoxUnity
namespace VivoxUnity {
  // Forward declaring type: AccountId
  class AccountId;
  // Forward declaring type: IChannelSession
  class IChannelSession;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: vx_evt_participant_added_t
  class vx_evt_participant_added_t;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
}
// Completed forward declares
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Forward declaring type: ChannelParticipant
  class ChannelParticipant;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VivoxUnity::Private::ChannelParticipant);
DEFINE_IL2CPP_ARG_TYPE(::VivoxUnity::Private::ChannelParticipant*, "VivoxUnity.Private", "ChannelParticipant");
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: VivoxUnity.Private.ChannelParticipant
  // [TokenAttribute] Offset: FFFFFFFF
  class ChannelParticipant : public ::Il2CppObject/*, public ::VivoxUnity::IParticipant*/ {
    public:
    // Nested type: ::VivoxUnity::Private::ChannelParticipant::$$c__DisplayClass24_0
    class $$c__DisplayClass24_0;
    // Nested type: ::VivoxUnity::Private::ChannelParticipant::$$c__DisplayClass39_0
    class $$c__DisplayClass39_0;
    // Nested type: ::VivoxUnity::Private::ChannelParticipant::$$c__DisplayClass39_1
    class $$c__DisplayClass39_1;
    // Nested type: ::VivoxUnity::Private::ChannelParticipant::$$c__DisplayClass42_0
    class $$c__DisplayClass42_0;
    public:
    // private readonly VivoxUnity.Private.ChannelSession _parent
    // Size: 0x8
    // Offset: 0x10
    ::VivoxUnity::Private::ChannelSession* parent;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::ChannelSession*) == 0x8);
    // private System.Boolean _speechDetected
    // Size: 0x1
    // Offset: 0x18
    bool speechDetected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isTyping
    // Size: 0x1
    // Offset: 0x19
    bool isTyping;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _textActive
    // Size: 0x1
    // Offset: 0x1A
    bool textActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _audioActive
    // Size: 0x1
    // Offset: 0x1B
    bool audioActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: audioActive and: audioEnergy
    char __padding4[0x4] = {};
    // private System.Double _audioEnergy
    // Size: 0x8
    // Offset: 0x20
    double audioEnergy;
    // Field size check
    static_assert(sizeof(double) == 0x8);
    // private System.Boolean _isMutedForEveryone
    // Size: 0x1
    // Offset: 0x28
    bool isMutedForEveryone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _localMute
    // Size: 0x1
    // Offset: 0x29
    bool localMute;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: localMute and: localVolumeAdjustment
    char __padding7[0x2] = {};
    // private System.Int32 _localVolumeAdjustment
    // Size: 0x4
    // Offset: 0x2C
    int localVolumeAdjustment;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xABDFD8
    // private System.ComponentModel.PropertyChangedEventHandler PropertyChanged
    // Size: 0x8
    // Offset: 0x30
    ::System::ComponentModel::PropertyChangedEventHandler* PropertyChanged;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::PropertyChangedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABDFE8
    // private readonly System.Boolean <IsSelf>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool IsSelf;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: IsSelf and: Account
    char __padding10[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xABDFF8
    // private readonly VivoxUnity.AccountId <Account>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::VivoxUnity::AccountId* Account;
    // Field size check
    static_assert(sizeof(::VivoxUnity::AccountId*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABE008
    // private readonly System.String <Key>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::StringW Key;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Creating interface conversion operator: operator ::VivoxUnity::IParticipant
    operator ::VivoxUnity::IParticipant() noexcept {
      return *reinterpret_cast<::VivoxUnity::IParticipant*>(this);
    }
    // Get instance field reference: private readonly VivoxUnity.Private.ChannelSession _parent
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Private::ChannelSession*& dyn__parent();
    // Get instance field reference: private System.Boolean _speechDetected
    [[deprecated("Use field access instead!")]] bool& dyn__speechDetected();
    // Get instance field reference: private System.Boolean _isTyping
    [[deprecated("Use field access instead!")]] bool& dyn__isTyping();
    // Get instance field reference: private System.Boolean _textActive
    [[deprecated("Use field access instead!")]] bool& dyn__textActive();
