// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VivoxUnity.IChannelSession
#include "VivoxUnity/IChannelSession.hpp"
// Including type: VivoxUnity.ConnectionState
#include "VivoxUnity/ConnectionState.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VivoxUnity::Private
namespace VivoxUnity::Private {
  // Forward declaring type: LoginSession
  class LoginSession;
  // Forward declaring type: ChannelParticipant
  class ChannelParticipant;
  // Forward declaring type: ArchiveQueryResult
  class ArchiveQueryResult;
}
// Forward declaring namespace: VivoxUnity::Common
namespace VivoxUnity::Common {
  // Forward declaring type: ReadWriteDictionary`3<TK, TI, T>
  template<typename TK, typename TI, typename T>
  class ReadWriteDictionary_3;
  // Forward declaring type: ReadWriteQueue`1<T>
  template<typename T>
  class ReadWriteQueue_1;
}
// Forward declaring namespace: VivoxUnity
namespace VivoxUnity {
  // Forward declaring type: IParticipant
  class IParticipant;
  // Forward declaring type: IChannelTextMessage
  class IChannelTextMessage;
  // Forward declaring type: ISessionArchiveMessage
  class ISessionArchiveMessage;
  // Forward declaring type: ITranscribedMessage
  class ITranscribedMessage;
  // Forward declaring type: ChannelId
  class ChannelId;
  // Forward declaring type: ILoginSession
  class ILoginSession;
  // Forward declaring type: IReadOnlyDictionary`2<TK, T>
  template<typename TK, typename T>
  class IReadOnlyDictionary_2;
  // Forward declaring type: IReadOnlyQueue`1<T>
  template<typename T>
  class IReadOnlyQueue_1;
  // Forward declaring type: AccountId
  class AccountId;
  // Forward declaring type: IArchiveQueryResult
  class IArchiveQueryResult;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyChangedEventHandler
  class PropertyChangedEventHandler;
  // Forward declaring type: PropertyChangedEventArgs
  class PropertyChangedEventArgs;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: vx_evt_base_t
  class vx_evt_base_t;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Forward declaring type: TimeSpan
  struct TimeSpan;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector3
  struct Vector3;
}
// Completed forward declares
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Forward declaring type: ChannelSession
  class ChannelSession;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VivoxUnity::Private::ChannelSession);
DEFINE_IL2CPP_ARG_TYPE(::VivoxUnity::Private::ChannelSession*, "VivoxUnity.Private", "ChannelSession");
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: VivoxUnity.Private.ChannelSession
  // [TokenAttribute] Offset: FFFFFFFF
  class ChannelSession : public ::Il2CppObject/*, public ::VivoxUnity::IChannelSession*/ {
    public:
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass31_0
    class $$c__DisplayClass31_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass33_0
    class $$c__DisplayClass33_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass33_1
    class $$c__DisplayClass33_1;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass34_0
    class $$c__DisplayClass34_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass34_1
    class $$c__DisplayClass34_1;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass34_2
    class $$c__DisplayClass34_2;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass36_0
    class $$c__DisplayClass36_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass36_1
    class $$c__DisplayClass36_1;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass36_2
    class $$c__DisplayClass36_2;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass58_0
    class $$c__DisplayClass58_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass58_1
    class $$c__DisplayClass58_1;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass60_0
    class $$c__DisplayClass60_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass66_0
    class $$c__DisplayClass66_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass77_0
    class $$c__DisplayClass77_0;
    // Nested type: ::VivoxUnity::Private::ChannelSession::$$c__DisplayClass82_0
    class $$c__DisplayClass82_0;
    public:
    // private readonly VivoxUnity.Private.LoginSession _loginSession
    // Size: 0x8
    // Offset: 0x10
    ::VivoxUnity::Private::LoginSession* loginSession;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::LoginSession*) == 0x8);
    // private readonly System.String _sessionHandle
    // Size: 0x8
    // Offset: 0x18
    ::StringW sessionHandle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _typing
    // Size: 0x1
    // Offset: 0x20
    bool typing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _isSessionBeingTranscribed
    // Size: 0x1
    // Offset: 0x21
    bool isSessionBeingTranscribed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isSessionBeingTranscribed and: participants
    char __padding3[0x6] = {};
    // private readonly VivoxUnity.Common.ReadWriteDictionary`3<System.String,VivoxUnity.IParticipant,VivoxUnity.Private.ChannelParticipant> _participants
    // Size: 0x8
    // Offset: 0x28
    ::VivoxUnity::Common::ReadWriteDictionary_3<::StringW, ::VivoxUnity::IParticipant*, ::VivoxUnity::Private::ChannelParticipant*>* participants;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteDictionary_3<::StringW, ::VivoxUnity::IParticipant*, ::VivoxUnity::Private::ChannelParticipant*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.IChannelTextMessage> _messageLog
    // Size: 0x8
    // Offset: 0x30
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IChannelTextMessage*>* messageLog;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IChannelTextMessage*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.ISessionArchiveMessage> _sessionArchive
    // Size: 0x8
    // Offset: 0x38
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::ISessionArchiveMessage*>* sessionArchive;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::ISessionArchiveMessage*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.ITranscribedMessage> _transcribedLog
    // Size: 0x8
    // Offset: 0x40
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::ITranscribedMessage*>* transcribedLog;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::ITranscribedMessage*>*) == 0x8);
    // private VivoxUnity.Private.ArchiveQueryResult _sessionArchiveResult
    // Size: 0x8
    // Offset: 0x48
    ::VivoxUnity::Private::ArchiveQueryResult* sessionArchiveResult;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::ArchiveQueryResult*) == 0x8);
    // private VivoxUnity.ConnectionState _audioState
    // Size: 0x4
    // Offset: 0x50
    ::VivoxUnity::ConnectionState audioState;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ConnectionState) == 0x4);
    // private VivoxUnity.ConnectionState _textState
    // Size: 0x4
    // Offset: 0x54
    ::VivoxUnity::ConnectionState textState;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ConnectionState) == 0x4);
    // private System.Int32 _nextTextId
    // Size: 0x4
    // Offset: 0x58
    int nextTextId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _nextTranscriptiontId
    // Size: 0x4
    // Offset: 0x5C
    int nextTranscriptiontId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _deleted
    // Size: 0x1
    // Offset: 0x60
    bool deleted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: deleted and: PropertyChanged
    char __padding13[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xABE018
    // private System.ComponentModel.PropertyChangedEventHandler PropertyChanged
    // Size: 0x8
    // Offset: 0x68
    ::System::ComponentModel::PropertyChangedEventHandler* PropertyChanged;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::PropertyChangedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABE028
    // private readonly System.String <GroupId>k__BackingField
    // Size: 0x8
    // Offset: 0x70
    ::StringW GroupId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABE038
    // private readonly VivoxUnity.ChannelId <Key>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::VivoxUnity::ChannelId* Key;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ChannelId*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::VivoxUnity::IChannelSession
    operator ::VivoxUnity::IChannelSession() noexcept {
      return *reinterpret_cast<::VivoxUnity::IChannelSession*>(this);
    }
    // Get instance field reference: private readonly VivoxUnity.Private.LoginSession _loginSession
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Private::LoginSession*& dyn__loginSession();
    // Get instance field reference: private readonly System.String _sessionHandle
    [[deprecated("Use field access instead!")]] ::StringW& dyn__sessionHandle();
    // Get instance field reference: private System.Boolean _typing
    [[deprecated("Use field access instead!")]] bool& dyn__typing();
    // Get instance field reference: private System.Boolean _isSessionBeingTranscribed
