// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VivoxUnity.ILoginSession
#include "VivoxUnity/ILoginSession.hpp"
// Including type: VivoxUnity.LoginState
#include "VivoxUnity/LoginState.hpp"
// Including type: VivoxUnity.TransmissionMode
#include "VivoxUnity/TransmissionMode.hpp"
// Including type: VivoxUnity.Presence
#include "VivoxUnity/Presence.hpp"
// Including type: VivoxUnity.ParticipantPropertyUpdateFrequency
#include "VivoxUnity/ParticipantPropertyUpdateFrequency.hpp"
// Including type: VivoxUnity.SubscriptionMode
#include "VivoxUnity/SubscriptionMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VivoxUnity::Private
namespace VivoxUnity::Private {
  // Forward declaring type: ChannelSession
  class ChannelSession;
  // Forward declaring type: PresenceSubscription
  class PresenceSubscription;
  // Forward declaring type: DirectedMessageResult
  class DirectedMessageResult;

  // Forward declaring type: IReadOnlyDictionary`2<TK, T>
  template<typename TK, typename T>
  class IReadOnlyDictionary_2;
  // Forward declaring type: IReadOnlyQueue`1<T>
  template<typename T>
  class IReadOnlyQueue_1;
  // Forward declaring type: IArchiveQueryResult
  class IArchiveQueryResult;
  // Forward declaring type: IDirectedMessageResult
  class IDirectedMessageResult;
  // Forward declaring type: IReadOnlyHashSet`1<T>
  template<typename T>
  class IReadOnlyHashSet_1;
  // Forward declaring type: AsyncNoResult
  class AsyncNoResult;
}
// Forward declaring namespace: VivoxUnity::Common
namespace VivoxUnity::Common {
  // Forward declaring type: ReadWriteDictionary`3<TK, TI, T>
  template<typename TK, typename TI, typename T>
  class ReadWriteDictionary_3;
  // Forward declaring type: ReadWriteHashSet`1<T>
  template<typename T>
  class ReadWriteHashSet_1;
  // Forward declaring type: ReadWriteQueue`1<T>
  template<typename T>
  class ReadWriteQueue_1;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyChangedEventHandler
  class PropertyChangedEventHandler;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: vx_evt_base_t
  class vx_evt_base_t;
  // Forward declaring type: vx_control_communications_operation
  struct vx_control_communications_operation;
  // Forward declaring type: vx_mute_scope
  struct vx_mute_scope;
  // Forward declaring type: vx_resp_account_control_communications_t
  class vx_resp_account_control_communications_t;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: TimeSpan
  struct TimeSpan;
  // Forward declaring type: Nullable`1<T>
  template<typename T>
  struct Nullable_1;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Forward declaring type: LoginSession
  class LoginSession;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VivoxUnity::Private::LoginSession);
DEFINE_IL2CPP_ARG_TYPE(::VivoxUnity::Private::LoginSession*, "VivoxUnity.Private", "LoginSession");
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Size: 0xD0
  #pragma pack(push, 1)
  // Autogenerated type: VivoxUnity.Private.LoginSession
  // [TokenAttribute] Offset: FFFFFFFF
  class LoginSession : public ::Il2CppObject/*, public ::VivoxUnity::ILoginSession*/ {
    public:
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass70_0
    class $$c__DisplayClass70_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass70_1
    class $$c__DisplayClass70_1;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0
    class $$c__DisplayClass85_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass87_0
    class $$c__DisplayClass87_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass89_0
    class $$c__DisplayClass89_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass93_0
    class $$c__DisplayClass93_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c
    class $$c;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass94_0
    class $$c__DisplayClass94_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass95_0
    class $$c__DisplayClass95_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass97_0
    class $$c__DisplayClass97_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass99_0
    class $$c__DisplayClass99_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass102_0
    class $$c__DisplayClass102_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass104_0
    class $$c__DisplayClass104_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass106_0
    class $$c__DisplayClass106_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass106_1
    class $$c__DisplayClass106_1;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass106_2
    class $$c__DisplayClass106_2;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass108_0
    class $$c__DisplayClass108_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0
    class $$c__DisplayClass110_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass112_0
    class $$c__DisplayClass112_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass114_0
    class $$c__DisplayClass114_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass115_0
    class $$c__DisplayClass115_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass116_0
    class $$c__DisplayClass116_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass117_0
    class $$c__DisplayClass117_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass125_0
    class $$c__DisplayClass125_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass126_0
    class $$c__DisplayClass126_0;
    // Nested type: ::VivoxUnity::Private::LoginSession::$$c__DisplayClass127_0
    class $$c__DisplayClass127_0;
    public:
    // private readonly System.String _accountHandle
    // Size: 0x8
    // Offset: 0x10
    ::StringW accountHandle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly System.String _groupHandle
    // Size: 0x8
    // Offset: 0x18
    ::StringW groupHandle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private readonly VivoxUnity.Client _client
    // Size: 0x8
    // Offset: 0x20
    ::VivoxUnity::Client* client;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Client*) == 0x8);
    // private VivoxUnity.LoginState _state
    // Size: 0x4
    // Offset: 0x28
    ::VivoxUnity::LoginState state;
    // Field size check
    static_assert(sizeof(::VivoxUnity::LoginState) == 0x4);
    // private VivoxUnity.TransmissionMode _transmissionType
    // Size: 0x4
    // Offset: 0x2C
    ::VivoxUnity::TransmissionMode transmissionType;
    // Field size check
    static_assert(sizeof(::VivoxUnity::TransmissionMode) == 0x4);
    // private System.Boolean _isInjectingAudio
    // Size: 0x1
    // Offset: 0x30
    bool isInjectingAudio;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isInjectingAudio and: channelSessions
    char __padding5[0x7] = {};
    // private readonly VivoxUnity.Common.ReadWriteDictionary`3<VivoxUnity.ChannelId,VivoxUnity.IChannelSession,VivoxUnity.Private.ChannelSession> _channelSessions
    // Size: 0x8
    // Offset: 0x38
    ::VivoxUnity::Common::ReadWriteDictionary_3<::VivoxUnity::ChannelId*, ::VivoxUnity::IChannelSession*, ::VivoxUnity::Private::ChannelSession*>* channelSessions;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteDictionary_3<::VivoxUnity::ChannelId*, ::VivoxUnity::IChannelSession*, ::VivoxUnity::Private::ChannelSession*>*) == 0x8);
    // private VivoxUnity.ChannelId _transmittingChannel
    // Size: 0x8
    // Offset: 0x40
    ::VivoxUnity::ChannelId* transmittingChannel;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ChannelId*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteHashSet`1<VivoxUnity.AccountId> _blockedSubscriptions
    // Size: 0x8
    // Offset: 0x48
    ::VivoxUnity::Common::ReadWriteHashSet_1<::VivoxUnity::AccountId*>* blockedSubscriptions;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteHashSet_1<::VivoxUnity::AccountId*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteHashSet`1<VivoxUnity.AccountId> _allowedSubscriptions
    // Size: 0x8
    // Offset: 0x50
    ::VivoxUnity::Common::ReadWriteHashSet_1<::VivoxUnity::AccountId*>* allowedSubscriptions;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteHashSet_1<::VivoxUnity::AccountId*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteDictionary`3<VivoxUnity.AccountId,VivoxUnity.IPresenceSubscription,VivoxUnity.Private.PresenceSubscription> _presenceSubscriptions
    // Size: 0x8
    // Offset: 0x58
    ::VivoxUnity::Common::ReadWriteDictionary_3<::VivoxUnity::AccountId*, ::VivoxUnity::IPresenceSubscription*, ::VivoxUnity::Private::PresenceSubscription*>* presenceSubscriptions;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteDictionary_3<::VivoxUnity::AccountId*, ::VivoxUnity::IPresenceSubscription*, ::VivoxUnity::Private::PresenceSubscription*>*) == 0x8);
    // private VivoxUnity.Presence _presence
    // Size: 0x10
    // Offset: 0x60
    ::VivoxUnity::Presence presence;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Presence) == 0x10);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.IDirectedTextMessage> _directedMessages
    // Size: 0x8
    // Offset: 0x70
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IDirectedTextMessage*>* directedMessages;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IDirectedTextMessage*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.IFailedDirectedTextMessage> _failedDirectedMessages
    // Size: 0x8
    // Offset: 0x78
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IFailedDirectedTextMessage*>* failedDirectedMessages;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IFailedDirectedTextMessage*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.IAccountArchiveMessage> _accountArchive
    // Size: 0x8
    // Offset: 0x80
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IAccountArchiveMessage*>* accountArchive;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::IAccountArchiveMessage*>*) == 0x8);
    // private System.DateTime lastMessageTime
    // Size: 0x8
    // Offset: 0x88
    ::System::DateTime lastMessageTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private VivoxUnity.Private.DirectedMessageResult _directedMessageResult
    // Size: 0x8
    // Offset: 0x90
    ::VivoxUnity::Private::DirectedMessageResult* directedMessageResult;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::DirectedMessageResult*) == 0x8);
    // private VivoxUnity.Private.ArchiveQueryResult _accountArchiveResult
    // Size: 0x8
    // Offset: 0x98
    ::VivoxUnity::Private::ArchiveQueryResult* accountArchiveResult;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::ArchiveQueryResult*) == 0x8);
    // private VivoxUnity.Common.ReadWriteHashSet`1<VivoxUnity.AccountId> _crossMutedCommunications
    // Size: 0x8
    // Offset: 0xA0
    ::VivoxUnity::Common::ReadWriteHashSet_1<::VivoxUnity::AccountId*>* crossMutedCommunications;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteHashSet_1<::VivoxUnity::AccountId*>*) == 0x8);
    // private readonly VivoxUnity.Common.ReadWriteQueue`1<VivoxUnity.AccountId> _incomingSubscriptionRequests
    // Size: 0x8
    // Offset: 0xA8
    ::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::AccountId*>* incomingSubscriptionRequests;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Common::ReadWriteQueue_1<::VivoxUnity::AccountId*>*) == 0x8);
    // private VivoxUnity.ParticipantPropertyUpdateFrequency _participantPropertyFrequency
    // Size: 0x4
    // Offset: 0xB0
    ::VivoxUnity::ParticipantPropertyUpdateFrequency participantPropertyFrequency;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ParticipantPropertyUpdateFrequency) == 0x4);
    // Padding between fields: participantPropertyFrequency and: ttsSubSystem
    char __padding20[0x4] = {};
    // private readonly VivoxUnity.ITextToSpeech _ttsSubSystem
    // Size: 0x8
    // Offset: 0xB8
    ::VivoxUnity::ITextToSpeech* ttsSubSystem;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ITextToSpeech*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABE058
    // private System.ComponentModel.PropertyChangedEventHandler PropertyChanged
    // Size: 0x8
    // Offset: 0xC0
    ::System::ComponentModel::PropertyChangedEventHandler* PropertyChanged;
    // Field size check
    static_assert(sizeof(::System::ComponentModel::PropertyChangedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABE068
    // private readonly VivoxUnity.AccountId <Key>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::VivoxUnity::AccountId* Key;
    // Field size check
    static_assert(sizeof(::VivoxUnity::AccountId*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::VivoxUnity::ILoginSession
    operator ::VivoxUnity::ILoginSession() noexcept {
      return *reinterpret_cast<::VivoxUnity::ILoginSession*>(this);
    }
    // Get instance field reference: private readonly System.String _accountHandle
    [[deprecated("Use field access instead!")]] ::StringW& dyn__accountHandle();
    // Get instance field reference: private readonly System.String _groupHandle
    [[deprecated("Use field access instead!")]] ::StringW& dyn__groupHandle();
    // Get instance field reference: private readonly VivoxUnity.Client _client
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Client*& dyn__client();
    // Get instance field reference: private VivoxUnity.LoginState _state
