// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VivoxUnity.Private.LoginSession
#include "VivoxUnity/Private/LoginSession.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VivoxUnity
namespace VivoxUnity {
  // Forward declaring type: AccountId
  class AccountId;
  // Forward declaring type: AsyncResult`1<T>
  template<typename T>
  class AsyncResult_1;
  // Forward declaring type: IPresenceSubscription
  class IPresenceSubscription;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: vx_req_account_buddy_set_t
  class vx_req_account_buddy_set_t;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: AsyncCallback
  class AsyncCallback;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0);
DEFINE_IL2CPP_ARG_TYPE(::VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0*, "VivoxUnity.Private", "LoginSession/<>c__DisplayClass110_0");
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: VivoxUnity.Private.LoginSession/<>c__DisplayClass110_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: ABDA88
  class LoginSession::$$c__DisplayClass110_0 : public ::Il2CppObject {
    public:
    public:
    // public VivoxUnity.Private.LoginSession <>4__this
    // Size: 0x8
    // Offset: 0x10
    ::VivoxUnity::Private::LoginSession* $$4__this;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::LoginSession*) == 0x8);
    // public VivoxUnity.AccountId userId
    // Size: 0x8
    // Offset: 0x18
    ::VivoxUnity::AccountId* userId;
    // Field size check
    static_assert(sizeof(::VivoxUnity::AccountId*) == 0x8);
    // public VivoxUnity.AsyncResult`1<VivoxUnity.IPresenceSubscription> ar
    // Size: 0x8
    // Offset: 0x20
    ::VivoxUnity::AsyncResult_1<::VivoxUnity::IPresenceSubscription*>* ar;
    // Field size check
    static_assert(sizeof(::VivoxUnity::AsyncResult_1<::VivoxUnity::IPresenceSubscription*>*) == 0x8);
    // public vx_req_account_buddy_set_t request
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::vx_req_account_buddy_set_t* request;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::vx_req_account_buddy_set_t*) == 0x8);
    // public System.AsyncCallback <>9__2
    // Size: 0x8
    // Offset: 0x30
    ::System::AsyncCallback* $$9__2;
    // Field size check
    static_assert(sizeof(::System::AsyncCallback*) == 0x8);
    // public System.AsyncCallback <>9__1
    // Size: 0x8
    // Offset: 0x38
    ::System::AsyncCallback* $$9__1;
    // Field size check
    static_assert(sizeof(::System::AsyncCallback*) == 0x8);
    public:
    // Get instance field reference: public VivoxUnity.Private.LoginSession <>4__this
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Private::LoginSession*& dyn_$$4__this();
    // Get instance field reference: public VivoxUnity.AccountId userId
    [[deprecated("Use field access instead!")]] ::VivoxUnity::AccountId*& dyn_userId();
    // Get instance field reference: public VivoxUnity.AsyncResult`1<VivoxUnity.IPresenceSubscription> ar
    [[deprecated("Use field access instead!")]] ::VivoxUnity::AsyncResult_1<::VivoxUnity::IPresenceSubscription*>*& dyn_ar();
    // Get instance field reference: public vx_req_account_buddy_set_t request
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::vx_req_account_buddy_set_t*& dyn_request();
    // Get instance field reference: public System.AsyncCallback <>9__2
    [[deprecated("Use field access instead!")]] ::System::AsyncCallback*& dyn_$$9__2();
    // Get instance field reference: public System.AsyncCallback <>9__1
    [[deprecated("Use field access instead!")]] ::System::AsyncCallback*& dyn_$$9__1();
    // public System.Void .ctor()
    // Offset: 0x12D1C80
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoginSession::$$c__DisplayClass110_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoginSession::$$c__DisplayClass110_0*, creationType>()));
    }
    // System.Void <BeginAddPresenceSubscription>b__0(System.IAsyncResult result)
    // Offset: 0x12D1C88
    void $BeginAddPresenceSubscription$b__0(::System::IAsyncResult* result);
    // System.Void <BeginAddPresenceSubscription>b__1(System.IAsyncResult ar2)
    // Offset: 0x12D2038
    void $BeginAddPresenceSubscription$b__1(::System::IAsyncResult* ar2);
    // System.Void <BeginAddPresenceSubscription>b__2(System.IAsyncResult ar3)
    // Offset: 0x12D2258
    void $BeginAddPresenceSubscription$b__2(::System::IAsyncResult* ar3);
  }; // VivoxUnity.Private.LoginSession/<>c__DisplayClass110_0
  #pragma pack(pop)
  static check_size<sizeof(LoginSession::$$c__DisplayClass110_0), 56 + sizeof(::System::AsyncCallback*)> __VivoxUnity_Private_LoginSession_$$c__DisplayClass110_0SizeCheck;
  static_assert(sizeof(LoginSession::$$c__DisplayClass110_0) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::$BeginAddPresenceSubscription$b__0
// Il2CppName: <BeginAddPresenceSubscription>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::*)(::System::IAsyncResult*)>(&VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::$BeginAddPresenceSubscription$b__0)> {
  static const MethodInfo* get() {
    static auto* result = &::il2cpp_utils::GetClassFromName("System", "IAsyncResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0*), "<BeginAddPresenceSubscription>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{result});
  }
};
// Writing MetadataGetter for method: VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::$BeginAddPresenceSubscription$b__1
// Il2CppName: <BeginAddPresenceSubscription>b__1
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::*)(::System::IAsyncResult*)>(&VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::$BeginAddPresenceSubscription$b__1)> {
  static const MethodInfo* get() {
    static auto* ar2 = &::il2cpp_utils::GetClassFromName("System", "IAsyncResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0*), "<BeginAddPresenceSubscription>b__1", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ar2});
  }
};
// Writing MetadataGetter for method: VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::$BeginAddPresenceSubscription$b__2
// Il2CppName: <BeginAddPresenceSubscription>b__2
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::*)(::System::IAsyncResult*)>(&VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0::$BeginAddPresenceSubscription$b__2)> {
  static const MethodInfo* get() {
    static auto* ar3 = &::il2cpp_utils::GetClassFromName("System", "IAsyncResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VivoxUnity::Private::LoginSession::$$c__DisplayClass110_0*), "<BeginAddPresenceSubscription>b__2", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ar3});
  }
};
