// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: VivoxUnity.Private.LoginSession
#include "VivoxUnity/Private/LoginSession.hpp"
// Including type: VivoxUnity.SubscriptionMode
#include "VivoxUnity/SubscriptionMode.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: VivoxUnity
namespace VivoxUnity {
  // Forward declaring type: AsyncNoResult
  class AsyncNoResult;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0);
DEFINE_IL2CPP_ARG_TYPE(::VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0*, "VivoxUnity.Private", "LoginSession/<>c__DisplayClass85_0");
// Type namespace: VivoxUnity.Private
namespace VivoxUnity::Private {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: VivoxUnity.Private.LoginSession/<>c__DisplayClass85_0
  // [TokenAttribute] Offset: FFFFFFFF
  // [CompilerGeneratedAttribute] Offset: ABD998
  class LoginSession::$$c__DisplayClass85_0 : public ::Il2CppObject {
    public:
    public:
    // public VivoxUnity.Private.LoginSession <>4__this
    // Size: 0x8
    // Offset: 0x10
    ::VivoxUnity::Private::LoginSession* $$4__this;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Private::LoginSession*) == 0x8);
    // public VivoxUnity.AsyncNoResult result
    // Size: 0x8
    // Offset: 0x18
    ::VivoxUnity::AsyncNoResult* result;
    // Field size check
    static_assert(sizeof(::VivoxUnity::AsyncNoResult*) == 0x8);
    // public System.String accessToken
    // Size: 0x8
    // Offset: 0x20
    ::StringW accessToken;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public VivoxUnity.SubscriptionMode subscriptionMode
    // Size: 0x4
    // Offset: 0x28
    ::VivoxUnity::SubscriptionMode subscriptionMode;
    // Field size check
    static_assert(sizeof(::VivoxUnity::SubscriptionMode) == 0x4);
    public:
    // Get instance field reference: public VivoxUnity.Private.LoginSession <>4__this
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Private::LoginSession*& dyn_$$4__this();
    // Get instance field reference: public VivoxUnity.AsyncNoResult result
    [[deprecated("Use field access instead!")]] ::VivoxUnity::AsyncNoResult*& dyn_result();
    // Get instance field reference: public System.String accessToken
    [[deprecated("Use field access instead!")]] ::StringW& dyn_accessToken();
    // Get instance field reference: public VivoxUnity.SubscriptionMode subscriptionMode
    [[deprecated("Use field access instead!")]] ::VivoxUnity::SubscriptionMode& dyn_subscriptionMode();
    // public System.Void .ctor()
    // Offset: 0x12D3654
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LoginSession::$$c__DisplayClass85_0* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LoginSession::$$c__DisplayClass85_0*, creationType>()));
    }
    // System.Void <BeginLogin>b__0(System.IAsyncResult ar2)
    // Offset: 0x12D365C
    void $BeginLogin$b__0(::System::IAsyncResult* ar2);
  }; // VivoxUnity.Private.LoginSession/<>c__DisplayClass85_0
  #pragma pack(pop)
  static check_size<sizeof(LoginSession::$$c__DisplayClass85_0), 40 + sizeof(::VivoxUnity::SubscriptionMode)> __VivoxUnity_Private_LoginSession_$$c__DisplayClass85_0SizeCheck;
  static_assert(sizeof(LoginSession::$$c__DisplayClass85_0) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
// Writing MetadataGetter for method: VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0::$BeginLogin$b__0
// Il2CppName: <BeginLogin>b__0
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0::*)(::System::IAsyncResult*)>(&VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0::$BeginLogin$b__0)> {
  static const MethodInfo* get() {
    static auto* ar2 = &::il2cpp_utils::GetClassFromName("System", "IAsyncResult")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(VivoxUnity::Private::LoginSession::$$c__DisplayClass85_0*), "<BeginLogin>b__0", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{ar2});
  }
};
