// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Pegasus.PegasusConstants/PoiType
#include "Pegasus/PegasusConstants_PoiType.hpp"
// Including type: Pegasus.PegasusConstants/PoiHeightCheckType
#include "Pegasus/PegasusConstants_PoiHeightCheckType.hpp"
// Including type: Pegasus.PegasusConstants/LookatType
#include "Pegasus/PegasusConstants_LookatType.hpp"
// Including type: Pegasus.PegasusConstants/SpeedType
#include "Pegasus/PegasusConstants_SpeedType.hpp"
// Including type: Pegasus.PegasusConstants/EasingType
#include "Pegasus/PegasusConstants_EasingType.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pegasus
namespace Pegasus {
  // Forward declaring type: PegasusManager
  class PegasusManager;
  // Forward declaring type: TriggerBase
  class TriggerBase;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: Pegasus
namespace Pegasus {
  // Forward declaring type: PegasusPoi
  class PegasusPoi;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pegasus::PegasusPoi);
DEFINE_IL2CPP_ARG_TYPE(::Pegasus::PegasusPoi*, "Pegasus", "PegasusPoi");
// Type namespace: Pegasus
namespace Pegasus {
  // Size: 0xE8
  #pragma pack(push, 1)
  // Autogenerated type: Pegasus.PegasusPoi
  // [TokenAttribute] Offset: FFFFFFFF
  class PegasusPoi : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Pegasus::PegasusPoi::Easing
    class Easing;
    public:
    // [TooltipAttribute] Offset: 0xADF808
    // public Pegasus.PegasusConstants/PoiType m_poiType
    // Size: 0x4
    // Offset: 0x18
    ::Pegasus::PegasusConstants::PoiType m_poiType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::PoiType) == 0x4);
    // [TooltipAttribute] Offset: 0xADF840
    // public Pegasus.PegasusConstants/PoiHeightCheckType m_heightCheckType
    // Size: 0x4
    // Offset: 0x1C
    ::Pegasus::PegasusConstants::PoiHeightCheckType m_heightCheckType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::PoiHeightCheckType) == 0x4);
    // [TooltipAttribute] Offset: 0xADF878
    // public Pegasus.PegasusConstants/LookatType m_lookatType
    // Size: 0x4
    // Offset: 0x20
    ::Pegasus::PegasusConstants::LookatType m_lookatType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::LookatType) == 0x4);
    // [TooltipAttribute] Offset: 0xADF8B0
    // public System.Single m_lookAtAngle
    // Size: 0x4
    // Offset: 0x24
    float m_lookAtAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADF8E8
    // public System.Single m_lookAtDistance
    // Size: 0x4
    // Offset: 0x28
    float m_lookAtDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADF920
    // public System.Single m_lookAtHeight
    // Size: 0x4
    // Offset: 0x2C
    float m_lookAtHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADF958
    // public UnityEngine.Vector3 m_lookatLocation
    // Size: 0xC
    // Offset: 0x30
    ::UnityEngine::Vector3 m_lookatLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xADF990
    // public Pegasus.PegasusConstants/SpeedType m_startSpeedType
    // Size: 0x4
    // Offset: 0x3C
    ::Pegasus::PegasusConstants::SpeedType m_startSpeedType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::SpeedType) == 0x4);
    // [TooltipAttribute] Offset: 0xADF9C8
    // public System.Single m_startSpeed
    // Size: 0x4
    // Offset: 0x40
    float m_startSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pegasus.PegasusConstants/EasingType m_rotationEasingType
    // Size: 0x4
    // Offset: 0x44
    ::Pegasus::PegasusConstants::EasingType m_rotationEasingType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::EasingType) == 0x4);
    // public Pegasus.PegasusConstants/EasingType m_velocityEasingType
    // Size: 0x4
    // Offset: 0x48
    ::Pegasus::PegasusConstants::EasingType m_velocityEasingType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::EasingType) == 0x4);
    // public Pegasus.PegasusConstants/EasingType m_positionEasingType
    // Size: 0x4
    // Offset: 0x4C
    ::Pegasus::PegasusConstants::EasingType m_positionEasingType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::EasingType) == 0x4);
    // public Pegasus.PegasusManager m_manager
    // Size: 0x8
    // Offset: 0x50
    ::Pegasus::PegasusManager* m_manager;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusManager*) == 0x8);
    // public System.Boolean m_alwaysShowGizmos
    // Size: 0x1
    // Offset: 0x58
    bool m_alwaysShowGizmos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_alwaysShowGizmos and: m_segmentDistance
    char __padding13[0x3] = {};
    // public System.Single m_segmentDistance
    // Size: 0x4
    // Offset: 0x5C
    float m_segmentDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.TimeSpan m_segmentStartTime
    // Size: 0x8
    // Offset: 0x60
    ::System::TimeSpan m_segmentStartTime;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // public System.TimeSpan m_segmentDuration
    // Size: 0x8
    // Offset: 0x68
    ::System::TimeSpan m_segmentDuration;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // public System.Int32 m_segmentIndex
    // Size: 0x4
    // Offset: 0x70
    int m_segmentIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean m_isFirstPOI
    // Size: 0x1
    // Offset: 0x74
    bool m_isFirstPOI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean m_isLastPOI
    // Size: 0x1
    // Offset: 0x75
    bool m_isLastPOI;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isLastPOI and: m_prevPoi
    char __padding19[0x2] = {};
    // public Pegasus.PegasusPoi m_prevPoi
    // Size: 0x8
    // Offset: 0x78
    ::Pegasus::PegasusPoi* m_prevPoi;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusPoi*) == 0x8);
    // public Pegasus.PegasusPoi m_nextPoi
    // Size: 0x8
    // Offset: 0x80
    ::Pegasus::PegasusPoi* m_nextPoi;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusPoi*) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.Vector3> m_poiSteps
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* m_poiSteps;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // public System.Boolean m_isSelected
    // Size: 0x1
    // Offset: 0x90
    bool m_isSelected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isSelected and: m_poiTriggers
    char __padding23[0x7] = {};
    // public System.Collections.Generic.List`1<Pegasus.TriggerBase> m_poiTriggers
    // Size: 0x8
    // Offset: 0x98
    ::System::Collections::Generic::List_1<::Pegasus::TriggerBase*>* m_poiTriggers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pegasus::TriggerBase*>*) == 0x8);
    // public System.Boolean m_autoRollOn
    // Size: 0x1
    // Offset: 0xA0
    bool m_autoRollOn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_autoRollOn and: m_lastRotation
    char __padding25[0x3] = {};
    // public UnityEngine.Vector3 m_lastRotation
    // Size: 0xC
    // Offset: 0xA4
    ::UnityEngine::Vector3 m_lastRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private Pegasus.PegasusPoi/Easing m_velocityEasingCalculator
    // Size: 0x8
    // Offset: 0xB0
    ::Pegasus::PegasusPoi::Easing* m_velocityEasingCalculator;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusPoi::Easing*) == 0x8);
    // private Pegasus.PegasusPoi/Easing m_positionEasingCalculator
    // Size: 0x8
    // Offset: 0xB8
    ::Pegasus::PegasusPoi::Easing* m_positionEasingCalculator;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusPoi::Easing*) == 0x8);
    // private Pegasus.PegasusPoi/Easing m_rotationEasingCalculator
    // Size: 0x8
    // Offset: 0xC0
    ::Pegasus::PegasusPoi::Easing* m_rotationEasingCalculator;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusPoi::Easing*) == 0x8);
    // public UnityEngine.Quaternion m_rotationStart
    // Size: 0x10
    // Offset: 0xC8
    ::UnityEngine::Quaternion m_rotationStart;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion m_rotationEnd
    // Size: 0x10
    // Offset: 0xD8
    ::UnityEngine::Quaternion m_rotationEnd;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public Pegasus.PegasusConstants/PoiType m_poiType
    [[deprecated("Use field access instead!")]] ::Pegasus::PegasusConstants::PoiType& dyn_m_poiType();
    // Get instance field reference: public Pegasus.PegasusConstants/PoiHeightCheckType m_heightCheckType
    [[deprecated("Use field access instead!")]] ::Pegasus::PegasusConstants::PoiHeightCheckType& dyn_m_heightCheckType();
    // Get instance field reference: public Pegasus.PegasusConstants/LookatType m_lookatType
    [[deprecated("Use field access instead!")]] ::Pegasus::PegasusConstants::LookatType& dyn_m_lookatType();
    // Get instance field reference: public System.Single m_lookAtAngle
