// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Pegasus.PegasusConstants/FlythroughType
#include "Pegasus/PegasusConstants_FlythroughType.hpp"
// Including type: Pegasus.PegasusConstants/FlythroughEndAction
#include "Pegasus/PegasusConstants_FlythroughEndAction.hpp"
// Including type: Pegasus.PegasusConstants/TargetFrameRate
#include "Pegasus/PegasusConstants_TargetFrameRate.hpp"
// Including type: Pegasus.PegasusConstants/HeightCheckType
#include "Pegasus/PegasusConstants_HeightCheckType.hpp"
// Including type: Pegasus.PegasusConstants/FlythroughState
#include "Pegasus/PegasusConstants_FlythroughState.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Terrain
  class Terrain;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: Pegasus
namespace Pegasus {
  // Forward declaring type: PegasusPoi
  class PegasusPoi;
  // Forward declaring type: PegasusDefaults
  class PegasusDefaults;
}
// Completed forward declares
// Type namespace: Pegasus
namespace Pegasus {
  // Forward declaring type: PegasusManager
  class PegasusManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pegasus::PegasusManager);
DEFINE_IL2CPP_ARG_TYPE(::Pegasus::PegasusManager*, "Pegasus", "PegasusManager");
// Type namespace: Pegasus
namespace Pegasus {
  // Size: 0xE0
  #pragma pack(push, 1)
  // Autogenerated type: Pegasus.PegasusManager
  // [TokenAttribute] Offset: FFFFFFFF
  class PegasusManager : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public UnityEngine.GameObject m_target
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* m_target;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public Pegasus.PegasusConstants/FlythroughType m_flythroughType
    // Size: 0x4
    // Offset: 0x20
    ::Pegasus::PegasusConstants::FlythroughType m_flythroughType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::FlythroughType) == 0x4);
    // public Pegasus.PegasusConstants/FlythroughEndAction m_flythroughEndAction
    // Size: 0x4
    // Offset: 0x24
    ::Pegasus::PegasusConstants::FlythroughEndAction m_flythroughEndAction;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::FlythroughEndAction) == 0x4);
    // public Pegasus.PegasusConstants/TargetFrameRate m_targetFramerateType
    // Size: 0x4
    // Offset: 0x28
    ::Pegasus::PegasusConstants::TargetFrameRate m_targetFramerateType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::TargetFrameRate) == 0x4);
    // public Pegasus.PegasusConstants/HeightCheckType m_heightCheckType
    // Size: 0x4
    // Offset: 0x2C
    ::Pegasus::PegasusConstants::HeightCheckType m_heightCheckType;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::HeightCheckType) == 0x4);
    // public System.Boolean m_autoStartAtRuntime
    // Size: 0x1
    // Offset: 0x30
    bool m_autoStartAtRuntime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_autoStartAtRuntime and: m_poiList
    char __padding5[0x7] = {};
    // public System.Collections.Generic.List`1<Pegasus.PegasusPoi> m_poiList
    // Size: 0x8
    // Offset: 0x38
    ::System::Collections::Generic::List_1<::Pegasus::PegasusPoi*>* m_poiList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Pegasus::PegasusPoi*>*) == 0x8);
    // public System.Single m_minHeightAboveTerrain
    // Size: 0x4
    // Offset: 0x40
    float m_minHeightAboveTerrain;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean m_displayDebug
    // Size: 0x1
    // Offset: 0x44
    bool m_displayDebug;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean m_alwaysShowGizmos
    // Size: 0x1
    // Offset: 0x45
    bool m_alwaysShowGizmos;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_alwaysShowGizmos and: m_currentState
    char __padding9[0x2] = {};
    // public Pegasus.PegasusConstants/FlythroughState m_currentState
    // Size: 0x4
    // Offset: 0x48
    ::Pegasus::PegasusConstants::FlythroughState m_currentState;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusConstants::FlythroughState) == 0x4);
    // public System.Int32 m_currentSegmentIdx
    // Size: 0x4
    // Offset: 0x4C
    int m_currentSegmentIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public Pegasus.PegasusPoi m_currentSegment
    // Size: 0x8
    // Offset: 0x50
    ::Pegasus::PegasusPoi* m_currentSegment;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusPoi*) == 0x8);
    // public System.Single m_currentSegmentDistanceTravelled
    // Size: 0x4
    // Offset: 0x58
    float m_currentSegmentDistanceTravelled;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_totalDistanceTravelled
    // Size: 0x4
    // Offset: 0x5C
    float m_totalDistanceTravelled;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_totalDistanceTravelledPct
    // Size: 0x4
    // Offset: 0x60
    float m_totalDistanceTravelledPct;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_totalDistance
    // Size: 0x4
    // Offset: 0x64
    float m_totalDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.TimeSpan m_totalDuration
    // Size: 0x8
    // Offset: 0x68
    ::System::TimeSpan m_totalDuration;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // public System.Single m_currentVelocity
    // Size: 0x4
    // Offset: 0x70
    float m_currentVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 m_currentPosition
    // Size: 0xC
    // Offset: 0x74
    ::UnityEngine::Vector3 m_currentPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion m_currentRotation
    // Size: 0x10
    // Offset: 0x80
    ::UnityEngine::Quaternion m_currentRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Boolean m_canUpdateNow
    // Size: 0x1
    // Offset: 0x90
    bool m_canUpdateNow;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_canUpdateNow and: m_lastUpdateTime
    char __padding21[0x7] = {};
    // public System.DateTime m_lastUpdateTime
    // Size: 0x8
    // Offset: 0x98
    ::System::DateTime m_lastUpdateTime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // public System.Single m_frameUpdateTime
    // Size: 0x4
    // Offset: 0xA0
    float m_frameUpdateTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_frameUpdateDistance
    // Size: 0x4
    // Offset: 0xA4
    float m_frameUpdateDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_rotationDamping
    // Size: 0x4
    // Offset: 0xA8
    float m_rotationDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_positionDamping
    // Size: 0x4
    // Offset: 0xAC
    float m_positionDamping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pegasus.PegasusManager m_nextPegasus
    // Size: 0x8
    // Offset: 0xB0
    ::Pegasus::PegasusManager* m_nextPegasus;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusManager*) == 0x8);
    // public System.Boolean m_alwaysShowPath
    // Size: 0x1
    // Offset: 0xB8
    bool m_alwaysShowPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean m_showScrubber
    // Size: 0x1
    // Offset: 0xB9
    bool m_showScrubber;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean m_showPOIHelpers
    // Size: 0x1
    // Offset: 0xBA
    bool m_showPOIHelpers;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_showPOIHelpers and: m_poiGizmoSize
    char __padding30[0x1] = {};
    // public System.Single m_poiGizmoSize
    // Size: 0x4
    // Offset: 0xBC
    float m_poiGizmoSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean m_showAdvanced
    // Size: 0x1
    // Offset: 0xC0
    bool m_showAdvanced;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_showAdvanced and: m_collisionHeightOffset
    char __padding32[0x3] = {};
    // public System.Single m_collisionHeightOffset
    // Size: 0x4
    // Offset: 0xC4
    float m_collisionHeightOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_managerSpeed
    // Size: 0x4
    // Offset: 0xC8
    float m_managerSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_managerSpeed and: m_defaults
    char __padding34[0x4] = {};
    // public Pegasus.PegasusDefaults m_defaults
    // Size: 0x8
    // Offset: 0xD0
    ::Pegasus::PegasusDefaults* m_defaults;
    // Field size check
    static_assert(sizeof(::Pegasus::PegasusDefaults*) == 0x8);
    // public System.Single m_autoRollMaxSpeed
    // Size: 0x4
    // Offset: 0xD8
    float m_autoRollMaxSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single m_autoRollMaxAngle
    // Size: 0x4
    // Offset: 0xDC
    float m_autoRollMaxAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.GameObject m_target
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_m_target();
    // Get instance field reference: public Pegasus.PegasusConstants/FlythroughType m_flythroughType
    [[deprecated("Use field access instead!")]] ::Pegasus::PegasusConstants::FlythroughType& dyn_m_flythroughType();
    // Get instance field reference: public Pegasus.PegasusConstants/FlythroughEndAction m_flythroughEndAction
    [[deprecated("Use field access instead!")]] ::Pegasus::PegasusConstants::FlythroughEndAction& dyn_m_flythroughEndAction();
    // Get instance field reference: public Pegasus.PegasusConstants/TargetFrameRate m_targetFramerateType
