// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: SteamVR_Controller
#include "GlobalNamespace/SteamVR_Controller.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: TextMesh
  class TextMesh;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: Valve::VR::InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: LinearMapping
  class LinearMapping;
  // Forward declaring type: Hand
  class Hand;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: CircularDrive
  class CircularDrive;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Valve::VR::InteractionSystem::CircularDrive);
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::InteractionSystem::CircularDrive*, "Valve.VR.InteractionSystem", "CircularDrive");
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Size: 0x128
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.InteractionSystem.CircularDrive
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD0678
  class CircularDrive : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Valve::VR::InteractionSystem::CircularDrive::Axis_t
    struct Axis_t;
    // Nested type: ::Valve::VR::InteractionSystem::CircularDrive::$HapticPulses$d__43
    class $HapticPulses$d__43;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Valve.VR.InteractionSystem.CircularDrive/Axis_t
    // [TokenAttribute] Offset: FFFFFFFF
    struct Axis_t/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Axis_t
      constexpr Axis_t(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t XAxis
      static constexpr const int XAxis = 0;
      // Get static field: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t XAxis
      static ::Valve::VR::InteractionSystem::CircularDrive::Axis_t _get_XAxis();
      // Set static field: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t XAxis
      static void _set_XAxis(::Valve::VR::InteractionSystem::CircularDrive::Axis_t value);
      // static field const value: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t YAxis
      static constexpr const int YAxis = 1;
      // Get static field: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t YAxis
      static ::Valve::VR::InteractionSystem::CircularDrive::Axis_t _get_YAxis();
      // Set static field: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t YAxis
      static void _set_YAxis(::Valve::VR::InteractionSystem::CircularDrive::Axis_t value);
      // static field const value: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t ZAxis
      static constexpr const int ZAxis = 2;
      // Get static field: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t ZAxis
      static ::Valve::VR::InteractionSystem::CircularDrive::Axis_t _get_ZAxis();
      // Set static field: static public Valve.VR.InteractionSystem.CircularDrive/Axis_t ZAxis
      static void _set_ZAxis(::Valve::VR::InteractionSystem::CircularDrive::Axis_t value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Valve.VR.InteractionSystem.CircularDrive/Axis_t
    #pragma pack(pop)
    static check_size<sizeof(CircularDrive::Axis_t), 0 + sizeof(int)> __Valve_VR_InteractionSystem_CircularDrive_Axis_tSizeCheck;
    static_assert(sizeof(CircularDrive::Axis_t) == 0x4);
    public:
    // [TooltipAttribute] Offset: 0xADD838
    // public Valve.VR.InteractionSystem.CircularDrive/Axis_t axisOfRotation
    // Size: 0x4
    // Offset: 0x18
    ::Valve::VR::InteractionSystem::CircularDrive::Axis_t axisOfRotation;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::CircularDrive::Axis_t) == 0x4);
    // Padding between fields: axisOfRotation and: childCollider
    char __padding0[0x4] = {};
    // [TooltipAttribute] Offset: 0xADD870
    // public UnityEngine.Collider childCollider
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Collider* childCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::Collider*) == 0x8);
    // [TooltipAttribute] Offset: 0xADD8A8
    // public Valve.VR.InteractionSystem.LinearMapping linearMapping
    // Size: 0x8
    // Offset: 0x28
    ::Valve::VR::InteractionSystem::LinearMapping* linearMapping;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::LinearMapping*) == 0x8);
    // [TooltipAttribute] Offset: 0xADD8E0
    // public System.Boolean hoverLock
    // Size: 0x1
    // Offset: 0x30
    bool hoverLock;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [HeaderAttribute] Offset: 0xADD918
    // [TooltipAttribute] Offset: 0xADD918
    // public System.Boolean limited
    // Size: 0x1
    // Offset: 0x31
    bool limited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: limited and: frozenDistanceMinMaxThreshold
    char __padding4[0x2] = {};
    // public UnityEngine.Vector2 frozenDistanceMinMaxThreshold
    // Size: 0x8
    // Offset: 0x34
    ::UnityEngine::Vector2 frozenDistanceMinMaxThreshold;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: frozenDistanceMinMaxThreshold and: onFrozenDistanceThreshold
    char __padding5[0x4] = {};
    // public UnityEngine.Events.UnityEvent onFrozenDistanceThreshold
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Events::UnityEvent* onFrozenDistanceThreshold;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0xADD978
    // [HeaderAttribute] Offset: 0xADD978
    // public System.Single minAngle
    // Size: 0x4
    // Offset: 0x48
    float minAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADD9D8
    // public System.Boolean freezeOnMin
    // Size: 0x1
    // Offset: 0x4C
    bool freezeOnMin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: freezeOnMin and: onMinAngle
    char __padding8[0x3] = {};
    // [TooltipAttribute] Offset: 0xADDA10
    // public UnityEngine.Events.UnityEvent onMinAngle
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Events::UnityEvent* onMinAngle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0xADDA48
    // [HeaderAttribute] Offset: 0xADDA48
    // public System.Single maxAngle
    // Size: 0x4
    // Offset: 0x58
    float maxAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADDAA8
    // public System.Boolean freezeOnMax
    // Size: 0x1
    // Offset: 0x5C
    bool freezeOnMax;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: freezeOnMax and: onMaxAngle
    char __padding11[0x3] = {};
    // [TooltipAttribute] Offset: 0xADDAE0
    // public UnityEngine.Events.UnityEvent onMaxAngle
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Events::UnityEvent* onMaxAngle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [TooltipAttribute] Offset: 0xADDB18
    // public System.Boolean forceStart
    // Size: 0x1
    // Offset: 0x68
    bool forceStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: forceStart and: startAngle
    char __padding13[0x3] = {};
    // [TooltipAttribute] Offset: 0xADDB50
    // public System.Single startAngle
    // Size: 0x4
    // Offset: 0x6C
    float startAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xADDB88
    // public System.Boolean rotateGameObject
    // Size: 0x1
    // Offset: 0x70
    bool rotateGameObject;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xADDBC0
    // public System.Boolean debugPath
    // Size: 0x1
    // Offset: 0x71
    bool debugPath;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugPath and: dbgPathLimit
    char __padding16[0x2] = {};
    // [TooltipAttribute] Offset: 0xADDBF8
    // public System.Int32 dbgPathLimit
    // Size: 0x4
    // Offset: 0x74
    int dbgPathLimit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xADDC30
    // public UnityEngine.TextMesh debugText
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::TextMesh* debugText;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextMesh*) == 0x8);
    // [TooltipAttribute] Offset: 0xADDC68
    // public System.Single outAngle
    // Size: 0x4
    // Offset: 0x80
    float outAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion start
    // Size: 0x10
    // Offset: 0x84
    ::UnityEngine::Quaternion start;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 worldPlaneNormal
    // Size: 0xC
    // Offset: 0x94
    ::UnityEngine::Vector3 worldPlaneNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 localPlaneNormal
    // Size: 0xC
    // Offset: 0xA0
    ::UnityEngine::Vector3 localPlaneNormal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 lastHandProjected
    // Size: 0xC
    // Offset: 0xAC
    ::UnityEngine::Vector3 lastHandProjected;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Color red
    // Size: 0x10
    // Offset: 0xB8
    ::UnityEngine::Color red;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color green
    // Size: 0x10
    // Offset: 0xC8
    ::UnityEngine::Color green;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.GameObject[] dbgHandObjects
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<::UnityEngine::GameObject*> dbgHandObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.GameObject[] dbgProjObjects
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::UnityEngine::GameObject*> dbgProjObjects;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.GameObject dbgObjectsParent
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::GameObject* dbgObjectsParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Int32 dbgObjectCount
    // Size: 0x4
    // Offset: 0xF0
    int dbgObjectCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 dbgObjectIndex
    // Size: 0x4
    // Offset: 0xF4
    int dbgObjectIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean driving
    // Size: 0x1
    // Offset: 0xF8
    bool driving;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: driving and: minMaxAngularThreshold
    char __padding31[0x3] = {};
    // private System.Single minMaxAngularThreshold
    // Size: 0x4
    // Offset: 0xFC
    float minMaxAngularThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean frozen
    // Size: 0x1
    // Offset: 0x100
    bool frozen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: frozen and: frozenAngle
    char __padding33[0x3] = {};
    // private System.Single frozenAngle
    // Size: 0x4
    // Offset: 0x104
    float frozenAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 frozenHandWorldPos
    // Size: 0xC
    // Offset: 0x108
    ::UnityEngine::Vector3 frozenHandWorldPos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector2 frozenSqDistanceMinMaxThreshold
    // Size: 0x8
    // Offset: 0x114
    ::UnityEngine::Vector2 frozenSqDistanceMinMaxThreshold;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: frozenSqDistanceMinMaxThreshold and: handHoverLocked
    char __padding36[0x4] = {};
    // private Valve.VR.InteractionSystem.Hand handHoverLocked
    // Size: 0x8
    // Offset: 0x120
    ::Valve::VR::InteractionSystem::Hand* handHoverLocked;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Hand*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public Valve.VR.InteractionSystem.CircularDrive/Axis_t axisOfRotation
    [[deprecated("Use field access instead!")]] ::Valve::VR::InteractionSystem::CircularDrive::Axis_t& dyn_axisOfRotation();
    // Get instance field reference: public UnityEngine.Collider childCollider
    [[deprecated("Use field access instead!")]] ::UnityEngine::Collider*& dyn_childCollider();
    // Get instance field reference: public Valve.VR.InteractionSystem.LinearMapping linearMapping
    [[deprecated("Use field access instead!")]] ::Valve::VR::InteractionSystem::LinearMapping*& dyn_linearMapping();
