// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: Valve.VR.EVRButtonId
#include "Valve/VR/EVRButtonId.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
// Including type: SteamVR_Events
#include "GlobalNamespace/SteamVR_Events.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR::InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Player
  class Player;
  // Forward declaring type: Hand
  class Hand;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Transform
  class Transform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SteamVR_RenderModel
  class SteamVR_RenderModel;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: ControllerButtonHints
  class ControllerButtonHints;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Valve::VR::InteractionSystem::ControllerButtonHints);
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::InteractionSystem::ControllerButtonHints*, "Valve.VR.InteractionSystem", "ControllerButtonHints");
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Size: 0xA0
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.InteractionSystem.ControllerButtonHints
  // [TokenAttribute] Offset: FFFFFFFF
  class ControllerButtonHints : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Valve::VR::InteractionSystem::ControllerButtonHints::OffsetType
    struct OffsetType;
    // Nested type: ::Valve::VR::InteractionSystem::ControllerButtonHints::ButtonHintInfo
    class ButtonHintInfo;
    // Nested type: ::Valve::VR::InteractionSystem::ControllerButtonHints::$TestButtonHints$d__36
    class $TestButtonHints$d__36;
    // Nested type: ::Valve::VR::InteractionSystem::ControllerButtonHints::$TestTextHints$d__37
    class $TestTextHints$d__37;
    public:
    // public UnityEngine.Material controllerMaterial
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Material* controllerMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Color flashColor
    // Size: 0x10
    // Offset: 0x20
    ::UnityEngine::Color flashColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.GameObject textHintPrefab
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* textHintPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // [HeaderAttribute] Offset: 0xADE6E0
    // public System.Boolean debugHints
    // Size: 0x1
    // Offset: 0x38
    bool debugHints;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugHints and: renderModel
    char __padding3[0x7] = {};
    // private SteamVR_RenderModel renderModel
    // Size: 0x8
    // Offset: 0x40
    ::GlobalNamespace::SteamVR_RenderModel* renderModel;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_RenderModel*) == 0x8);
    // private Valve.VR.InteractionSystem.Player player
    // Size: 0x8
    // Offset: 0x48
    ::Valve::VR::InteractionSystem::Player* player;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Player*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.MeshRenderer> renderers
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>* renderers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.MeshRenderer> flashingRenderers
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>* flashingRenderers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::MeshRenderer*>*) == 0x8);
    // private System.Single startTime
    // Size: 0x4
    // Offset: 0x60
    float startTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single tickCount
    // Size: 0x4
    // Offset: 0x64
    float tickCount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.Dictionary`2<Valve.VR.EVRButtonId,Valve.VR.InteractionSystem.ControllerButtonHints/ButtonHintInfo> buttonHintInfos
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::Dictionary_2<::Valve::VR::EVRButtonId, ::Valve::VR::InteractionSystem::ControllerButtonHints::ButtonHintInfo*>* buttonHintInfos;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::Valve::VR::EVRButtonId, ::Valve::VR::InteractionSystem::ControllerButtonHints::ButtonHintInfo*>*) == 0x8);
    // private UnityEngine.Transform textHintParent
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Transform* textHintParent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<System.String,System.UInt64>> componentButtonMasks
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::System::Collections::Generic::KeyValuePair_2<::StringW, uint64_t>>* componentButtonMasks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::KeyValuePair_2<::StringW, uint64_t>>*) == 0x8);
    // private System.Int32 colorID
    // Size: 0x4
    // Offset: 0x80
    int colorID;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xADE718
    // private System.Boolean <initialized>k__BackingField
    // Size: 0x1
    // Offset: 0x84
    bool initialized;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: initialized and: centerPosition
    char __padding14[0x3] = {};
    // private UnityEngine.Vector3 centerPosition
    // Size: 0xC
    // Offset: 0x88
    ::UnityEngine::Vector3 centerPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: centerPosition and: renderModelLoadedAction
    char __padding15[0x4] = {};
    // private SteamVR_Events/Action renderModelLoadedAction
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::SteamVR_Events::Action* renderModelLoadedAction;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Material controllerMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn_controllerMaterial();
    // Get instance field reference: public UnityEngine.Color flashColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn_flashColor();
    // Get instance field reference: public UnityEngine.GameObject textHintPrefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_textHintPrefab();
    // Get instance field reference: public System.Boolean debugHints
