// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: SteamVR_Controller
#include "GlobalNamespace/SteamVR_Controller.hpp"
// Including type: SteamVR_Events
#include "GlobalNamespace/SteamVR_Events.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: TextMesh
  class TextMesh;
  // Forward declaring type: Collider
  class Collider;
  // Skipping declaration: Vector3 because it is already included!
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: Valve::VR::InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Interactable
  class Interactable;
  // Forward declaring type: Player
  class Player;
  // Skipping declaration: HandType because it is already included!
  // Skipping declaration: AttachmentFlags because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Hand
  class Hand;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Valve::VR::InteractionSystem::Hand);
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::InteractionSystem::Hand*, "Valve.VR.InteractionSystem", "Hand");
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.InteractionSystem.Hand
  // [TokenAttribute] Offset: FFFFFFFF
  class Hand : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Valve::VR::InteractionSystem::Hand::HandType
    struct HandType;
    // Nested type: ::Valve::VR::InteractionSystem::Hand::AttachmentFlags
    struct AttachmentFlags;
    // Nested type: ::Valve::VR::InteractionSystem::Hand::AttachedObject
    struct AttachedObject;
    // Nested type: ::Valve::VR::InteractionSystem::Hand::$$c__DisplayClass42_0
    class $$c__DisplayClass42_0;
    // Nested type: ::Valve::VR::InteractionSystem::Hand::$$c
    class $$c;
    // Nested type: ::Valve::VR::InteractionSystem::Hand::$Start$d__47
    class $Start$d__47;
    // Nested type: ::Valve::VR::InteractionSystem::Hand::$$c__DisplayClass48_0
    class $$c__DisplayClass48_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Valve.VR.InteractionSystem.Hand/HandType
    // [TokenAttribute] Offset: FFFFFFFF
    struct HandType/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: HandType
      constexpr HandType(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Valve.VR.InteractionSystem.Hand/HandType Left
      static constexpr const int Left = 0;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/HandType Left
      static ::Valve::VR::InteractionSystem::Hand::HandType _get_Left();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/HandType Left
      static void _set_Left(::Valve::VR::InteractionSystem::Hand::HandType value);
      // static field const value: static public Valve.VR.InteractionSystem.Hand/HandType Right
      static constexpr const int Right = 1;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/HandType Right
      static ::Valve::VR::InteractionSystem::Hand::HandType _get_Right();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/HandType Right
      static void _set_Right(::Valve::VR::InteractionSystem::Hand::HandType value);
      // static field const value: static public Valve.VR.InteractionSystem.Hand/HandType Any
      static constexpr const int Any = 2;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/HandType Any
      static ::Valve::VR::InteractionSystem::Hand::HandType _get_Any();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/HandType Any
      static void _set_Any(::Valve::VR::InteractionSystem::Hand::HandType value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Valve.VR.InteractionSystem.Hand/HandType
    #pragma pack(pop)
    static check_size<sizeof(Hand::HandType), 0 + sizeof(int)> __Valve_VR_InteractionSystem_Hand_HandTypeSizeCheck;
    static_assert(sizeof(Hand::HandType) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Valve.VR.InteractionSystem.Hand/AttachmentFlags
    // [TokenAttribute] Offset: FFFFFFFF
    // [FlagsAttribute] Offset: FFFFFFFF
    struct AttachmentFlags/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AttachmentFlags
      constexpr AttachmentFlags(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags SnapOnAttach
      static constexpr const int SnapOnAttach = 1;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags SnapOnAttach
      static ::Valve::VR::InteractionSystem::Hand::AttachmentFlags _get_SnapOnAttach();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags SnapOnAttach
      static void _set_SnapOnAttach(::Valve::VR::InteractionSystem::Hand::AttachmentFlags value);
      // static field const value: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags DetachOthers
      static constexpr const int DetachOthers = 2;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags DetachOthers
      static ::Valve::VR::InteractionSystem::Hand::AttachmentFlags _get_DetachOthers();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags DetachOthers
      static void _set_DetachOthers(::Valve::VR::InteractionSystem::Hand::AttachmentFlags value);
      // static field const value: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags DetachFromOtherHand
      static constexpr const int DetachFromOtherHand = 4;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags DetachFromOtherHand
      static ::Valve::VR::InteractionSystem::Hand::AttachmentFlags _get_DetachFromOtherHand();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags DetachFromOtherHand
      static void _set_DetachFromOtherHand(::Valve::VR::InteractionSystem::Hand::AttachmentFlags value);
      // static field const value: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags ParentToHand
      static constexpr const int ParentToHand = 8;
      // Get static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags ParentToHand
      static ::Valve::VR::InteractionSystem::Hand::AttachmentFlags _get_ParentToHand();
      // Set static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags ParentToHand
      static void _set_ParentToHand(::Valve::VR::InteractionSystem::Hand::AttachmentFlags value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Valve.VR.InteractionSystem.Hand/AttachmentFlags
    #pragma pack(pop)
    static check_size<sizeof(Hand::AttachmentFlags), 0 + sizeof(int)> __Valve_VR_InteractionSystem_Hand_AttachmentFlagsSizeCheck;
    static_assert(sizeof(Hand::AttachmentFlags) == 0x4);
    // Size: 0x11
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: Valve.VR.InteractionSystem.Hand/AttachedObject
    // [TokenAttribute] Offset: FFFFFFFF
    struct AttachedObject/*, public ::System::ValueType*/ {
      public:
      public:
      // public UnityEngine.GameObject attachedObject
      // Size: 0x8
      // Offset: 0x0
      ::UnityEngine::GameObject* attachedObject;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // public UnityEngine.GameObject originalParent
      // Size: 0x8
      // Offset: 0x8
      ::UnityEngine::GameObject* originalParent;
      // Field size check
      static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
      // public System.Boolean isParentedToHand
      // Size: 0x1
      // Offset: 0x10
      bool isParentedToHand;
      // Field size check
      static_assert(sizeof(bool) == 0x1);
      public:
      // Creating value type constructor for type: AttachedObject
      constexpr AttachedObject(::UnityEngine::GameObject* attachedObject_ = {}, ::UnityEngine::GameObject* originalParent_ = {}, bool isParentedToHand_ = {}) noexcept : attachedObject{attachedObject_}, originalParent{originalParent_}, isParentedToHand{isParentedToHand_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public UnityEngine.GameObject attachedObject
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_attachedObject();
      // Get instance field reference: public UnityEngine.GameObject originalParent
      [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_originalParent();
      // Get instance field reference: public System.Boolean isParentedToHand
      [[deprecated("Use field access instead!")]] bool& dyn_isParentedToHand();
    }; // Valve.VR.InteractionSystem.Hand/AttachedObject
    #pragma pack(pop)
    static check_size<sizeof(Hand::AttachedObject), 16 + sizeof(bool)> __Valve_VR_InteractionSystem_Hand_AttachedObjectSizeCheck;
    static_assert(sizeof(Hand::AttachedObject) == 0x11);
    public:
    // public Valve.VR.InteractionSystem.Hand otherHand
    // Size: 0x8
    // Offset: 0x18
    ::Valve::VR::InteractionSystem::Hand* otherHand;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Hand*) == 0x8);
    // public Valve.VR.InteractionSystem.Hand/HandType startingHandType
    // Size: 0x4
    // Offset: 0x20
    ::Valve::VR::InteractionSystem::Hand::HandType startingHandType;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Hand::HandType) == 0x4);
    // Padding between fields: startingHandType and: hoverSphereTransform
    char __padding1[0x4] = {};
    // public UnityEngine.Transform hoverSphereTransform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* hoverSphereTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single hoverSphereRadius
    // Size: 0x4
    // Offset: 0x30
    float hoverSphereRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.LayerMask hoverLayerMask
    // Size: 0x4
    // Offset: 0x34
    ::UnityEngine::LayerMask hoverLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Single hoverUpdateInterval
    // Size: 0x4
    // Offset: 0x38
    float hoverUpdateInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: hoverUpdateInterval and: noSteamVRFallbackCamera
    char __padding5[0x4] = {};
    // public UnityEngine.Camera noSteamVRFallbackCamera
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Camera* noSteamVRFallbackCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // public System.Single noSteamVRFallbackMaxDistanceNoItem
    // Size: 0x4
    // Offset: 0x48
    float noSteamVRFallbackMaxDistanceNoItem;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single noSteamVRFallbackMaxDistanceWithItem
    // Size: 0x4
    // Offset: 0x4C
    float noSteamVRFallbackMaxDistanceWithItem;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single noSteamVRFallbackInteractorDistance
    // Size: 0x4
    // Offset: 0x50
    float noSteamVRFallbackInteractorDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: noSteamVRFallbackInteractorDistance and: controller
    char __padding9[0x4] = {};
    // public SteamVR_Controller/Device controller
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::SteamVR_Controller::Device* controller;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_Controller::Device*) == 0x8);
    // public UnityEngine.GameObject controllerPrefab
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* controllerPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject controllerObject
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* controllerObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean showDebugText
    // Size: 0x1
    // Offset: 0x70
    bool showDebugText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean spewDebugText
    // Size: 0x1
    // Offset: 0x71
    bool spewDebugText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: spewDebugText and: attachedObjects
    char __padding14[0x6] = {};
    // private System.Collections.Generic.List`1<Valve.VR.InteractionSystem.Hand/AttachedObject> attachedObjects
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::Valve::VR::InteractionSystem::Hand::AttachedObject>* attachedObjects;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::Valve::VR::InteractionSystem::Hand::AttachedObject>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADDCB0
    // private System.Boolean <hoverLocked>k__BackingField
    // Size: 0x1
    // Offset: 0x80
    bool hoverLocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hoverLocked and: hoveringInteractable
    char __padding16[0x7] = {};
    // private Valve.VR.InteractionSystem.Interactable _hoveringInteractable
    // Size: 0x8
    // Offset: 0x88
    ::Valve::VR::InteractionSystem::Interactable* hoveringInteractable;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Interactable*) == 0x8);
    // private UnityEngine.TextMesh debugText
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::TextMesh* debugText;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextMesh*) == 0x8);
    // private System.Int32 prevOverlappingColliders
    // Size: 0x4
    // Offset: 0x98
    int prevOverlappingColliders;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: prevOverlappingColliders and: overlappingColliders
    char __padding19[0x4] = {};
    // private UnityEngine.Collider[] overlappingColliders
    // Size: 0x8
    // Offset: 0xA0
    ::ArrayW<::UnityEngine::Collider*> overlappingColliders;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private Valve.VR.InteractionSystem.Player playerInstance
    // Size: 0x8
    // Offset: 0xA8
    ::Valve::VR::InteractionSystem::Player* playerInstance;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Player*) == 0x8);
    // private UnityEngine.GameObject applicationLostFocusObject
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::GameObject* applicationLostFocusObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private SteamVR_Events/Action inputFocusAction
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::SteamVR_Events::Action* inputFocusAction;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags defaultAttachmentFlags
    static constexpr const int defaultAttachmentFlags = 15;
    // Get static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags defaultAttachmentFlags
    static ::Valve::VR::InteractionSystem::Hand::AttachmentFlags _get_defaultAttachmentFlags();
    // Set static field: static public Valve.VR.InteractionSystem.Hand/AttachmentFlags defaultAttachmentFlags
    static void _set_defaultAttachmentFlags(::Valve::VR::InteractionSystem::Hand::AttachmentFlags value);
