// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR::InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: LinearMapping
  class LinearMapping;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Animator
  class Animator;
}
// Completed forward declares
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: LinearAnimator
  class LinearAnimator;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Valve::VR::InteractionSystem::LinearAnimator);
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::InteractionSystem::LinearAnimator*, "Valve.VR.InteractionSystem", "LinearAnimator");
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.InteractionSystem.LinearAnimator
  // [TokenAttribute] Offset: FFFFFFFF
  class LinearAnimator : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public Valve.VR.InteractionSystem.LinearMapping linearMapping
    // Size: 0x8
    // Offset: 0x18
    ::Valve::VR::InteractionSystem::LinearMapping* linearMapping;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::LinearMapping*) == 0x8);
    // public UnityEngine.Animator animator
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Animator* animator;
    // Field size check
    static_assert(sizeof(::UnityEngine::Animator*) == 0x8);
    // private System.Single currentLinearMapping
    // Size: 0x4
    // Offset: 0x28
    float currentLinearMapping;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 framesUnchanged
    // Size: 0x4
    // Offset: 0x2C
    int framesUnchanged;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public Valve.VR.InteractionSystem.LinearMapping linearMapping
    [[deprecated("Use field access instead!")]] ::Valve::VR::InteractionSystem::LinearMapping*& dyn_linearMapping();
    // Get instance field reference: public UnityEngine.Animator animator
    [[deprecated("Use field access instead!")]] ::UnityEngine::Animator*& dyn_animator();
    // Get instance field reference: private System.Single currentLinearMapping
    [[deprecated("Use field access instead!")]] float& dyn_currentLinearMapping();
    // Get instance field reference: private System.Int32 framesUnchanged
    [[deprecated("Use field access instead!")]] int& dyn_framesUnchanged();
    // private System.Void Awake()
    // Offset: 0xDB9D5C
    void Awake();
    // private System.Void Update()
    // Offset: 0xDB9E68
    void Update();
    // public System.Void .ctor()
    // Offset: 0xDB9F58
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static LinearAnimator* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Valve::VR::InteractionSystem::LinearAnimator::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<LinearAnimator*, creationType>()));
    }
  }; // Valve.VR.InteractionSystem.LinearAnimator
  #pragma pack(pop)
  static check_size<sizeof(LinearAnimator), 44 + sizeof(int)> __Valve_VR_InteractionSystem_LinearAnimatorSizeCheck;
  static_assert(sizeof(LinearAnimator) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Valve::VR::InteractionSystem::LinearAnimator::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Valve::VR::InteractionSystem::LinearAnimator::*)()>(&Valve::VR::InteractionSystem::LinearAnimator::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Valve::VR::InteractionSystem::LinearAnimator*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Valve::VR::InteractionSystem::LinearAnimator::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Valve::VR::InteractionSystem::LinearAnimator::*)()>(&Valve::VR::InteractionSystem::LinearAnimator::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Valve::VR::InteractionSystem::LinearAnimator*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Valve::VR::InteractionSystem::LinearAnimator::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
