// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: SteamVR_Events
#include "GlobalNamespace/SteamVR_Events.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: Valve::VR::InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Hand
  class Hand;
  // Forward declaring type: ArrowHand
  class ArrowHand;
  // Forward declaring type: ItemPackage
  class ItemPackage;
  // Forward declaring type: LinearMapping
  class LinearMapping;
  // Forward declaring type: SoundBowClick
  class SoundBowClick;
  // Forward declaring type: SoundPlayOneshot
  class SoundPlayOneshot;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Longbow
  class Longbow;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Valve::VR::InteractionSystem::Longbow);
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::InteractionSystem::Longbow*, "Valve.VR.InteractionSystem", "Longbow");
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Size: 0x130
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.InteractionSystem.Longbow
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: AD0CEC
  class Longbow : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Valve::VR::InteractionSystem::Longbow::Handedness
    struct Handedness;
    // Nested type: ::Valve::VR::InteractionSystem::Longbow::$ResetDrawAnim$d__55
    class $ResetDrawAnim$d__55;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Valve.VR.InteractionSystem.Longbow/Handedness
    // [TokenAttribute] Offset: FFFFFFFF
    struct Handedness/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Handedness
      constexpr Handedness(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Valve.VR.InteractionSystem.Longbow/Handedness Left
      static constexpr const int Left = 0;
      // Get static field: static public Valve.VR.InteractionSystem.Longbow/Handedness Left
      static ::Valve::VR::InteractionSystem::Longbow::Handedness _get_Left();
      // Set static field: static public Valve.VR.InteractionSystem.Longbow/Handedness Left
      static void _set_Left(::Valve::VR::InteractionSystem::Longbow::Handedness value);
      // static field const value: static public Valve.VR.InteractionSystem.Longbow/Handedness Right
      static constexpr const int Right = 1;
      // Get static field: static public Valve.VR.InteractionSystem.Longbow/Handedness Right
      static ::Valve::VR::InteractionSystem::Longbow::Handedness _get_Right();
      // Set static field: static public Valve.VR.InteractionSystem.Longbow/Handedness Right
      static void _set_Right(::Valve::VR::InteractionSystem::Longbow::Handedness value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Valve.VR.InteractionSystem.Longbow/Handedness
    #pragma pack(pop)
    static check_size<sizeof(Longbow::Handedness), 0 + sizeof(int)> __Valve_VR_InteractionSystem_Longbow_HandednessSizeCheck;
    static_assert(sizeof(Longbow::Handedness) == 0x4);
    public:
    // public Valve.VR.InteractionSystem.Longbow/Handedness currentHandGuess
    // Size: 0x4
    // Offset: 0x18
    ::Valve::VR::InteractionSystem::Longbow::Handedness currentHandGuess;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Longbow::Handedness) == 0x4);
    // private System.Single timeOfPossibleHandSwitch
    // Size: 0x4
    // Offset: 0x1C
    float timeOfPossibleHandSwitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeBeforeConfirmingHandSwitch
    // Size: 0x4
    // Offset: 0x20
    float timeBeforeConfirmingHandSwitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean possibleHandSwitch
    // Size: 0x1
    // Offset: 0x24
    bool possibleHandSwitch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: possibleHandSwitch and: pivotTransform
    char __padding3[0x3] = {};
    // public UnityEngine.Transform pivotTransform
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* pivotTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform handleTransform
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Transform* handleTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private Valve.VR.InteractionSystem.Hand hand
    // Size: 0x8
    // Offset: 0x38
    ::Valve::VR::InteractionSystem::Hand* hand;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Hand*) == 0x8);
    // private Valve.VR.InteractionSystem.ArrowHand arrowHand
    // Size: 0x8
    // Offset: 0x40
    ::Valve::VR::InteractionSystem::ArrowHand* arrowHand;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::ArrowHand*) == 0x8);
    // public UnityEngine.Transform nockTransform
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* nockTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform nockRestTransform
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* nockRestTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Boolean autoSpawnArrowHand
    // Size: 0x1
    // Offset: 0x58
    bool autoSpawnArrowHand;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoSpawnArrowHand and: arrowHandItemPackage
    char __padding10[0x7] = {};
    // public Valve.VR.InteractionSystem.ItemPackage arrowHandItemPackage
    // Size: 0x8
    // Offset: 0x60
    ::Valve::VR::InteractionSystem::ItemPackage* arrowHandItemPackage;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::ItemPackage*) == 0x8);
    // public UnityEngine.GameObject arrowHandPrefab
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* arrowHandPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Boolean nocked
    // Size: 0x1
    // Offset: 0x70
    bool nocked;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean pulled
    // Size: 0x1
    // Offset: 0x71
    bool pulled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: pulled and: nockDistanceTravelled
    char __padding14[0x2] = {};
    // private System.Single nockDistanceTravelled
    // Size: 0x4
    // Offset: 0x74
    float nockDistanceTravelled;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single hapticDistanceThreshold
    // Size: 0x4
    // Offset: 0x78
    float hapticDistanceThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastTickDistance
    // Size: 0x4
    // Offset: 0x7C
    float lastTickDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 bowLeftVector
    // Size: 0xC
    // Offset: 0x80
    ::UnityEngine::Vector3 bowLeftVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single arrowMinVelocity
    // Size: 0x4
    // Offset: 0x8C
    float arrowMinVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single arrowMaxVelocity
    // Size: 0x4
    // Offset: 0x90
    float arrowMaxVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single arrowVelocity
    // Size: 0x4
    // Offset: 0x94
    float arrowVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single minStrainTickTime
    // Size: 0x4
    // Offset: 0x98
    float minStrainTickTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single maxStrainTickTime
    // Size: 0x4
    // Offset: 0x9C
    float maxStrainTickTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single nextStrainTick
    // Size: 0x4
    // Offset: 0xA0
    float nextStrainTick;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean lerpBackToZeroRotation
    // Size: 0x1
    // Offset: 0xA4
    bool lerpBackToZeroRotation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: lerpBackToZeroRotation and: lerpStartTime
    char __padding25[0x3] = {};
    // private System.Single lerpStartTime
    // Size: 0x4
    // Offset: 0xA8
    float lerpStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lerpDuration
    // Size: 0x4
    // Offset: 0xAC
    float lerpDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion lerpStartRotation
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Quaternion lerpStartRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Single nockLerpStartTime
    // Size: 0x4
    // Offset: 0xC0
    float nockLerpStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Quaternion nockLerpStartRotation
    // Size: 0x10
    // Offset: 0xC4
    ::UnityEngine::Quaternion nockLerpStartRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public System.Single drawOffset
    // Size: 0x4
    // Offset: 0xD4
    float drawOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Valve.VR.InteractionSystem.LinearMapping bowDrawLinearMapping
    // Size: 0x8
    // Offset: 0xD8
    ::Valve::VR::InteractionSystem::LinearMapping* bowDrawLinearMapping;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::LinearMapping*) == 0x8);
    // private System.Boolean deferNewPoses
    // Size: 0x1
    // Offset: 0xE0
    bool deferNewPoses;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: deferNewPoses and: lateUpdatePos
    char __padding33[0x3] = {};
    // private UnityEngine.Vector3 lateUpdatePos
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 lateUpdatePos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion lateUpdateRot
    // Size: 0x10
    // Offset: 0xF0
    ::UnityEngine::Quaternion lateUpdateRot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public Valve.VR.InteractionSystem.SoundBowClick drawSound
    // Size: 0x8
    // Offset: 0x100
    ::Valve::VR::InteractionSystem::SoundBowClick* drawSound;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::SoundBowClick*) == 0x8);
    // private System.Single drawTension
    // Size: 0x4
    // Offset: 0x108
    float drawTension;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: drawTension and: arrowSlideSound
    char __padding37[0x4] = {};
    // public Valve.VR.InteractionSystem.SoundPlayOneshot arrowSlideSound
    // Size: 0x8
    // Offset: 0x110
    ::Valve::VR::InteractionSystem::SoundPlayOneshot* arrowSlideSound;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::SoundPlayOneshot*) == 0x8);
    // public Valve.VR.InteractionSystem.SoundPlayOneshot releaseSound
    // Size: 0x8
    // Offset: 0x118
    ::Valve::VR::InteractionSystem::SoundPlayOneshot* releaseSound;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::SoundPlayOneshot*) == 0x8);
    // public Valve.VR.InteractionSystem.SoundPlayOneshot nockSound
    // Size: 0x8
    // Offset: 0x120
    ::Valve::VR::InteractionSystem::SoundPlayOneshot* nockSound;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::SoundPlayOneshot*) == 0x8);
    // private SteamVR_Events/Action newPosesAppliedAction
    // Size: 0x8
    // Offset: 0x128
    ::GlobalNamespace::SteamVR_Events::Action* newPosesAppliedAction;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static private System.Single minPull
    static constexpr const float minPull = 0.05;
    // Get static field: static private System.Single minPull
    static float _get_minPull();
    // Set static field: static private System.Single minPull
    static void _set_minPull(float value);
    // static field const value: static private System.Single maxPull
    static constexpr const float maxPull = 0.5;
    // Get static field: static private System.Single maxPull
    static float _get_maxPull();
    // Set static field: static private System.Single maxPull
    static void _set_maxPull(float value);
