// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: SteamVR_Events
#include "GlobalNamespace/SteamVR_Events.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR::InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Hand
  class Hand;
  // Forward declaring type: Player
  class Player;
  // Forward declaring type: TeleportArc
  class TeleportArc;
  // Forward declaring type: TeleportMarkerBase
  class TeleportMarkerBase;
  // Forward declaring type: Interactable
  class Interactable;
  // Forward declaring type: AllowTeleportWhileAttachedToHand
  class AllowTeleportWhileAttachedToHand;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: LineRenderer
  class LineRenderer;
  // Forward declaring type: Coroutine
  class Coroutine;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction`1<T0>
  template<typename T0>
  class UnityAction_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Forward declaring type: Teleport
  class Teleport;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Valve::VR::InteractionSystem::Teleport);
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::InteractionSystem::Teleport*, "Valve.VR.InteractionSystem", "Teleport");
// Type namespace: Valve.VR.InteractionSystem
namespace Valve::VR::InteractionSystem {
  // Size: 0x248
  #pragma pack(push, 1)
  // Autogenerated type: Valve.VR.InteractionSystem.Teleport
  // [TokenAttribute] Offset: FFFFFFFF
  class Teleport : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::Valve::VR::InteractionSystem::Teleport::$TeleportHintCoroutine$d__105
    class $TeleportHintCoroutine$d__105;
    public:
    // public UnityEngine.LayerMask traceLayerMask
    // Size: 0x4
    // Offset: 0x18
    ::UnityEngine::LayerMask traceLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public UnityEngine.LayerMask floorFixupTraceLayerMask
    // Size: 0x4
    // Offset: 0x1C
    ::UnityEngine::LayerMask floorFixupTraceLayerMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // public System.Single floorFixupMaximumTraceDistance
    // Size: 0x4
    // Offset: 0x20
    float floorFixupMaximumTraceDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: floorFixupMaximumTraceDistance and: areaVisibleMaterial
    char __padding2[0x4] = {};
    // public UnityEngine.Material areaVisibleMaterial
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Material* areaVisibleMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material areaLockedMaterial
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Material* areaLockedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material areaHighlightedMaterial
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Material* areaHighlightedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material pointVisibleMaterial
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Material* pointVisibleMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material pointLockedMaterial
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Material* pointLockedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material pointHighlightedMaterial
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Material* pointHighlightedMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Transform destinationReticleTransform
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Transform* destinationReticleTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform invalidReticleTransform
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* invalidReticleTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.GameObject playAreaPreviewCorner
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* playAreaPreviewCorner;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject playAreaPreviewSide
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* playAreaPreviewSide;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.Color pointerValidColor
    // Size: 0x10
    // Offset: 0x78
    ::UnityEngine::Color pointerValidColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color pointerInvalidColor
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::Color pointerInvalidColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public UnityEngine.Color pointerLockedColor
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Color pointerLockedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Boolean showPlayAreaMarker
    // Size: 0x1
    // Offset: 0xA8
    bool showPlayAreaMarker;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showPlayAreaMarker and: teleportFadeTime
    char __padding16[0x3] = {};
    // public System.Single teleportFadeTime
    // Size: 0x4
    // Offset: 0xAC
    float teleportFadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single meshFadeTime
    // Size: 0x4
    // Offset: 0xB0
    float meshFadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single arcDistance
    // Size: 0x4
    // Offset: 0xB4
    float arcDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0xADE768
    // public UnityEngine.Transform onActivateObjectTransform
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Transform* onActivateObjectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.Transform onDeactivateObjectTransform
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Transform* onDeactivateObjectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public System.Single activateObjectTime
    // Size: 0x4
    // Offset: 0xC8
    float activateObjectTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single deactivateObjectTime
    // Size: 0x4
    // Offset: 0xCC
    float deactivateObjectTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0xADE7A0
    // public UnityEngine.AudioSource pointerAudioSource
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::AudioSource* pointerAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource loopingAudioSource
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::AudioSource* loopingAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource headAudioSource
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::AudioSource* headAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // public UnityEngine.AudioSource reticleAudioSource
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::AudioSource* reticleAudioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // [HeaderAttribute] Offset: 0xADE7D8
    // public UnityEngine.AudioClip teleportSound
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::AudioClip* teleportSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip pointerStartSound
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::AudioClip* pointerStartSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip pointerLoopSound
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::AudioClip* pointerLoopSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip pointerStopSound
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::AudioClip* pointerStopSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip goodHighlightSound
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::AudioClip* goodHighlightSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // public UnityEngine.AudioClip badHighlightSound
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::AudioClip* badHighlightSound;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioClip*) == 0x8);
    // [HeaderAttribute] Offset: 0xADE810
    // public System.Boolean debugFloor
    // Size: 0x1
    // Offset: 0x120
    bool debugFloor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showOffsetReticle
    // Size: 0x1
    // Offset: 0x121
    bool showOffsetReticle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showOffsetReticle and: offsetReticleTransform
    char __padding35[0x6] = {};
    // public UnityEngine.Transform offsetReticleTransform
    // Size: 0x8
    // Offset: 0x128
    ::UnityEngine::Transform* offsetReticleTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.MeshRenderer floorDebugSphere
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::MeshRenderer* floorDebugSphere;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // public UnityEngine.LineRenderer floorDebugLine
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::LineRenderer* floorDebugLine;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // private UnityEngine.LineRenderer pointerLineRenderer
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::LineRenderer* pointerLineRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::LineRenderer*) == 0x8);
    // private UnityEngine.GameObject teleportPointerObject
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::GameObject* teleportPointerObject;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Transform pointerStartTransform
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Transform* pointerStartTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private Valve.VR.InteractionSystem.Hand pointerHand
    // Size: 0x8
    // Offset: 0x158
    ::Valve::VR::InteractionSystem::Hand* pointerHand;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Hand*) == 0x8);
    // private Valve.VR.InteractionSystem.Player player
    // Size: 0x8
    // Offset: 0x160
    ::Valve::VR::InteractionSystem::Player* player;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Player*) == 0x8);
    // private Valve.VR.InteractionSystem.TeleportArc teleportArc
    // Size: 0x8
    // Offset: 0x168
    ::Valve::VR::InteractionSystem::TeleportArc* teleportArc;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::TeleportArc*) == 0x8);
    // private System.Boolean visible
    // Size: 0x1
    // Offset: 0x170
    bool visible;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: visible and: teleportMarkers
    char __padding45[0x7] = {};
    // private Valve.VR.InteractionSystem.TeleportMarkerBase[] teleportMarkers
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::Valve::VR::InteractionSystem::TeleportMarkerBase*> teleportMarkers;
    // Field size check
    static_assert(sizeof(::ArrayW<::Valve::VR::InteractionSystem::TeleportMarkerBase*>) == 0x8);
    // private Valve.VR.InteractionSystem.TeleportMarkerBase pointedAtTeleportMarker
    // Size: 0x8
    // Offset: 0x180
    ::Valve::VR::InteractionSystem::TeleportMarkerBase* pointedAtTeleportMarker;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::TeleportMarkerBase*) == 0x8);
    // private Valve.VR.InteractionSystem.TeleportMarkerBase teleportingToMarker
    // Size: 0x8
    // Offset: 0x188
    ::Valve::VR::InteractionSystem::TeleportMarkerBase* teleportingToMarker;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::TeleportMarkerBase*) == 0x8);
    // private UnityEngine.Vector3 pointedAtPosition
    // Size: 0xC
    // Offset: 0x190
    ::UnityEngine::Vector3 pointedAtPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 prevPointedAtPosition
    // Size: 0xC
    // Offset: 0x19C
    ::UnityEngine::Vector3 prevPointedAtPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean teleporting
    // Size: 0x1
    // Offset: 0x1A8
    bool teleporting;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: teleporting and: currentFadeTime
    char __padding51[0x3] = {};
    // private System.Single currentFadeTime
    // Size: 0x4
    // Offset: 0x1AC
    float currentFadeTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single meshAlphaPercent
    // Size: 0x4
    // Offset: 0x1B0
    float meshAlphaPercent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pointerShowStartTime
    // Size: 0x4
    // Offset: 0x1B4
    float pointerShowStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single pointerHideStartTime
    // Size: 0x4
    // Offset: 0x1B8
    float pointerHideStartTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean meshFading
    // Size: 0x1
    // Offset: 0x1BC
    bool meshFading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: meshFading and: fullTintAlpha
    char __padding56[0x3] = {};
    // private System.Single fullTintAlpha
    // Size: 0x4
    // Offset: 0x1C0
    float fullTintAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single invalidReticleMinScale
    // Size: 0x4
    // Offset: 0x1C4
    float invalidReticleMinScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single invalidReticleMaxScale
    // Size: 0x4
    // Offset: 0x1C8
    float invalidReticleMaxScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single invalidReticleMinScaleDistance
    // Size: 0x4
    // Offset: 0x1CC
    float invalidReticleMinScaleDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single invalidReticleMaxScaleDistance
    // Size: 0x4
    // Offset: 0x1D0
    float invalidReticleMaxScaleDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 invalidReticleScale
    // Size: 0xC
    // Offset: 0x1D4
    ::UnityEngine::Vector3 invalidReticleScale;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion invalidReticleTargetRotation
    // Size: 0x10
    // Offset: 0x1E0
    ::UnityEngine::Quaternion invalidReticleTargetRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Transform playAreaPreviewTransform
    // Size: 0x8
    // Offset: 0x1F0
    ::UnityEngine::Transform* playAreaPreviewTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Transform[] playAreaPreviewCorners
    // Size: 0x8
    // Offset: 0x1F8
    ::ArrayW<::UnityEngine::Transform*> playAreaPreviewCorners;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private UnityEngine.Transform[] playAreaPreviewSides
    // Size: 0x8
    // Offset: 0x200
    ::ArrayW<::UnityEngine::Transform*> playAreaPreviewSides;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Transform*>) == 0x8);
    // private System.Single loopingAudioMaxVolume
    // Size: 0x4
    // Offset: 0x208
    float loopingAudioMaxVolume;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: loopingAudioMaxVolume and: hintCoroutine
    char __padding67[0x4] = {};
    // private UnityEngine.Coroutine hintCoroutine
    // Size: 0x8
    // Offset: 0x210
    ::UnityEngine::Coroutine* hintCoroutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // private System.Boolean originalHoverLockState
    // Size: 0x1
    // Offset: 0x218
    bool originalHoverLockState;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: originalHoverLockState and: originalHoveringInteractable
    char __padding69[0x7] = {};
    // private Valve.VR.InteractionSystem.Interactable originalHoveringInteractable
    // Size: 0x8
    // Offset: 0x220
    ::Valve::VR::InteractionSystem::Interactable* originalHoveringInteractable;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::Interactable*) == 0x8);
    // private Valve.VR.InteractionSystem.AllowTeleportWhileAttachedToHand allowTeleportWhileAttached
    // Size: 0x8
    // Offset: 0x228
    ::Valve::VR::InteractionSystem::AllowTeleportWhileAttachedToHand* allowTeleportWhileAttached;
    // Field size check
    static_assert(sizeof(::Valve::VR::InteractionSystem::AllowTeleportWhileAttachedToHand*) == 0x8);
    // private UnityEngine.Vector3 startingFeetOffset
    // Size: 0xC
    // Offset: 0x230
    ::UnityEngine::Vector3 startingFeetOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean movedFeetFarEnough
    // Size: 0x1
    // Offset: 0x23C
    bool movedFeetFarEnough;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: movedFeetFarEnough and: chaperoneInfoInitializedAction
    char __padding73[0x3] = {};
    // private SteamVR_Events/Action chaperoneInfoInitializedAction
    // Size: 0x8
    // Offset: 0x240
    ::GlobalNamespace::SteamVR_Events::Action* chaperoneInfoInitializedAction;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SteamVR_Events::Action*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public SteamVR_Events/Event`1<System.Single> ChangeScene
    static ::GlobalNamespace::SteamVR_Events::Event_1<float>* _get_ChangeScene();
    // Set static field: static public SteamVR_Events/Event`1<System.Single> ChangeScene
    static void _set_ChangeScene(::GlobalNamespace::SteamVR_Events::Event_1<float>* value);
    // Get static field: static public SteamVR_Events/Event`1<Valve.VR.InteractionSystem.TeleportMarkerBase> Player
    static ::GlobalNamespace::SteamVR_Events::Event_1<::Valve::VR::InteractionSystem::TeleportMarkerBase*>* _get_Player();
