// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: CodeStage.AntiCheat.Detectors.ActDetectorBase
#include "CodeStage/AntiCheat/Detectors/ActDetectorBase.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
  // Forward declaring type: SocketAsyncEventArgs
  class SocketAsyncEventArgs;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: IPEndPoint
  class IPEndPoint;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction
  class UnityAction;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
}
// Completed forward declares
// Type namespace: CodeStage.AntiCheat.Detectors
namespace CodeStage::AntiCheat::Detectors {
  // Forward declaring type: TimeCheatingDetector
  class TimeCheatingDetector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::CodeStage::AntiCheat::Detectors::TimeCheatingDetector);
DEFINE_IL2CPP_ARG_TYPE(::CodeStage::AntiCheat::Detectors::TimeCheatingDetector*, "CodeStage.AntiCheat.Detectors", "TimeCheatingDetector");
// Type namespace: CodeStage.AntiCheat.Detectors
namespace CodeStage::AntiCheat::Detectors {
  // Size: 0x90
  #pragma pack(push, 1)
  // Autogenerated type: CodeStage.AntiCheat.Detectors.TimeCheatingDetector
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: AC22FC
  class TimeCheatingDetector : public ::CodeStage::AntiCheat::Detectors::ActDetectorBase {
    public:
    // Writing base type padding for base size: 0x33 to desired offset: 0x38
    char ___base_padding[0x5] = {};
    public:
    // private readonly System.DateTime date1900
    // Size: 0x8
    // Offset: 0x38
    ::System::DateTime date1900;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // [TooltipAttribute] Offset: 0xAC6B88
    // [RangeAttribute] Offset: 0xAC6B88
    // public System.Int32 interval
    // Size: 0x4
    // Offset: 0x40
    int interval;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xAC6BE0
    // public System.Int32 threshold
    // Size: 0x4
    // Offset: 0x44
    int threshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Net.Sockets.Socket asyncSocket
    // Size: 0x8
    // Offset: 0x48
    ::System::Net::Sockets::Socket* asyncSocket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // private System.Action`1<System.Double> getOnlineTimeCallback
    // Size: 0x8
    // Offset: 0x50
    ::System::Action_1<double>* getOnlineTimeCallback;
    // Field size check
    static_assert(sizeof(::System::Action_1<double>*) == 0x8);
    // private System.String targetHost
    // Size: 0x8
    // Offset: 0x58
    ::StringW targetHost;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Byte[] targetIP
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<uint8_t> targetIP;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Net.IPEndPoint targetEndpoint
    // Size: 0x8
    // Offset: 0x68
    ::System::Net::IPEndPoint* targetEndpoint;
    // Field size check
    static_assert(sizeof(::System::Net::IPEndPoint*) == 0x8);
    // private System.Byte[] ntpData
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<uint8_t> ntpData;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Net.Sockets.SocketAsyncEventArgs connectArgs
    // Size: 0x8
    // Offset: 0x78
    ::System::Net::Sockets::SocketAsyncEventArgs* connectArgs;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketAsyncEventArgs*) == 0x8);
    // private System.Net.Sockets.SocketAsyncEventArgs sendArgs
    // Size: 0x8
    // Offset: 0x80
    ::System::Net::Sockets::SocketAsyncEventArgs* sendArgs;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketAsyncEventArgs*) == 0x8);
    // private System.Net.Sockets.SocketAsyncEventArgs receiveArgs
    // Size: 0x8
    // Offset: 0x88
    ::System::Net::Sockets::SocketAsyncEventArgs* receiveArgs;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketAsyncEventArgs*) == 0x8);
    public:
    // static field const value: static System.String COMPONENT_NAME
    static constexpr const char* COMPONENT_NAME = "Time Cheating Detector";
    // Get static field: static System.String COMPONENT_NAME
    static ::StringW _get_COMPONENT_NAME();
    // Set static field: static System.String COMPONENT_NAME
    static void _set_COMPONENT_NAME(::StringW value);
    // static field const value: static private System.String FINAL_LOG_PREFIX
    static constexpr const char* FINAL_LOG_PREFIX = "[ACTk] Time Cheating Detector: ";
    // Get static field: static private System.String FINAL_LOG_PREFIX
    static ::StringW _get_FINAL_LOG_PREFIX();
    // Set static field: static private System.String FINAL_LOG_PREFIX
    static void _set_FINAL_LOG_PREFIX(::StringW value);
