// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: CodeStage.AntiCheat.Detectors.ActDetectorBase
#include "CodeStage/AntiCheat/Detectors/ActDetectorBase.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: CodeStage::AntiCheat::Detectors
namespace CodeStage::AntiCheat::Detectors {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: WaitForEndOfFrame
  class WaitForEndOfFrame;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: CharacterController
  class CharacterController;
  // Forward declaring type: Color32
  struct Color32;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityAction
  class UnityAction;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: CodeStage.AntiCheat.Detectors
namespace CodeStage::AntiCheat::Detectors {
  // Forward declaring type: WallHackDetector
  class WallHackDetector;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::CodeStage::AntiCheat::Detectors::WallHackDetector);
DEFINE_IL2CPP_ARG_TYPE(::CodeStage::AntiCheat::Detectors::WallHackDetector*, "CodeStage.AntiCheat.Detectors", "WallHackDetector");
// Type namespace: CodeStage.AntiCheat.Detectors
namespace CodeStage::AntiCheat::Detectors {
  // Size: 0x101
  #pragma pack(push, 1)
  // Autogenerated type: CodeStage.AntiCheat.Detectors.WallHackDetector
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: AC2334
  class WallHackDetector : public ::CodeStage::AntiCheat::Detectors::ActDetectorBase {
    public:
    // Writing base type padding for base size: 0x33 to desired offset: 0x34
    char ___base_padding[0x1] = {};
    // Nested type: ::CodeStage::AntiCheat::Detectors::WallHackDetector::$InitDetector$d__78
    class $InitDetector$d__78;
    // Nested type: ::CodeStage::AntiCheat::Detectors::WallHackDetector::$CaptureFrame$d__83
    class $CaptureFrame$d__83;
    public:
    // private readonly UnityEngine.Vector3 rigidPlayerVelocity
    // Size: 0xC
    // Offset: 0x34
    ::UnityEngine::Vector3 rigidPlayerVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private readonly UnityEngine.WaitForEndOfFrame waitForEndOfFrame
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::WaitForEndOfFrame* waitForEndOfFrame;
    // Field size check
    static_assert(sizeof(::UnityEngine::WaitForEndOfFrame*) == 0x8);
    // [TooltipAttribute] Offset: 0xAC6C28
    // private System.Boolean checkRigidbody
    // Size: 0x1
    // Offset: 0x48
    bool checkRigidbody;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAC6C74
    // private System.Boolean checkController
    // Size: 0x1
    // Offset: 0x49
    bool checkController;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAC6CC0
    // private System.Boolean checkWireframe
    // Size: 0x1
    // Offset: 0x4A
    bool checkWireframe;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAC6D0C
    // private System.Boolean checkRaycast
    // Size: 0x1
    // Offset: 0x4B
    bool checkRaycast;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAC6D58
    // [RangeAttribute] Offset: 0xAC6D58
    // public System.Int32 wireframeDelay
    // Size: 0x4
    // Offset: 0x4C
    int wireframeDelay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xAC6DB0
    // [RangeAttribute] Offset: 0xAC6DB0
    // public System.Int32 raycastDelay
    // Size: 0x4
    // Offset: 0x50
    int raycastDelay;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xAC6E08
    // public UnityEngine.Vector3 spawnPosition
    // Size: 0xC
    // Offset: 0x54
    ::UnityEngine::Vector3 spawnPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xAC6E40
    // public System.Byte maxFalsePositives
    // Size: 0x1
    // Offset: 0x60
    uint8_t maxFalsePositives;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: maxFalsePositives and: serviceContainer
    char __padding9[0x7] = {};
    // private UnityEngine.GameObject serviceContainer
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::GameObject* serviceContainer;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject solidWall
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* solidWall;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject thinWall
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* thinWall;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Camera wfCamera
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Camera* wfCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.MeshRenderer foregroundRenderer
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::MeshRenderer* foregroundRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.MeshRenderer backgroundRenderer
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::MeshRenderer* backgroundRenderer;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.Color wfColor1
    // Size: 0x10
    // Offset: 0x98
    ::UnityEngine::Color wfColor1;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color wfColor2
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Color wfColor2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Shader wfShader
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::Shader* wfShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Material wfMaterial
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Material* wfMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Texture2D shaderTexture
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Texture2D* shaderTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D targetTexture
    // Size: 0x8
    // Offset: 0xD0
    ::UnityEngine::Texture2D* targetTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.RenderTexture renderTexture
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::RenderTexture* renderTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private System.Int32 whLayer
    // Size: 0x4
    // Offset: 0xE0
    int whLayer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 raycastMask
    // Size: 0x4
    // Offset: 0xE4
    int raycastMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Rigidbody rigidPlayer
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Rigidbody* rigidPlayer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // private UnityEngine.CharacterController charControllerPlayer
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::CharacterController* charControllerPlayer;
    // Field size check
    static_assert(sizeof(::UnityEngine::CharacterController*) == 0x8);
    // private System.Single charControllerVelocity
    // Size: 0x4
    // Offset: 0xF8
    float charControllerVelocity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Byte rigidbodyDetections
    // Size: 0x1
    // Offset: 0xFC
    uint8_t rigidbodyDetections;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte controllerDetections
    // Size: 0x1
    // Offset: 0xFD
    uint8_t controllerDetections;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte wireframeDetections
    // Size: 0x1
    // Offset: 0xFE
    uint8_t wireframeDetections;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte raycastDetections
    // Size: 0x1
    // Offset: 0xFF
    uint8_t raycastDetections;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean wireframeDetected
    // Size: 0x1
    // Offset: 0x100
    bool wireframeDetected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // static field const value: static System.String COMPONENT_NAME
    static constexpr const char* COMPONENT_NAME = "WallHack Detector";
    // Get static field: static System.String COMPONENT_NAME
    static ::StringW _get_COMPONENT_NAME();
    // Set static field: static System.String COMPONENT_NAME
    static void _set_COMPONENT_NAME(::StringW value);
    // static field const value: static System.String FINAL_LOG_PREFIX
    static constexpr const char* FINAL_LOG_PREFIX = "[ACTk] WallHack Detector: ";
    // Get static field: static System.String FINAL_LOG_PREFIX
    static ::StringW _get_FINAL_LOG_PREFIX();
    // Set static field: static System.String FINAL_LOG_PREFIX
    static void _set_FINAL_LOG_PREFIX(::StringW value);
    // static field const value: static private System.String SERVICE_CONTAINER_NAME
