// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Forward declaring type: SendPacketsElement
  class SendPacketsElement;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::Sockets::SendPacketsElement);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::Sockets::SendPacketsElement*, "System.Net.Sockets", "SendPacketsElement");
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Size: 0x29
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Sockets.SendPacketsElement
  // [TokenAttribute] Offset: FFFFFFFF
  class SendPacketsElement : public ::Il2CppObject {
    public:
    public:
    // System.String m_FilePath
    // Size: 0x8
    // Offset: 0x10
    ::StringW m_FilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Byte[] m_Buffer
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<uint8_t> m_Buffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Int32 m_Offset
    // Size: 0x4
    // Offset: 0x20
    int m_Offset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Int32 m_Count
    // Size: 0x4
    // Offset: 0x24
    int m_Count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_endOfPacket
    // Size: 0x1
    // Offset: 0x28
    bool m_endOfPacket;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: System.String m_FilePath
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_FilePath();
    // Get instance field reference: System.Byte[] m_Buffer
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn_m_Buffer();
    // Get instance field reference: System.Int32 m_Offset
    [[deprecated("Use field access instead!")]] int& dyn_m_Offset();
    // Get instance field reference: System.Int32 m_Count
    [[deprecated("Use field access instead!")]] int& dyn_m_Count();
    // Get instance field reference: private System.Boolean m_endOfPacket
    [[deprecated("Use field access instead!")]] bool& dyn_m_endOfPacket();
  }; // System.Net.Sockets.SendPacketsElement
  #pragma pack(pop)
  static check_size<sizeof(SendPacketsElement), 40 + sizeof(bool)> __System_Net_Sockets_SendPacketsElementSizeCheck;
  static_assert(sizeof(SendPacketsElement) == 0x29);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
