// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.EventArgs
#include "System/EventArgs.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.ArraySegment`1
#include "System/ArraySegment_1.hpp"
// Including type: System.Net.Sockets.SocketAsyncOperation
#include "System/Net/Sockets/SocketAsyncOperation.hpp"
// Including type: System.Net.Sockets.IPPacketInformation
#include "System/Net/Sockets/IPPacketInformation.hpp"
// Including type: System.Net.Sockets.TransmitFileOptions
#include "System/Net/Sockets/TransmitFileOptions.hpp"
// Including type: System.Net.Sockets.SocketError
#include "System/Net/Sockets/SocketError.hpp"
// Including type: System.Net.Sockets.SocketFlags
#include "System/Net/Sockets/SocketFlags.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Net
namespace System::Net {
  // Forward declaring type: EndPoint
  class EndPoint;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: Socket
  class Socket;
  // Forward declaring type: SocketAsyncResult
  class SocketAsyncResult;
  // Forward declaring type: SendPacketsElement
  class SendPacketsElement;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Skipping declaration: IList`1 because it is already included!
}
// Completed forward declares
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Forward declaring type: SocketAsyncEventArgs
  class SocketAsyncEventArgs;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::System::Net::Sockets::SocketAsyncEventArgs);
DEFINE_IL2CPP_ARG_TYPE(::System::Net::Sockets::SocketAsyncEventArgs*, "System.Net.Sockets", "SocketAsyncEventArgs");
// Type namespace: System.Net.Sockets
namespace System::Net::Sockets {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: System.Net.Sockets.SocketAsyncEventArgs
  // [TokenAttribute] Offset: FFFFFFFF
  class SocketAsyncEventArgs : public ::System::EventArgs/*, public ::System::IDisposable*/ {
    public:
    public:
    // private System.Boolean disposed
    // Size: 0x1
    // Offset: 0x10
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disposed and: in_progress
    char __padding0[0x3] = {};
    // System.Int32 in_progress
    // Size: 0x4
    // Offset: 0x14
    int in_progress;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Net.EndPoint remote_ep
    // Size: 0x8
    // Offset: 0x18
    ::System::Net::EndPoint* remote_ep;
    // Field size check
    static_assert(sizeof(::System::Net::EndPoint*) == 0x8);
    // System.Net.Sockets.Socket current_socket
    // Size: 0x8
    // Offset: 0x20
    ::System::Net::Sockets::Socket* current_socket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // System.Net.Sockets.SocketAsyncResult socket_async_result
    // Size: 0x8
    // Offset: 0x28
    ::System::Net::Sockets::SocketAsyncResult* socket_async_result;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketAsyncResult*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA66A44
    // private System.Exception <ConnectByNameError>k__BackingField
    // Size: 0x8
    // Offset: 0x30
    ::System::Exception* ConnectByNameError;
    // Field size check
    static_assert(sizeof(::System::Exception*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA66A54
    // private System.Net.Sockets.Socket <AcceptSocket>k__BackingField
    // Size: 0x8
    // Offset: 0x38
    ::System::Net::Sockets::Socket* AcceptSocket;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::Socket*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA66A64
    // private System.Byte[] <Buffer>k__BackingField
    // Size: 0x8
    // Offset: 0x40
    ::ArrayW<uint8_t> Buffer;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Collections.Generic.IList`1<System.ArraySegment`1<System.Byte>> m_BufferList
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::IList_1<::System::ArraySegment_1<uint8_t>>* m_BufferList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::IList_1<::System::ArraySegment_1<uint8_t>>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA66A74
    // private System.Int32 <BytesTransferred>k__BackingField
    // Size: 0x4
    // Offset: 0x50
    int BytesTransferred;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66A84
    // private System.Int32 <Count>k__BackingField
    // Size: 0x4
    // Offset: 0x54
    int Count;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66A94
    // private System.Boolean <DisconnectReuseSocket>k__BackingField
    // Size: 0x1
    // Offset: 0x58
    bool DisconnectReuseSocket;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: DisconnectReuseSocket and: LastOperation
    char __padding11[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xA66AA4
    // private System.Net.Sockets.SocketAsyncOperation <LastOperation>k__BackingField
    // Size: 0x4
    // Offset: 0x5C
    ::System::Net::Sockets::SocketAsyncOperation LastOperation;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketAsyncOperation) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66AB4
    // private System.Int32 <Offset>k__BackingField
    // Size: 0x4
    // Offset: 0x60
    int Offset;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: Offset and: ReceiveMessageFromPacketInfo
    char __padding13[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xA66AC4
    // private System.Net.Sockets.IPPacketInformation <ReceiveMessageFromPacketInfo>k__BackingField
    // Size: 0xC
    // Offset: 0x68
    ::System::Net::Sockets::IPPacketInformation ReceiveMessageFromPacketInfo;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::IPPacketInformation) == 0xC);
    // Padding between fields: ReceiveMessageFromPacketInfo and: SendPacketsElements
    char __padding14[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xA66AD4
    // private System.Net.Sockets.SendPacketsElement[] <SendPacketsElements>k__BackingField
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::System::Net::Sockets::SendPacketsElement*> SendPacketsElements;
    // Field size check
    static_assert(sizeof(::ArrayW<::System::Net::Sockets::SendPacketsElement*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA66AE4
    // private System.Net.Sockets.TransmitFileOptions <SendPacketsFlags>k__BackingField
    // Size: 0x4
    // Offset: 0x80
    ::System::Net::Sockets::TransmitFileOptions SendPacketsFlags;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::TransmitFileOptions) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66AF4
    // private System.Int32 <SendPacketsSendSize>k__BackingField
    // Size: 0x4
    // Offset: 0x84
    int SendPacketsSendSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66B04
    // private System.Net.Sockets.SocketError <SocketError>k__BackingField
    // Size: 0x4
    // Offset: 0x88
    ::System::Net::Sockets::SocketError SocketError;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketError) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66B14
    // private System.Net.Sockets.SocketFlags <SocketFlags>k__BackingField
    // Size: 0x4
    // Offset: 0x8C
    ::System::Net::Sockets::SocketFlags SocketFlags;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::SocketFlags) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xA66B24
    // private System.Object <UserToken>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::Il2CppObject* UserToken;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xA66B34
    // private System.Boolean <PolicyRestricted>k__BackingField
    // Size: 0x1
    // Offset: 0x98
    bool PolicyRestricted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: PolicyRestricted and: Completed
    char __padding21[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xA66B44
    // private System.EventHandler`1<System.Net.Sockets.SocketAsyncEventArgs> Completed
    // Size: 0x8
    // Offset: 0xA0
    ::System::EventHandler_1<::System::Net::Sockets::SocketAsyncEventArgs*>* Completed;
    // Field size check
    static_assert(sizeof(::System::EventHandler_1<::System::Net::Sockets::SocketAsyncEventArgs*>*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: private System.Boolean disposed
    [[deprecated("Use field access instead!")]] bool& dyn_disposed();
    // Get instance field reference: System.Int32 in_progress
    [[deprecated("Use field access instead!")]] int& dyn_in_progress();
    // Get instance field reference: System.Net.EndPoint remote_ep
    [[deprecated("Use field access instead!")]] ::System::Net::EndPoint*& dyn_remote_ep();
    // Get instance field reference: System.Net.Sockets.Socket current_socket
