// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InventoryItemInstance
  class InventoryItemInstance;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: NetEntity
  class NetEntity;
  // Forward declaring type: ItemContainer
  class ItemContainer;
  // Forward declaring type: WorldMenu
  class WorldMenu;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: TextAsset
  class TextAsset;
}
// Completed forward declares
// Type namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: AuctionChest
  class AuctionChest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExtUI::AuctionChest);
DEFINE_IL2CPP_ARG_TYPE(::ExtUI::AuctionChest*, "ExtUI", "AuctionChest");
// Type namespace: ExtUI
namespace ExtUI {
  // Size: 0x98
  #pragma pack(push, 1)
  // Autogenerated type: ExtUI.AuctionChest
  // [TokenAttribute] Offset: FFFFFFFF
  class AuctionChest : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::ExtUI::AuctionChest::$$c__DisplayClass40_0
    class $$c__DisplayClass40_0;
    // Nested type: ::ExtUI::AuctionChest::$$c__DisplayClass41_0
    class $$c__DisplayClass41_0;
    public:
    // public System.String OrbusNetComponent
    // Size: 0x8
    // Offset: 0x18
    ::StringW OrbusNetComponent;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private MagicalActual.NetEntity myEntity
    // Size: 0x8
    // Offset: 0x20
    ::MagicalActual::NetEntity* myEntity;
    // Field size check
    static_assert(sizeof(::MagicalActual::NetEntity*) == 0x8);
    // private MagicalActual.ItemContainer myItemContainer
    // Size: 0x8
    // Offset: 0x28
    ::MagicalActual::ItemContainer* myItemContainer;
    // Field size check
    static_assert(sizeof(::MagicalActual::ItemContainer*) == 0x8);
    // public UnityEngine.GameObject ownerMenuPoint
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::GameObject* ownerMenuPoint;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private MagicalActual.WorldMenu interactionMenu
    // Size: 0x8
    // Offset: 0x38
    ::MagicalActual::WorldMenu* interactionMenu;
    // Field size check
    static_assert(sizeof(::MagicalActual::WorldMenu*) == 0x8);
    // public UnityEngine.TextAsset ownerMenuHtml
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::TextAsset* ownerMenuHtml;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE11DC
    // private ExtUI.InventoryItemInstance[] <myInventory>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::ExtUI::InventoryItemInstance*> myInventory;
    // Field size check
    static_assert(sizeof(::ArrayW<::ExtUI::InventoryItemInstance*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE11EC
    // private System.Int32[] <myBids>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<int> myBids;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE11FC
    // private System.Int32[] <myBuyouts>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<int> myBuyouts;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE120C
    // private System.String[] <myErrors>k__BackingField
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::StringW> myErrors;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAE121C
    // private System.String[] <myAuctions>k__BackingField
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::StringW> myAuctions;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String inventory
    // Size: 0x8
    // Offset: 0x70
    ::StringW inventory;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String bids
    // Size: 0x8
    // Offset: 0x78
    ::StringW bids;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String buyouts
    // Size: 0x8
    // Offset: 0x80
    ::StringW buyouts;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String errors
    // Size: 0x8
    // Offset: 0x88
    ::StringW errors;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String auctions
    // Size: 0x8
    // Offset: 0x90
    ::StringW auctions;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.String OrbusNetComponent
    [[deprecated("Use field access instead!")]] ::StringW& dyn_OrbusNetComponent();
    // Get instance field reference: private MagicalActual.NetEntity myEntity
    [[deprecated("Use field access instead!")]] ::MagicalActual::NetEntity*& dyn_myEntity();
    // Get instance field reference: private MagicalActual.ItemContainer myItemContainer
    [[deprecated("Use field access instead!")]] ::MagicalActual::ItemContainer*& dyn_myItemContainer();
    // Get instance field reference: public UnityEngine.GameObject ownerMenuPoint
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_ownerMenuPoint();
