// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: CharacterStatsResponse
  class CharacterStatsResponse;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExtUI::CharacterStatsResponse);
DEFINE_IL2CPP_ARG_TYPE(::ExtUI::CharacterStatsResponse*, "ExtUI", "CharacterStatsResponse");
// Type namespace: ExtUI
namespace ExtUI {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: ExtUI.CharacterStatsResponse
  // [TokenAttribute] Offset: FFFFFFFF
  class CharacterStatsResponse : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 armor
    // Size: 0x4
    // Offset: 0x10
    int armor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 attack
    // Size: 0x4
    // Offset: 0x14
    int attack;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 crit
    // Size: 0x4
    // Offset: 0x18
    int crit;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 defense
    // Size: 0x4
    // Offset: 0x1C
    int defense;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 magdefense
    // Size: 0x4
    // Offset: 0x20
    int magdefense;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 wisdom
    // Size: 0x4
    // Offset: 0x24
    int wisdom;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 regen
    // Size: 0x4
    // Offset: 0x28
    int regen;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 speed
    // Size: 0x4
    // Offset: 0x2C
    int speed;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 luck
    // Size: 0x4
    // Offset: 0x30
    int luck;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 vitality
    // Size: 0x4
    // Offset: 0x34
    int vitality;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 intellect
    // Size: 0x4
    // Offset: 0x38
    int intellect;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 strength
    // Size: 0x4
    // Offset: 0x3C
    int strength;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Get instance field reference: public System.Int32 armor
    [[deprecated("Use field access instead!")]] int& dyn_armor();
    // Get instance field reference: public System.Int32 attack
    [[deprecated("Use field access instead!")]] int& dyn_attack();
    // Get instance field reference: public System.Int32 crit
    [[deprecated("Use field access instead!")]] int& dyn_crit();
    // Get instance field reference: public System.Int32 defense
    [[deprecated("Use field access instead!")]] int& dyn_defense();
    // Get instance field reference: public System.Int32 magdefense
    [[deprecated("Use field access instead!")]] int& dyn_magdefense();
    // Get instance field reference: public System.Int32 wisdom
    [[deprecated("Use field access instead!")]] int& dyn_wisdom();
    // Get instance field reference: public System.Int32 regen
    [[deprecated("Use field access instead!")]] int& dyn_regen();
    // Get instance field reference: public System.Int32 speed
    [[deprecated("Use field access instead!")]] int& dyn_speed();
    // Get instance field reference: public System.Int32 luck
    [[deprecated("Use field access instead!")]] int& dyn_luck();
    // Get instance field reference: public System.Int32 vitality
    [[deprecated("Use field access instead!")]] int& dyn_vitality();
    // Get instance field reference: public System.Int32 intellect
    [[deprecated("Use field access instead!")]] int& dyn_intellect();
    // Get instance field reference: public System.Int32 strength
    [[deprecated("Use field access instead!")]] int& dyn_strength();
    // public System.Void .ctor()
    // Offset: 0xF49410
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static CharacterStatsResponse* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::ExtUI::CharacterStatsResponse::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<CharacterStatsResponse*, creationType>()));
    }
  }; // ExtUI.CharacterStatsResponse
  #pragma pack(pop)
  static check_size<sizeof(CharacterStatsResponse), 60 + sizeof(int)> __ExtUI_CharacterStatsResponseSizeCheck;
  static_assert(sizeof(CharacterStatsResponse) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: ExtUI::CharacterStatsResponse::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
