// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: ExtUI
namespace ExtUI {
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Completed forward declares
// Type namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: InfusionCalculationArray
  class InfusionCalculationArray;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::ExtUI::InfusionCalculationArray);
DEFINE_IL2CPP_ARG_TYPE(::ExtUI::InfusionCalculationArray*, "ExtUI", "InfusionCalculationArray");
// Type namespace: ExtUI
namespace ExtUI {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: ExtUI.InfusionCalculationArray
  // [TokenAttribute] Offset: FFFFFFFF
  class InfusionCalculationArray : public ::Il2CppObject {
    public:
    // Nested type: ::ExtUI::InfusionCalculationArray::$$c__DisplayClass4_0
    class $$c__DisplayClass4_0;
    public:
    // public System.Int32 oldidx
    // Size: 0x4
    // Offset: 0x10
    int oldidx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 newidx
    // Size: 0x4
    // Offset: 0x14
    int newidx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String[] upgradedStatNames
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::StringW> upgradedStatNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.String[] upgradedStatValues
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::StringW> upgradedStatValues;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    public:
    // Get instance field reference: public System.Int32 oldidx
    [[deprecated("Use field access instead!")]] int& dyn_oldidx();
    // Get instance field reference: public System.Int32 newidx
    [[deprecated("Use field access instead!")]] int& dyn_newidx();
    // Get instance field reference: public System.String[] upgradedStatNames
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_upgradedStatNames();
    // Get instance field reference: public System.String[] upgradedStatValues
    [[deprecated("Use field access instead!")]] ::ArrayW<::StringW>& dyn_upgradedStatValues();
    // public System.Void waitForCalculation(System.Action callback)
    // Offset: 0x28CBEF4
    void waitForCalculation(::System::Action* callback);
    // public System.Void .ctor()
    // Offset: 0x28CC060
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static InfusionCalculationArray* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::ExtUI::InfusionCalculationArray::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<InfusionCalculationArray*, creationType>()));
    }
  }; // ExtUI.InfusionCalculationArray
  #pragma pack(pop)
  static check_size<sizeof(InfusionCalculationArray), 32 + sizeof(::ArrayW<::StringW>)> __ExtUI_InfusionCalculationArraySizeCheck;
  static_assert(sizeof(InfusionCalculationArray) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: ExtUI::InfusionCalculationArray::waitForCalculation
// Il2CppName: waitForCalculation
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (ExtUI::InfusionCalculationArray::*)(::System::Action*)>(&ExtUI::InfusionCalculationArray::waitForCalculation)> {
  static const MethodInfo* get() {
    static auto* callback = &::il2cpp_utils::GetClassFromName("System", "Action")->byval_arg;
    return ::il2cpp_utils::FindMethod(classof(ExtUI::InfusionCalculationArray*), "waitForCalculation", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{callback});
  }
};
// Writing MetadataGetter for method: ExtUI::InfusionCalculationArray::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
