// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: AmplifyColor.Tonemapping
#include "AmplifyColor/Tonemapping.hpp"
// Including type: AmplifyColor.Quality
#include "AmplifyColor/Quality.hpp"
// Including type: UnityEngine.LayerMask
#include "UnityEngine/LayerMask.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Including type: UnityEngine.ColorSpace
#include "UnityEngine/ColorSpace.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Material
  class Material;
  // Skipping declaration: Object because it is already included!
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: AmplifyColorVolumeBase
  class AmplifyColorVolumeBase;
  // Forward declaring type: AmplifyColorTriggerProxyBase
  class AmplifyColorTriggerProxyBase;
}
// Forward declaring namespace: AmplifyColor
namespace AmplifyColor {
  // Forward declaring type: VolumeEffect
  class VolumeEffect;
  // Forward declaring type: VolumeEffectFlags
  class VolumeEffectFlags;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AmplifyColorBase
  class AmplifyColorBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AmplifyColorBase);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AmplifyColorBase*, "", "AmplifyColorBase");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1C9
  #pragma pack(push, 1)
  // Autogenerated type: AmplifyColorBase
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: ACCAAC
  class AmplifyColorBase : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public AmplifyColor.Tonemapping Tonemapper
    // Size: 0x4
    // Offset: 0x18
    ::AmplifyColor::Tonemapping Tonemapper;
    // Field size check
    static_assert(sizeof(::AmplifyColor::Tonemapping) == 0x4);
    // public System.Single Exposure
    // Size: 0x4
    // Offset: 0x1C
    float Exposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single LinearWhitePoint
    // Size: 0x4
    // Offset: 0x20
    float LinearWhitePoint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xAD893C
    // public System.Boolean ApplyDithering
    // Size: 0x1
    // Offset: 0x24
    bool ApplyDithering;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ApplyDithering and: QualityLevel
    char __padding3[0x3] = {};
    // public AmplifyColor.Quality QualityLevel
    // Size: 0x4
    // Offset: 0x28
    ::AmplifyColor::Quality QualityLevel;
    // Field size check
    static_assert(sizeof(::AmplifyColor::Quality) == 0x4);
    // public System.Single BlendAmount
    // Size: 0x4
    // Offset: 0x2C
    float BlendAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Texture LutTexture
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Texture* LutTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public UnityEngine.Texture LutBlendTexture
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Texture* LutBlendTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public UnityEngine.Texture MaskTexture
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Texture* MaskTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // public System.Boolean UseDepthMask
    // Size: 0x1
    // Offset: 0x48
    bool UseDepthMask;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseDepthMask and: DepthMaskCurve
    char __padding9[0x7] = {};
    // public UnityEngine.AnimationCurve DepthMaskCurve
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::AnimationCurve* DepthMaskCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // public System.Boolean UseVolumes
    // Size: 0x1
    // Offset: 0x58
    bool UseVolumes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: UseVolumes and: ExitVolumeBlendTime
    char __padding11[0x3] = {};
    // public System.Single ExitVolumeBlendTime
    // Size: 0x4
    // Offset: 0x5C
    float ExitVolumeBlendTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Transform TriggerVolumeProxy
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Transform* TriggerVolumeProxy;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // public UnityEngine.LayerMask VolumeCollisionMask
    // Size: 0x4
    // Offset: 0x68
    ::UnityEngine::LayerMask VolumeCollisionMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::LayerMask) == 0x4);
    // Padding between fields: VolumeCollisionMask and: ownerCamera
    char __padding14[0x4] = {};
    // private UnityEngine.Camera ownerCamera
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Camera* ownerCamera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.Shader shaderBase
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Shader* shaderBase;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderBlend
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::Shader* shaderBlend;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderBlendCache
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Shader* shaderBlendCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderMask
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::Shader* shaderMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderMaskBlend
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Shader* shaderMaskBlend;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderDepthMask
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Shader* shaderDepthMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderDepthMaskBlend
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Shader* shaderDepthMaskBlend;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Shader shaderProcessOnly
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Shader* shaderProcessOnly;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.RenderTexture blendCacheLut
    // Size: 0x8
    // Offset: 0xB8
    ::UnityEngine::RenderTexture* blendCacheLut;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.Texture2D defaultLut
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Texture2D* defaultLut;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Texture2D depthCurveLut
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Texture2D* depthCurveLut;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Color32[] depthCurveColors
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<::UnityEngine::Color32> depthCurveColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color32>) == 0x8);
    // private UnityEngine.ColorSpace colorSpace
    // Size: 0x4
    // Offset: 0xD8
    ::UnityEngine::ColorSpace colorSpace;
    // Field size check
    static_assert(sizeof(::UnityEngine::ColorSpace) == 0x4);
    // private AmplifyColor.Quality qualityLevel
    // Size: 0x4
    // Offset: 0xDC
    ::AmplifyColor::Quality qualityLevel;
    // Field size check
    static_assert(sizeof(::AmplifyColor::Quality) == 0x4);
    // private UnityEngine.Material materialBase
    // Size: 0x8
    // Offset: 0xE0
    ::UnityEngine::Material* materialBase;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialBlend
    // Size: 0x8
    // Offset: 0xE8
    ::UnityEngine::Material* materialBlend;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialBlendCache
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::Material* materialBlendCache;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialMask
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Material* materialMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialMaskBlend
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Material* materialMaskBlend;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialDepthMask
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Material* materialDepthMask;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialDepthMaskBlend
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Material* materialDepthMaskBlend;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Material materialProcessOnly
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Material* materialProcessOnly;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.Boolean blending
    // Size: 0x1
    // Offset: 0x120
    bool blending;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: blending and: blendingTime
    char __padding38[0x3] = {};
    // private System.Single blendingTime
    // Size: 0x4
    // Offset: 0x124
    float blendingTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single blendingTimeCountdown
    // Size: 0x4
    // Offset: 0x128
    float blendingTimeCountdown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: blendingTimeCountdown and: onFinishBlend
    char __padding40[0x4] = {};
    // private System.Action onFinishBlend
    // Size: 0x8
    // Offset: 0x130
    ::System::Action* onFinishBlend;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private UnityEngine.AnimationCurve prevDepthMaskCurve
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::AnimationCurve* prevDepthMaskCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Boolean volumesBlending
    // Size: 0x1
    // Offset: 0x140
    bool volumesBlending;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: volumesBlending and: volumesBlendingTime
    char __padding43[0x3] = {};
    // private System.Single volumesBlendingTime
    // Size: 0x4
    // Offset: 0x144
    float volumesBlendingTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single volumesBlendingTimeCountdown
    // Size: 0x4
    // Offset: 0x148
    float volumesBlendingTimeCountdown;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: volumesBlendingTimeCountdown and: volumesLutBlendTexture
    char __padding45[0x4] = {};
    // private UnityEngine.Texture volumesLutBlendTexture
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Texture* volumesLutBlendTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Single volumesBlendAmount
    // Size: 0x4
    // Offset: 0x158
    float volumesBlendAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: volumesBlendAmount and: worldLUT
    char __padding47[0x4] = {};
    // private UnityEngine.Texture worldLUT
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Texture* worldLUT;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private AmplifyColorVolumeBase currentVolumeLut
    // Size: 0x8
    // Offset: 0x168
    ::GlobalNamespace::AmplifyColorVolumeBase* currentVolumeLut;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AmplifyColorVolumeBase*) == 0x8);
    // private UnityEngine.RenderTexture midBlendLUT
    // Size: 0x8
    // Offset: 0x170
    ::UnityEngine::RenderTexture* midBlendLUT;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private System.Boolean blendingFromMidBlend
    // Size: 0x1
    // Offset: 0x178
    bool blendingFromMidBlend;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: blendingFromMidBlend and: worldVolumeEffects
    char __padding51[0x7] = {};
    // private AmplifyColor.VolumeEffect worldVolumeEffects
    // Size: 0x8
    // Offset: 0x180
    ::AmplifyColor::VolumeEffect* worldVolumeEffects;
    // Field size check
    static_assert(sizeof(::AmplifyColor::VolumeEffect*) == 0x8);
    // private AmplifyColor.VolumeEffect currentVolumeEffects
    // Size: 0x8
    // Offset: 0x188
    ::AmplifyColor::VolumeEffect* currentVolumeEffects;
    // Field size check
    static_assert(sizeof(::AmplifyColor::VolumeEffect*) == 0x8);
    // private AmplifyColor.VolumeEffect blendVolumeEffects
    // Size: 0x8
    // Offset: 0x190
    ::AmplifyColor::VolumeEffect* blendVolumeEffects;
    // Field size check
    static_assert(sizeof(::AmplifyColor::VolumeEffect*) == 0x8);
    // private System.Single worldExposure
    // Size: 0x4
    // Offset: 0x198
    float worldExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single currentExposure
    // Size: 0x4
    // Offset: 0x19C
    float currentExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single blendExposure
    // Size: 0x4
    // Offset: 0x1A0
    float blendExposure;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single effectVolumesBlendAdjust
    // Size: 0x4
    // Offset: 0x1A4
    float effectVolumesBlendAdjust;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Collections.Generic.List`1<AmplifyColorVolumeBase> enteredVolumes
    // Size: 0x8
    // Offset: 0x1A8
    ::System::Collections::Generic::List_1<::GlobalNamespace::AmplifyColorVolumeBase*>* enteredVolumes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::AmplifyColorVolumeBase*>*) == 0x8);
    // private AmplifyColorTriggerProxyBase actualTriggerProxy
    // Size: 0x8
    // Offset: 0x1B0
    ::GlobalNamespace::AmplifyColorTriggerProxyBase* actualTriggerProxy;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::AmplifyColorTriggerProxyBase*) == 0x8);
    // public AmplifyColor.VolumeEffectFlags EffectFlags
    // Size: 0x8
    // Offset: 0x1B8
    ::AmplifyColor::VolumeEffectFlags* EffectFlags;
    // Field size check
    static_assert(sizeof(::AmplifyColor::VolumeEffectFlags*) == 0x8);
    // private System.String sharedInstanceID
    // Size: 0x8
    // Offset: 0x1C0
    ::StringW sharedInstanceID;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean silentError
    // Size: 0x1
    // Offset: 0x1C8
    bool silentError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Int32 LutSize
    static constexpr const int LutSize = 32;
    // Get static field: static public System.Int32 LutSize
    static int _get_LutSize();
    // Set static field: static public System.Int32 LutSize
    static void _set_LutSize(int value);
    // static field const value: static public System.Int32 LutWidth
    static constexpr const int LutWidth = 1024;
    // Get static field: static public System.Int32 LutWidth
    static int _get_LutWidth();
    // Set static field: static public System.Int32 LutWidth
    static void _set_LutWidth(int value);
    // static field const value: static public System.Int32 LutHeight
    static constexpr const int LutHeight = 32;
