// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Pathfinding.GraphDebugMode
#include "Pathfinding/GraphDebugMode.hpp"
// Including type: Pathfinding.PathLog
#include "Pathfinding/PathLog.hpp"
// Including type: Pathfinding.Heuristic
#include "Pathfinding/Heuristic.hpp"
// Including type: Pathfinding.ThreadCount
#include "Pathfinding/ThreadCount.hpp"
// Including type: Pathfinding.PathThreadInfo
#include "Pathfinding/PathThreadInfo.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Skipping declaration: GraphUpdateOrder because it is already included!
  // Skipping declaration: AstarWorkItem because it is already included!
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: AutoResetEvent
  class AutoResetEvent;
  // Forward declaring type: Thread
  class Thread;
  // Forward declaring type: ManualResetEvent
  class ManualResetEvent;
}
// Forward declaring namespace: Pathfinding
namespace Pathfinding {
  // Forward declaring type: OnGraphDelegate
  class OnGraphDelegate;
  // Forward declaring type: AstarData
  class AstarData;
  // Forward declaring type: AstarColor
  class AstarColor;
  // Forward declaring type: Path
  class Path;
  // Forward declaring type: GraphUpdateObject
  class GraphUpdateObject;
  // Forward declaring type: GraphNode
  class GraphNode;
  // Forward declaring type: ThreadControlQueue
  class ThreadControlQueue;
  // Forward declaring type: EuclideanEmbedding
  class EuclideanEmbedding;
  // Forward declaring type: OnPathDelegate
  class OnPathDelegate;
  // Forward declaring type: OnScanDelegate
  class OnScanDelegate;
  // Forward declaring type: NavGraph
  class NavGraph;
  // Forward declaring type: PathHandler
  class PathHandler;
  // Forward declaring type: OnScanStatus
  class OnScanStatus;
  // Forward declaring type: NNInfo
  struct NNInfo;
  // Forward declaring type: NNConstraint
  class NNConstraint;
  // Forward declaring type: IUpdatableGraph
  class IUpdatableGraph;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Version
  class Version;
  // Forward declaring type: Type
  class Type;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: Pathfinding::Util
namespace Pathfinding::Util {
  // Forward declaring type: LockFreeStack
  class LockFreeStack;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Bounds
  struct Bounds;
  // Skipping declaration: Vector3 because it is already included!
  // Forward declaring type: Ray
  struct Ray;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: AstarPath
  class AstarPath;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::AstarPath);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::AstarPath*, "", "AstarPath");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x129
  #pragma pack(push, 1)
  // Autogenerated type: AstarPath
  // [TokenAttribute] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: ACD018
  // [AddComponentMenu] Offset: ACD018
  // [ExecuteInEditMode] Offset: FFFFFFFF
  class AstarPath : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::AstarPath::AstarDistribution
    struct AstarDistribution;
    // Nested type: ::GlobalNamespace::AstarPath::GraphUpdateOrder
    struct GraphUpdateOrder;
    // Nested type: ::GlobalNamespace::AstarPath::GUOSingle
    struct GUOSingle;
    // Nested type: ::GlobalNamespace::AstarPath::AstarWorkItem
    struct AstarWorkItem;
    // Nested type: ::GlobalNamespace::AstarPath::$DelayedGraphUpdate$d__120
    class $DelayedGraphUpdate$d__120;
    // Nested type: ::GlobalNamespace::AstarPath::$UpdateGraphsInteral$d__123
    class $UpdateGraphsInteral$d__123;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass143_0
    class $$c__DisplayClass143_0;
    // Nested type: ::GlobalNamespace::AstarPath::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass149_0
    class $$c__DisplayClass149_0;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass149_1
    class $$c__DisplayClass149_1;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass149_2
    class $$c__DisplayClass149_2;
    // Nested type: ::GlobalNamespace::AstarPath::$CalculatePaths$d__159
    class $CalculatePaths$d__159;
    // Nested type: ::GlobalNamespace::AstarPath::$$c__DisplayClass163_0
    class $$c__DisplayClass163_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AstarPath/AstarDistribution
    // [TokenAttribute] Offset: FFFFFFFF
    struct AstarDistribution/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: AstarDistribution
      constexpr AstarDistribution(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AstarPath/AstarDistribution WebsiteDownload
      static constexpr const int WebsiteDownload = 0;
      // Get static field: static public AstarPath/AstarDistribution WebsiteDownload
      static ::GlobalNamespace::AstarPath::AstarDistribution _get_WebsiteDownload();
      // Set static field: static public AstarPath/AstarDistribution WebsiteDownload
      static void _set_WebsiteDownload(::GlobalNamespace::AstarPath::AstarDistribution value);
      // static field const value: static public AstarPath/AstarDistribution AssetStore
      static constexpr const int AssetStore = 1;
      // Get static field: static public AstarPath/AstarDistribution AssetStore
      static ::GlobalNamespace::AstarPath::AstarDistribution _get_AssetStore();
      // Set static field: static public AstarPath/AstarDistribution AssetStore
      static void _set_AssetStore(::GlobalNamespace::AstarPath::AstarDistribution value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // AstarPath/AstarDistribution
    #pragma pack(pop)
    static check_size<sizeof(AstarPath::AstarDistribution), 0 + sizeof(int)> __GlobalNamespace_AstarPath_AstarDistributionSizeCheck;
    static_assert(sizeof(AstarPath::AstarDistribution) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: AstarPath/GraphUpdateOrder
    // [TokenAttribute] Offset: FFFFFFFF
    struct GraphUpdateOrder/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: GraphUpdateOrder
      constexpr GraphUpdateOrder(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public AstarPath/GraphUpdateOrder GraphUpdate
      static constexpr const int GraphUpdate = 0;
      // Get static field: static public AstarPath/GraphUpdateOrder GraphUpdate
      static ::GlobalNamespace::AstarPath::GraphUpdateOrder _get_GraphUpdate();
      // Set static field: static public AstarPath/GraphUpdateOrder GraphUpdate
      static void _set_GraphUpdate(::GlobalNamespace::AstarPath::GraphUpdateOrder value);
      // static field const value: static public AstarPath/GraphUpdateOrder FloodFill
      static constexpr const int FloodFill = 1;
      // Get static field: static public AstarPath/GraphUpdateOrder FloodFill
      static ::GlobalNamespace::AstarPath::GraphUpdateOrder _get_FloodFill();
      // Set static field: static public AstarPath/GraphUpdateOrder FloodFill
      static void _set_FloodFill(::GlobalNamespace::AstarPath::GraphUpdateOrder value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // AstarPath/GraphUpdateOrder
    #pragma pack(pop)
    static check_size<sizeof(AstarPath::GraphUpdateOrder), 0 + sizeof(int)> __GlobalNamespace_AstarPath_GraphUpdateOrderSizeCheck;
    static_assert(sizeof(AstarPath::GraphUpdateOrder) == 0x4);
    // Size: 0x18
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: AstarPath/GUOSingle
    // [TokenAttribute] Offset: FFFFFFFF
    struct GUOSingle/*, public ::System::ValueType*/ {
      public:
      public:
      // public AstarPath/GraphUpdateOrder order
      // Size: 0x4
      // Offset: 0x0
      ::GlobalNamespace::AstarPath::GraphUpdateOrder order;
      // Field size check
      static_assert(sizeof(::GlobalNamespace::AstarPath::GraphUpdateOrder) == 0x4);
      // Padding between fields: order and: graph
      char __padding0[0x4] = {};
      // public Pathfinding.IUpdatableGraph graph
      // Size: 0x8
      // Offset: 0x8
      ::Pathfinding::IUpdatableGraph* graph;
      // Field size check
      static_assert(sizeof(::Pathfinding::IUpdatableGraph*) == 0x8);
      // public Pathfinding.GraphUpdateObject obj
      // Size: 0x8
      // Offset: 0x10
      ::Pathfinding::GraphUpdateObject* obj;
      // Field size check
      static_assert(sizeof(::Pathfinding::GraphUpdateObject*) == 0x8);
      public:
      // Creating value type constructor for type: GUOSingle
      constexpr GUOSingle(::GlobalNamespace::AstarPath::GraphUpdateOrder order_ = {}, ::Pathfinding::IUpdatableGraph* graph_ = {}, ::Pathfinding::GraphUpdateObject* obj_ = {}) noexcept : order{order_}, graph{graph_}, obj{obj_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public AstarPath/GraphUpdateOrder order
      [[deprecated("Use field access instead!")]] ::GlobalNamespace::AstarPath::GraphUpdateOrder& dyn_order();
      // Get instance field reference: public Pathfinding.IUpdatableGraph graph
      [[deprecated("Use field access instead!")]] ::Pathfinding::IUpdatableGraph*& dyn_graph();
      // Get instance field reference: public Pathfinding.GraphUpdateObject obj
      [[deprecated("Use field access instead!")]] ::Pathfinding::GraphUpdateObject*& dyn_obj();
    }; // AstarPath/GUOSingle
    #pragma pack(pop)
    static check_size<sizeof(AstarPath::GUOSingle), 16 + sizeof(::Pathfinding::GraphUpdateObject*)> __GlobalNamespace_AstarPath_GUOSingleSizeCheck;
    static_assert(sizeof(AstarPath::GUOSingle) == 0x18);
    // Size: 0x10
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: AstarPath/AstarWorkItem
    // [TokenAttribute] Offset: FFFFFFFF
    struct AstarWorkItem/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Action init
      // Size: 0x8
      // Offset: 0x0
      ::System::Action* init;
      // Field size check
      static_assert(sizeof(::System::Action*) == 0x8);
      // public System.Func`2<System.Boolean,System.Boolean> update
      // Size: 0x8
      // Offset: 0x8
      ::System::Func_2<bool, bool>* update;
      // Field size check
      static_assert(sizeof(::System::Func_2<bool, bool>*) == 0x8);
      public:
      // Creating value type constructor for type: AstarWorkItem
      constexpr AstarWorkItem(::System::Action* init_ = {}, ::System::Func_2<bool, bool>* update_ = {}) noexcept : init{init_}, update{update_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Action init
      [[deprecated("Use field access instead!")]] ::System::Action*& dyn_init();
      // Get instance field reference: public System.Func`2<System.Boolean,System.Boolean> update
      [[deprecated("Use field access instead!")]] ::System::Func_2<bool, bool>*& dyn_update();
      // public System.Void .ctor(System.Func`2<System.Boolean,System.Boolean> update)
      // Offset: 0xB98E08
      AstarWorkItem(::System::Func_2<bool, bool>* update);
      // public System.Void .ctor(System.Action init, System.Func`2<System.Boolean,System.Boolean> update)
      // Offset: 0xB98E10
      // ABORTED: conflicts with another method.  AstarWorkItem(::System::Action* init, ::System::Func_2<bool, bool>* update);
    }; // AstarPath/AstarWorkItem
    #pragma pack(pop)
    static check_size<sizeof(AstarPath::AstarWorkItem), 8 + sizeof(::System::Func_2<bool, bool>*)> __GlobalNamespace_AstarPath_AstarWorkItemSizeCheck;
    static_assert(sizeof(AstarPath::AstarWorkItem) == 0x10);
    public:
    // public Pathfinding.AstarData astarData
    // Size: 0x8
    // Offset: 0x18
    ::Pathfinding::AstarData* astarData;
    // Field size check
    static_assert(sizeof(::Pathfinding::AstarData*) == 0x8);
    // public System.Boolean showNavGraphs
    // Size: 0x1
    // Offset: 0x20
    bool showNavGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showUnwalkableNodes
    // Size: 0x1
    // Offset: 0x21
    bool showUnwalkableNodes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showUnwalkableNodes and: debugMode
    char __padding2[0x2] = {};
    // public Pathfinding.GraphDebugMode debugMode
    // Size: 0x4
    // Offset: 0x24
    ::Pathfinding::GraphDebugMode debugMode;
    // Field size check
    static_assert(sizeof(::Pathfinding::GraphDebugMode) == 0x4);
    // public System.Single debugFloor
    // Size: 0x4
    // Offset: 0x28
    float debugFloor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single debugRoof
    // Size: 0x4
    // Offset: 0x2C
    float debugRoof;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean manualDebugFloorRoof
    // Size: 0x1
    // Offset: 0x30
    bool manualDebugFloorRoof;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showSearchTree
    // Size: 0x1
    // Offset: 0x31
    bool showSearchTree;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showSearchTree and: unwalkableNodeDebugSize
    char __padding7[0x2] = {};
    // public System.Single unwalkableNodeDebugSize
    // Size: 0x4
    // Offset: 0x34
    float unwalkableNodeDebugSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.PathLog logPathResults
    // Size: 0x4
    // Offset: 0x38
    ::Pathfinding::PathLog logPathResults;
    // Field size check
    static_assert(sizeof(::Pathfinding::PathLog) == 0x4);
    // public System.Single maxNearestNodeDistance
    // Size: 0x4
    // Offset: 0x3C
    float maxNearestNodeDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean scanOnStartup
    // Size: 0x1
    // Offset: 0x40
    bool scanOnStartup;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean fullGetNearestSearch
    // Size: 0x1
    // Offset: 0x41
    bool fullGetNearestSearch;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean prioritizeGraphs
    // Size: 0x1
    // Offset: 0x42
    bool prioritizeGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: prioritizeGraphs and: prioritizeGraphsLimit
    char __padding13[0x1] = {};
    // public System.Single prioritizeGraphsLimit
    // Size: 0x4
    // Offset: 0x44
    float prioritizeGraphsLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.AstarColor colorSettings
    // Size: 0x8
    // Offset: 0x48
    ::Pathfinding::AstarColor* colorSettings;
    // Field size check
    static_assert(sizeof(::Pathfinding::AstarColor*) == 0x8);
    // protected System.String[] tagNames
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::StringW> tagNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public Pathfinding.Heuristic heuristic
    // Size: 0x4
    // Offset: 0x58
    ::Pathfinding::Heuristic heuristic;
    // Field size check
    static_assert(sizeof(::Pathfinding::Heuristic) == 0x4);
    // public System.Single heuristicScale
    // Size: 0x4
    // Offset: 0x5C
    float heuristicScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.ThreadCount threadCount
    // Size: 0x4
    // Offset: 0x60
    ::Pathfinding::ThreadCount threadCount;
    // Field size check
    static_assert(sizeof(::Pathfinding::ThreadCount) == 0x4);
    // public System.Single maxFrameTime
    // Size: 0x4
    // Offset: 0x64
    float maxFrameTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 minAreaSize
    // Size: 0x4
    // Offset: 0x68
    int minAreaSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean batchGraphUpdates
    // Size: 0x1
    // Offset: 0x6C
    bool batchGraphUpdates;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: batchGraphUpdates and: graphUpdateBatchingInterval
    char __padding22[0x3] = {};
    // public System.Single graphUpdateBatchingInterval
    // Size: 0x4
    // Offset: 0x70
    float graphUpdateBatchingInterval;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single lastScanTime
    // Size: 0x4
    // Offset: 0x74
    float lastScanTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public Pathfinding.Path debugPath
    // Size: 0x8
    // Offset: 0x78
    ::Pathfinding::Path* debugPath;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // public System.String inGameDebugPath
    // Size: 0x8
    // Offset: 0x80
    ::StringW inGameDebugPath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD8A68
    // private System.Boolean <isScanning>k__BackingField
    // Size: 0x1
    // Offset: 0x88
    bool isScanning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean graphUpdateRoutineRunning
    // Size: 0x1
    // Offset: 0x89
    bool graphUpdateRoutineRunning;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isRegisteredForUpdate
    // Size: 0x1
    // Offset: 0x8A
    bool isRegisteredForUpdate;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean workItemsQueued
    // Size: 0x1
    // Offset: 0x8B
    bool workItemsQueued;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean queuedWorkItemFloodFill
    // Size: 0x1
    // Offset: 0x8C
    bool queuedWorkItemFloodFill;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: queuedWorkItemFloodFill and: OnDrawGizmosCallback
    char __padding31[0x3] = {};
    // public System.Action OnDrawGizmosCallback
    // Size: 0x8
    // Offset: 0x90
    ::System::Action* OnDrawGizmosCallback;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public System.Action OnUnloadGizmoMeshes
    // Size: 0x8
    // Offset: 0x98
    ::System::Action* OnUnloadGizmoMeshes;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // [ObsoleteAttribute] Offset: 0xAD8A78
    // public System.Action OnGraphsWillBeUpdated
    // Size: 0x8
    // Offset: 0xA0
    ::System::Action* OnGraphsWillBeUpdated;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // [ObsoleteAttribute] Offset: 0xAD8A88
    // public System.Action OnGraphsWillBeUpdated2
    // Size: 0x8
    // Offset: 0xA8
    ::System::Action* OnGraphsWillBeUpdated2;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private System.Collections.Generic.Queue`1<Pathfinding.GraphUpdateObject> graphUpdateQueue
    // Size: 0x8
    // Offset: 0xB0
    ::System::Collections::Generic::Queue_1<::Pathfinding::GraphUpdateObject*>* graphUpdateQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::Pathfinding::GraphUpdateObject*>*) == 0x8);
    // private System.Collections.Generic.Stack`1<Pathfinding.GraphNode> floodStack
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Stack_1<::Pathfinding::GraphNode*>* floodStack;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<::Pathfinding::GraphNode*>*) == 0x8);
    // private Pathfinding.ThreadControlQueue pathQueue
    // Size: 0x8
    // Offset: 0xC0
    ::Pathfinding::ThreadControlQueue* pathQueue;
    // Field size check
    static_assert(sizeof(::Pathfinding::ThreadControlQueue*) == 0x8);
    // private System.Threading.Thread graphUpdateThread
    // Size: 0x8
    // Offset: 0xC8
    ::System::Threading::Thread* graphUpdateThread;
    // Field size check
    static_assert(sizeof(::System::Threading::Thread*) == 0x8);
    // public Pathfinding.EuclideanEmbedding euclideanEmbedding
    // Size: 0x8
    // Offset: 0xD0
    ::Pathfinding::EuclideanEmbedding* euclideanEmbedding;
    // Field size check
    static_assert(sizeof(::Pathfinding::EuclideanEmbedding*) == 0x8);
    // private System.Int32 nextNodeIndex
    // Size: 0x4
    // Offset: 0xD8
    int nextNodeIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: nextNodeIndex and: nodeIndexPool
    char __padding41[0x4] = {};
    // private System.Collections.Generic.Stack`1<System.Int32> nodeIndexPool
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::Stack_1<int>* nodeIndexPool;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Stack_1<int>*) == 0x8);
    // private Pathfinding.Path pathReturnPop
    // Size: 0x8
    // Offset: 0xE8
    ::Pathfinding::Path* pathReturnPop;
    // Field size check
    static_assert(sizeof(::Pathfinding::Path*) == 0x8);
    // private System.Collections.Generic.Queue`1<AstarPath/GUOSingle> graphUpdateQueueAsync
    // Size: 0x8
    // Offset: 0xF0
    ::System::Collections::Generic::Queue_1<::GlobalNamespace::AstarPath::GUOSingle>* graphUpdateQueueAsync;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::GlobalNamespace::AstarPath::GUOSingle>*) == 0x8);
    // private System.Collections.Generic.Queue`1<AstarPath/GUOSingle> graphUpdateQueueRegular
    // Size: 0x8
    // Offset: 0xF8
    ::System::Collections::Generic::Queue_1<::GlobalNamespace::AstarPath::GUOSingle>* graphUpdateQueueRegular;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::GlobalNamespace::AstarPath::GUOSingle>*) == 0x8);
    // public System.Boolean showGraphs
    // Size: 0x1
    // Offset: 0x100
    bool showGraphs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showGraphs and: lastUniqueAreaIndex
    char __padding46[0x3] = {};
    // public System.UInt32 lastUniqueAreaIndex
    // Size: 0x4
    // Offset: 0x104
    uint lastUniqueAreaIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Threading.AutoResetEvent graphUpdateAsyncEvent
    // Size: 0x8
    // Offset: 0x108
    ::System::Threading::AutoResetEvent* graphUpdateAsyncEvent;
    // Field size check
    static_assert(sizeof(::System::Threading::AutoResetEvent*) == 0x8);
    // private System.Threading.ManualResetEvent processingGraphUpdatesAsync
    // Size: 0x8
    // Offset: 0x110
    ::System::Threading::ManualResetEvent* processingGraphUpdatesAsync;
    // Field size check
    static_assert(sizeof(::System::Threading::ManualResetEvent*) == 0x8);
    // private System.Single lastGraphUpdate
    // Size: 0x4
    // Offset: 0x118
    float lastGraphUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt16 nextFreePathID
    // Size: 0x2
    // Offset: 0x11C
    uint16_t nextFreePathID;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: nextFreePathID and: workItems
    char __padding51[0x2] = {};
    // private System.Collections.Generic.Queue`1<AstarPath/AstarWorkItem> workItems
    // Size: 0x8
    // Offset: 0x120
    ::System::Collections::Generic::Queue_1<::GlobalNamespace::AstarPath::AstarWorkItem>* workItems;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::GlobalNamespace::AstarPath::AstarWorkItem>*) == 0x8);
    // private System.Boolean processingWorkItems
    // Size: 0x1
    // Offset: 0x128
    bool processingWorkItems;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public readonly AstarPath/AstarDistribution Distribution
    static ::GlobalNamespace::AstarPath::AstarDistribution _get_Distribution();
    // Set static field: static public readonly AstarPath/AstarDistribution Distribution
    static void _set_Distribution(::GlobalNamespace::AstarPath::AstarDistribution value);
    // Get static field: static public readonly System.String Branch
    static ::StringW _get_Branch();
    // Set static field: static public readonly System.String Branch
    static void _set_Branch(::StringW value);
    // Get static field: static public AstarPath active
    static ::GlobalNamespace::AstarPath* _get_active();
    // Set static field: static public AstarPath active
