// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SKManager
  class SKManager;
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: TextAsset
  class TextAsset;
  // Forward declaring type: Texture2D
  class Texture2D;
}
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: WorldUI
  class WorldUI;
  // Forward declaring type: Element
  class Element;
  // Forward declaring type: Document
  class Document;
  // Forward declaring type: UIEvent
  class UIEvent;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: PlayerAvatar
  class PlayerAvatar;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Image
  class Image;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: ExtUI
namespace ExtUI {
  // Forward declaring type: AccountCharacterList
  class AccountCharacterList;
  // Forward declaring type: BlogPostList
  class BlogPostList;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: CharacterSelect
  class CharacterSelect;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::CharacterSelect);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::CharacterSelect*, "", "CharacterSelect");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x1A0
  #pragma pack(push, 1)
  // Autogenerated type: CharacterSelect
  // [TokenAttribute] Offset: FFFFFFFF
  class CharacterSelect : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::CharacterSelect::$FreeMemory$d__79
    class $FreeMemory$d__79;
    // Nested type: ::GlobalNamespace::CharacterSelect::$UseUpMemory$d__80
    class $UseUpMemory$d__80;
    // Nested type: ::GlobalNamespace::CharacterSelect::$$c__DisplayClass82_0
    class $$c__DisplayClass82_0;
    // Nested type: ::GlobalNamespace::CharacterSelect::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::CharacterSelect::$$c__DisplayClass101_0
    class $$c__DisplayClass101_0;
    // Nested type: ::GlobalNamespace::CharacterSelect::$$c__DisplayClass102_0
    class $$c__DisplayClass102_0;
    // Nested type: ::GlobalNamespace::CharacterSelect::$$c__DisplayClass106_0
    class $$c__DisplayClass106_0;
    public:
    // private UnityEngine.GameObject interactionMenu
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::GameObject* interactionMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private PowerUI.WorldUI interactionMenuUi
    // Size: 0x8
    // Offset: 0x20
    ::PowerUI::WorldUI* interactionMenuUi;
    // Field size check
    static_assert(sizeof(::PowerUI::WorldUI*) == 0x8);
    // public UnityEngine.TextAsset characterSelectMenu
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::TextAsset* characterSelectMenu;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAsset*) == 0x8);
    // public MagicalActual.PlayerAvatar dummyAvatar
    // Size: 0x8
    // Offset: 0x30
    ::MagicalActual::PlayerAvatar* dummyAvatar;
    // Field size check
    static_assert(sizeof(::MagicalActual::PlayerAvatar*) == 0x8);
    // public UnityEngine.GameObject playerMirror
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* playerMirror;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject appearanceOptions
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::GameObject* appearanceOptions;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject locomotionOptions
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::GameObject* locomotionOptions;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject codeOfConduct
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::GameObject* codeOfConduct;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject safetyInfo
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::GameObject* safetyInfo;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public SKManager myManager
    // Size: 0x8
    // Offset: 0x60
    ::GlobalNamespace::SKManager* myManager;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SKManager*) == 0x8);
    // public UnityEngine.GameObject[] appearanceObjectPages
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::GameObject*> appearanceObjectPages;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject changePoofPrefab
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::GameObject* changePoofPrefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject menuInteractTut
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::GameObject* menuInteractTut;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single timeSinceEmote
    // Size: 0x4
    // Offset: 0x80
    float timeSinceEmote;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: timeSinceEmote and: possibleEmotions
    char __padding13[0x4] = {};
    // private System.String[] possibleEmotions
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::StringW> possibleEmotions;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Single emoteEvery
    // Size: 0x4
    // Offset: 0x90
    float emoteEvery;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeSinceInternetCheck
    // Size: 0x4
    // Offset: 0x94
    float timeSinceInternetCheck;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single checkInternetEvery
    // Size: 0x4
    // Offset: 0x98
    float checkInternetEvery;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single newcharTone
    // Size: 0x4
    // Offset: 0x9C
    float newcharTone;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Byte newcharEyeSet
    // Size: 0x1
    // Offset: 0xA0
    uint8_t newcharEyeSet;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte newcharMouthSet
    // Size: 0x1
    // Offset: 0xA1
    uint8_t newcharMouthSet;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: newcharMouthSet and: newcharName
    char __padding20[0x6] = {};
    // public System.String newcharName
    // Size: 0x8
    // Offset: 0xA8
    ::StringW newcharName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Byte newcharHairStyle
    // Size: 0x1
    // Offset: 0xB0
    uint8_t newcharHairStyle;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte newcharHairColor
    // Size: 0x1
    // Offset: 0xB1
    uint8_t newcharHairColor;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte newcharNoseStyle
    // Size: 0x1
    // Offset: 0xB2
    uint8_t newcharNoseStyle;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte newcharEarStyle
    // Size: 0x1
    // Offset: 0xB3
    uint8_t newcharEarStyle;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte newcharEyeColor
    // Size: 0x1
    // Offset: 0xB4
    uint8_t newcharEyeColor;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // public System.Byte newcharDiscipline
    // Size: 0x1
    // Offset: 0xB5
    uint8_t newcharDiscipline;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: newcharDiscipline and: modifyingCharacterId
    char __padding27[0x2] = {};
    // public System.String modifyingCharacterId
    // Size: 0x8
    // Offset: 0xB8
    ::StringW modifyingCharacterId;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Byte newPrimaryWeaponIdx
    // Size: 0x1
    // Offset: 0xC0
    uint8_t newPrimaryWeaponIdx;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: newPrimaryWeaponIdx and: movemenetSelect
    char __padding29[0x3] = {};
    // private System.Int32 movemenetSelect
    // Size: 0x4
    // Offset: 0xC4
    int movemenetSelect;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single timeUntilControllerHint
    // Size: 0x4
    // Offset: 0xC8
    float timeUntilControllerHint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeSinceStarted
    // Size: 0x4
    // Offset: 0xCC
    float timeSinceStarted;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean hintSuccessful
    // Size: 0x1
    // Offset: 0xD0
    bool hintSuccessful;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean showEntitlementFailed
    // Size: 0x1
    // Offset: 0xD1
    bool showEntitlementFailed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showEntitlementFailed and: currentErrorMsg
    char __padding34[0x6] = {};
    // private System.String currentErrorMsg
    // Size: 0x8
    // Offset: 0xD8
    ::StringW currentErrorMsg;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean didFailEntitlement
    // Size: 0x1
    // Offset: 0xE0
    bool didFailEntitlement;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean triggeredLogin
    // Size: 0x1
    // Offset: 0xE1
    bool triggeredLogin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: triggeredLogin and: dummyAvatarStartPosition
    char __padding37[0x2] = {};
    // private UnityEngine.Vector3 dummyAvatarStartPosition
    // Size: 0xC
    // Offset: 0xE4
    ::UnityEngine::Vector3 dummyAvatarStartPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.GameObject dummyRig
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::GameObject* dummyRig;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.Texture2D[] fakeTextures
    // Size: 0x8
    // Offset: 0xF8
    ::ArrayW<::UnityEngine::Texture2D*> fakeTextures;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Texture2D*>) == 0x8);
    // private System.Int32 numFakes
    // Size: 0x4
    // Offset: 0x100
    int numFakes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 fakesCreated
    // Size: 0x4
    // Offset: 0x104
    int fakesCreated;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single timeSinceFake
    // Size: 0x4
    // Offset: 0x108
    float timeSinceFake;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeSinceDeletePressed
    // Size: 0x4
    // Offset: 0x10C
    float timeSinceDeletePressed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single deleteConfirmTime
    // Size: 0x4
    // Offset: 0x110
    float deleteConfirmTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean holdingDeleteConfirm
    // Size: 0x1
    // Offset: 0x114
    bool holdingDeleteConfirm;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: holdingDeleteConfirm and: deleteConfirmDial
    char __padding46[0x3] = {};
    // public UnityEngine.UI.Image deleteConfirmDial
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::UI::Image* deleteConfirmDial;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // private System.Boolean waitingOnCharacterList
    // Size: 0x1
    // Offset: 0x120
    bool waitingOnCharacterList;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingOnCharacterList and: timeWaitingOnCharacterList
    char __padding48[0x3] = {};
    // private System.Single timeWaitingOnCharacterList
    // Size: 0x4
    // Offset: 0x124
    float timeWaitingOnCharacterList;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeoutCharacterListAfter
    // Size: 0x4
    // Offset: 0x128
    float timeoutCharacterListAfter;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean didInteract
    // Size: 0x1
    // Offset: 0x12C
    bool didInteract;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean characterSelectBegun
    // Size: 0x1
    // Offset: 0x12D
    bool characterSelectBegun;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean interactionMenuReady
    // Size: 0x1
    // Offset: 0x12E
    bool interactionMenuReady;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean wantsToShowLoginScreen
    // Size: 0x1
    // Offset: 0x12F
    bool wantsToShowLoginScreen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean waitingForLogin
    // Size: 0x1
    // Offset: 0x130
    bool waitingForLogin;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: waitingForLogin and: timeSinceLoginBegan
    char __padding55[0x3] = {};
    // private System.Single timeSinceLoginBegan
    // Size: 0x4
    // Offset: 0x134
    float timeSinceLoginBegan;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single loginTimeoutAfter
    // Size: 0x4
    // Offset: 0x138
    float loginTimeoutAfter;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: loginTimeoutAfter and: keyboardTarget
    char __padding57[0x4] = {};
    // private PowerUI.Element keyboardTarget
    // Size: 0x8
    // Offset: 0x140
    ::PowerUI::Element* keyboardTarget;
    // Field size check
    static_assert(sizeof(::PowerUI::Element*) == 0x8);
    // private System.String accountRealPass
    // Size: 0x8
    // Offset: 0x148
    ::StringW accountRealPass;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private PowerUI.Document menuDocument
    // Size: 0x8
    // Offset: 0x150
    ::PowerUI::Document* menuDocument;
    // Field size check
    static_assert(sizeof(::PowerUI::Document*) == 0x8);
    // private UnityEngine.GameObject creationGrabPoints
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::GameObject* creationGrabPoints;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public SuperTextMesh disciplineName
    // Size: 0x8
    // Offset: 0x160
    ::GlobalNamespace::SuperTextMesh* disciplineName;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public SuperTextMesh disciplineDescription
    // Size: 0x8
    // Offset: 0x168
    ::GlobalNamespace::SuperTextMesh* disciplineDescription;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh*) == 0x8);
    // public System.String[] disciplineNames
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::StringW> disciplineNames;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public UnityEngine.GameObject[] disciplineHighlights
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::UnityEngine::GameObject*> disciplineHighlights;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // [TextAreaAttribute] Offset: 0xADA208
    // public System.String[] disciplineDescriptions
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::StringW> disciplineDescriptions;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public UnityEngine.GameObject[] disciplineWeapons
    // Size: 0x8
    // Offset: 0x188
    ::ArrayW<::UnityEngine::GameObject*> disciplineWeapons;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.GameObject fakeWeapons
    // Size: 0x8
    // Offset: 0x190
    ::UnityEngine::GameObject* fakeWeapons;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public UnityEngine.GameObject menuBacker
    // Size: 0x8
    // Offset: 0x198
    ::UnityEngine::GameObject* menuBacker;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static private System.Boolean internetErrorShowing
    static bool _get_internetErrorShowing();
    // Set static field: static private System.Boolean internetErrorShowing
    static void _set_internetErrorShowing(bool value);
    // Get static field: static private CharacterSelect _Instance
    static ::GlobalNamespace::CharacterSelect* _get__Instance();
    // Set static field: static private CharacterSelect _Instance
    static void _set__Instance(::GlobalNamespace::CharacterSelect* value);
    // Get static field: static private System.Int32 currentGuid
    static int _get_currentGuid();
    // Set static field: static private System.Int32 currentGuid
