// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: LTDescr
#include "GlobalNamespace/LTDescr.hpp"
// Including type: UnityEngine.Quaternion
#include "UnityEngine/Quaternion.hpp"
// Including type: TweenAction
#include "GlobalNamespace/TweenAction.hpp"
// Including type: LeanTweenType
#include "GlobalNamespace/LeanTweenType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Sprite
  class Sprite;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Rect
  struct Rect;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: LTRect
  class LTRect;
  // Forward declaring type: LTBezierPath
  class LTBezierPath;
  // Forward declaring type: LTSpline
  class LTSpline;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Action`2<T1, T2>
  template<typename T1, typename T2>
  class Action_2;
  // Forward declaring type: Action
  class Action;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
  // Forward declaring type: Image
  class Image;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: LTDescrImpl
  class LTDescrImpl;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::LTDescrImpl);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::LTDescrImpl*, "", "LTDescrImpl");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x158
  #pragma pack(push, 1)
  // Autogenerated type: LTDescrImpl
  // [TokenAttribute] Offset: FFFFFFFF
  class LTDescrImpl : public ::Il2CppObject/*, public ::GlobalNamespace::LTDescr*/ {
    public:
    public:
    // [CompilerGeneratedAttribute] Offset: 0xAC29AC
    // private System.Boolean <toggle>k__BackingField
    // Size: 0x1
    // Offset: 0x10
    bool toggle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC29BC
    // private System.Boolean <useEstimatedTime>k__BackingField
    // Size: 0x1
    // Offset: 0x11
    bool useEstimatedTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC29CC
    // private System.Boolean <useFrames>k__BackingField
    // Size: 0x1
    // Offset: 0x12
    bool useFrames;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC29DC
    // private System.Boolean <useManualTime>k__BackingField
    // Size: 0x1
    // Offset: 0x13
    bool useManualTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC29EC
    // private System.Boolean <hasInitiliazed>k__BackingField
    // Size: 0x1
    // Offset: 0x14
    bool hasInitiliazed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC29FC
    // private System.Boolean <hasPhysics>k__BackingField
    // Size: 0x1
    // Offset: 0x15
    bool hasPhysics;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A0C
    // private System.Boolean <onCompleteOnRepeat>k__BackingField
    // Size: 0x1
    // Offset: 0x16
    bool onCompleteOnRepeat;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A1C
    // private System.Boolean <onCompleteOnStart>k__BackingField
    // Size: 0x1
    // Offset: 0x17
    bool onCompleteOnStart;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A2C
    // private System.Single <passed>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    float passed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A3C
    // private System.Single <delay>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    float delay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A4C
    // private System.Single <time>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    float time;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A5C
    // private System.Single <lastVal>k__BackingField
    // Size: 0x4
    // Offset: 0x24
    float lastVal;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt32 _id
    // Size: 0x4
    // Offset: 0x28
    uint id;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A6C
    // private System.Int32 <loopCount>k__BackingField
    // Size: 0x4
    // Offset: 0x2C
    int loopCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A7C
    // private System.UInt32 <counter>k__BackingField
    // Size: 0x4
    // Offset: 0x30
    uint counter;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A8C
    // private System.Single <direction>k__BackingField
    // Size: 0x4
    // Offset: 0x34
    float direction;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2A9C
    // private System.Single <directionLast>k__BackingField
    // Size: 0x4
    // Offset: 0x38
    float directionLast;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2AAC
    // private System.Single <overshoot>k__BackingField
    // Size: 0x4
    // Offset: 0x3C
    float overshoot;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2ABC
    // private System.Single <period>k__BackingField
    // Size: 0x4
    // Offset: 0x40
    float period;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2ACC
    // private System.Boolean <destroyOnComplete>k__BackingField
    // Size: 0x1
    // Offset: 0x44
    bool destroyOnComplete;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: destroyOnComplete and: trans
    char __padding19[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAC2ADC
    // private UnityEngine.Transform <trans>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* trans;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2AEC
    // private UnityEngine.Transform <toTrans>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* toTrans;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2AFC
    // private LTRect <ltRect>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::GlobalNamespace::LTRect* ltRect;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LTRect*) == 0x8);
    // UnityEngine.Vector3 fromInternal
    // Size: 0xC
    // Offset: 0x60
    ::UnityEngine::Vector3 fromInternal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 toInternal
    // Size: 0xC
    // Offset: 0x6C
    ::UnityEngine::Vector3 toInternal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // UnityEngine.Vector3 diffInternal
    // Size: 0xC
    // Offset: 0x78
    ::UnityEngine::Vector3 diffInternal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B0C
    // private UnityEngine.Vector3 <point>k__BackingField
    // Size: 0xC
    // Offset: 0x84
    ::UnityEngine::Vector3 point;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B1C
    // private UnityEngine.Vector3 <axis>k__BackingField
    // Size: 0xC
    // Offset: 0x90
    ::UnityEngine::Vector3 axis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B2C
    // private UnityEngine.Quaternion <origRotation>k__BackingField
    // Size: 0x10
    // Offset: 0x9C
    ::UnityEngine::Quaternion origRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // Padding between fields: origRotation and: path
    char __padding28[0x4] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAC2B3C
    // private LTBezierPath <path>k__BackingField
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::LTBezierPath* path;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LTBezierPath*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B4C
    // private LTSpline <spline>k__BackingField
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::LTSpline* spline;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LTSpline*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B5C
    // private TweenAction <type>k__BackingField
    // Size: 0x4
    // Offset: 0xC0
    ::GlobalNamespace::TweenAction type;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::TweenAction) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B6C
    // private LeanTweenType <tweenType>k__BackingField
    // Size: 0x4
    // Offset: 0xC4
    ::GlobalNamespace::LeanTweenType tweenType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LeanTweenType) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B7C
    // private UnityEngine.AnimationCurve <animationCurve>k__BackingField
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::AnimationCurve* animationCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B8C
    // private LeanTweenType <loopType>k__BackingField
    // Size: 0x4
    // Offset: 0xD0
    ::GlobalNamespace::LeanTweenType loopType;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::LeanTweenType) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xAC2B9C
    // private System.Boolean <hasUpdateCallback>k__BackingField
    // Size: 0x1
    // Offset: 0xD4
    bool hasUpdateCallback;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasUpdateCallback and: onUpdateFloat
    char __padding35[0x3] = {};
    // [CompilerGeneratedAttribute] Offset: 0xAC2BAC
    // private System.Action`1<System.Single> <onUpdateFloat>k__BackingField
    // Size: 0x8
    // Offset: 0xD8
    ::System::Action_1<float>* onUpdateFloat;
    // Field size check
    static_assert(sizeof(::System::Action_1<float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2BBC
    // private System.Action`2<System.Single,System.Single> <onUpdateFloatRatio>k__BackingField
    // Size: 0x8
    // Offset: 0xE0
    ::System::Action_2<float, float>* onUpdateFloatRatio;
    // Field size check
    static_assert(sizeof(::System::Action_2<float, float>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2BCC
    // private System.Action`2<System.Single,System.Object> <onUpdateFloatObject>k__BackingField
    // Size: 0x8
    // Offset: 0xE8
    ::System::Action_2<float, ::Il2CppObject*>* onUpdateFloatObject;
    // Field size check
    static_assert(sizeof(::System::Action_2<float, ::Il2CppObject*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2BDC
    // private System.Action`1<UnityEngine.Vector2> <onUpdateVector2>k__BackingField
    // Size: 0x8
    // Offset: 0xF0
    ::System::Action_1<::UnityEngine::Vector2>* onUpdateVector2;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Vector2>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2BEC
    // private System.Action`1<UnityEngine.Vector3> <onUpdateVector3>k__BackingField
    // Size: 0x8
    // Offset: 0xF8
    ::System::Action_1<::UnityEngine::Vector3>* onUpdateVector3;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Vector3>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2BFC
    // private System.Action`2<UnityEngine.Vector3,System.Object> <onUpdateVector3Object>k__BackingField
    // Size: 0x8
    // Offset: 0x100
    ::System::Action_2<::UnityEngine::Vector3, ::Il2CppObject*>* onUpdateVector3Object;
    // Field size check
    static_assert(sizeof(::System::Action_2<::UnityEngine::Vector3, ::Il2CppObject*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2C0C
    // private System.Action`1<UnityEngine.Color> <onUpdateColor>k__BackingField
    // Size: 0x8
    // Offset: 0x108
    ::System::Action_1<::UnityEngine::Color>* onUpdateColor;
    // Field size check
    static_assert(sizeof(::System::Action_1<::UnityEngine::Color>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2C1C
    // private System.Action <onComplete>k__BackingField
    // Size: 0x8
    // Offset: 0x110
    ::System::Action* onComplete;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2C2C
    // private System.Action`1<System.Object> <onCompleteObject>k__BackingField
    // Size: 0x8
    // Offset: 0x118
    ::System::Action_1<::Il2CppObject*>* onCompleteObject;
    // Field size check
    static_assert(sizeof(::System::Action_1<::Il2CppObject*>*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2C3C
    // private System.Object <onCompleteParam>k__BackingField
    // Size: 0x8
    // Offset: 0x120
    ::Il2CppObject* onCompleteParam;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2C4C
    // private System.Object <onUpdateParam>k__BackingField
    // Size: 0x8
    // Offset: 0x128
    ::Il2CppObject* onUpdateParam;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAC2C5C
    // private System.Action <onStart>k__BackingField
    // Size: 0x8
    // Offset: 0x130
    ::System::Action* onStart;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // public UnityEngine.RectTransform rectTransform
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::RectTransform* rectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // public UnityEngine.UI.Text uiText
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::UI::Text* uiText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // public UnityEngine.UI.Image uiImage
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::UI::Image* uiImage;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Image*) == 0x8);
    // public UnityEngine.Sprite[] sprites
    // Size: 0x8
    // Offset: 0x150
    ::ArrayW<::UnityEngine::Sprite*> sprites;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Sprite*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::GlobalNamespace::LTDescr
    operator ::GlobalNamespace::LTDescr() noexcept {
      return *reinterpret_cast<::GlobalNamespace::LTDescr*>(this);
    }
    // Get static field: static private System.UInt32 global_counter
    static uint _get_global_counter();
    // Set static field: static private System.UInt32 global_counter
    static void _set_global_counter(uint value);
    // Get instance field reference: private System.Boolean <toggle>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$toggle$k__BackingField();
    // Get instance field reference: private System.Boolean <useEstimatedTime>k__BackingField
    [[deprecated("Use field access instead!")]] bool& dyn_$useEstimatedTime$k__BackingField();
