// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: MB3_MeshBakerRoot
#include "GlobalNamespace/MB3_MeshBakerRoot.hpp"
// Including type: DigitalOpus.MB.Core.MB2_LogLevel
#include "DigitalOpus/MB/Core/MB2_LogLevel.hpp"
// Including type: DigitalOpus.MB.Core.MB2_PackingAlgorithmEnum
#include "DigitalOpus/MB/Core/MB2_PackingAlgorithmEnum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MB2_TextureBakeResults
  class MB2_TextureBakeResults;
  // Forward declaring type: MB_MultiMaterial
  class MB_MultiMaterial;
  // Forward declaring type: MB_AtlasesAndRects
  class MB_AtlasesAndRects;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: ShaderTextureProperty
  class ShaderTextureProperty;
  // Forward declaring type: ProgressUpdateDelegate
  class ProgressUpdateDelegate;
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
  // Forward declaring type: MB3_TextureCombiner
  class MB3_TextureCombiner;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: MB3_TextureBaker
  class MB3_TextureBaker;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::MB3_TextureBaker);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::MB3_TextureBaker*, "", "MB3_TextureBaker");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: MB3_TextureBaker
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_TextureBaker : public ::GlobalNamespace::MB3_MeshBakerRoot {
    public:
    // Nested type: ::GlobalNamespace::MB3_TextureBaker::OnCombinedTexturesCoroutineSuccess
    class OnCombinedTexturesCoroutineSuccess;
    // Nested type: ::GlobalNamespace::MB3_TextureBaker::OnCombinedTexturesCoroutineFail
    class OnCombinedTexturesCoroutineFail;
    // Nested type: ::GlobalNamespace::MB3_TextureBaker::CreateAtlasesCoroutineResult
    class CreateAtlasesCoroutineResult;
    // Nested type: ::GlobalNamespace::MB3_TextureBaker::$CreateAtlasesCoroutine$d__94
    class $CreateAtlasesCoroutine$d__94;
    public:
    // public DigitalOpus.MB.Core.MB2_LogLevel LOG_LEVEL
    // Size: 0x4
    // Offset: 0x24
    ::DigitalOpus::MB::Core::MB2_LogLevel LOG_LEVEL;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_LogLevel) == 0x4);
    // protected MB2_TextureBakeResults _textureBakeResults
    // Size: 0x8
    // Offset: 0x28
    ::GlobalNamespace::MB2_TextureBakeResults* textureBakeResults;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB2_TextureBakeResults*) == 0x8);
    // protected System.Int32 _atlasPadding
    // Size: 0x4
    // Offset: 0x30
    int atlasPadding;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _maxAtlasSize
    // Size: 0x4
    // Offset: 0x34
    int maxAtlasSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _useMaxAtlasWidthOverride
    // Size: 0x1
    // Offset: 0x38
    bool useMaxAtlasWidthOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useMaxAtlasWidthOverride and: maxAtlasWidthOverride
    char __padding4[0x3] = {};
    // protected System.Int32 _maxAtlasWidthOverride
    // Size: 0x4
    // Offset: 0x3C
    int maxAtlasWidthOverride;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _useMaxAtlasHeightOverride
    // Size: 0x1
    // Offset: 0x40
    bool useMaxAtlasHeightOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useMaxAtlasHeightOverride and: maxAtlasHeightOverride
    char __padding6[0x3] = {};
    // protected System.Int32 _maxAtlasHeightOverride
    // Size: 0x4
    // Offset: 0x44
    int maxAtlasHeightOverride;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _resizePowerOfTwoTextures
    // Size: 0x1
    // Offset: 0x48
    bool resizePowerOfTwoTextures;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _fixOutOfBoundsUVs
    // Size: 0x1
    // Offset: 0x49
    bool fixOutOfBoundsUVs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: fixOutOfBoundsUVs and: maxTilingBakeSize
    char __padding9[0x2] = {};
    // protected System.Int32 _maxTilingBakeSize
    // Size: 0x4
    // Offset: 0x4C
    int maxTilingBakeSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected DigitalOpus.MB.Core.MB2_PackingAlgorithmEnum _packingAlgorithm
    // Size: 0x4
    // Offset: 0x50
    ::DigitalOpus::MB::Core::MB2_PackingAlgorithmEnum packingAlgorithm;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_PackingAlgorithmEnum) == 0x4);
    // protected System.Boolean _meshBakerTexturePackerForcePowerOfTwo
    // Size: 0x1
    // Offset: 0x54
    bool meshBakerTexturePackerForcePowerOfTwo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: meshBakerTexturePackerForcePowerOfTwo and: customShaderProperties
    char __padding12[0x3] = {};
    // protected System.Collections.Generic.List`1<DigitalOpus.MB.Core.ShaderTextureProperty> _customShaderProperties
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::ShaderTextureProperty*>* customShaderProperties;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::ShaderTextureProperty*>*) == 0x8);
    // protected System.Collections.Generic.List`1<System.String> _customShaderPropNames_Depricated
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::StringW>* customShaderPropNames_Depricated;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // protected System.Boolean _doMultiMaterial
    // Size: 0x1
    // Offset: 0x68
    bool doMultiMaterial;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doMultiMaterialSplitAtlasesIfTooBig
    // Size: 0x1
    // Offset: 0x69
    bool doMultiMaterialSplitAtlasesIfTooBig;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doMultiMaterialSplitAtlasesIfOBUVs
    // Size: 0x1
    // Offset: 0x6A
    bool doMultiMaterialSplitAtlasesIfOBUVs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doMultiMaterialSplitAtlasesIfOBUVs and: resultMaterial
    char __padding17[0x5] = {};
    // protected UnityEngine.Material _resultMaterial
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Material* resultMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected System.Boolean _considerNonTextureProperties
    // Size: 0x1
    // Offset: 0x78
    bool considerNonTextureProperties;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _doSuggestTreatment
    // Size: 0x1
    // Offset: 0x79
    bool doSuggestTreatment;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: doSuggestTreatment and: coroutineResult
    char __padding20[0x6] = {};
    // private MB3_TextureBaker/CreateAtlasesCoroutineResult _coroutineResult
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::MB3_TextureBaker::CreateAtlasesCoroutineResult* coroutineResult;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB3_TextureBaker::CreateAtlasesCoroutineResult*) == 0x8);
    // public MB_MultiMaterial[] resultMaterials
    // Size: 0x8
    // Offset: 0x88
    ::ArrayW<::GlobalNamespace::MB_MultiMaterial*> resultMaterials;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MB_MultiMaterial*>) == 0x8);
    // public System.Collections.Generic.List`1<UnityEngine.GameObject> objsToMesh
    // Size: 0x8
    // Offset: 0x90
    ::System::Collections::Generic::List_1<::UnityEngine::GameObject*>* objsToMesh;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::GameObject*>*) == 0x8);
    // public MB3_TextureBaker/OnCombinedTexturesCoroutineSuccess onBuiltAtlasesSuccess
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::MB3_TextureBaker::OnCombinedTexturesCoroutineSuccess* onBuiltAtlasesSuccess;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB3_TextureBaker::OnCombinedTexturesCoroutineSuccess*) == 0x8);
    // public MB3_TextureBaker/OnCombinedTexturesCoroutineFail onBuiltAtlasesFail
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::MB3_TextureBaker::OnCombinedTexturesCoroutineFail* onBuiltAtlasesFail;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB3_TextureBaker::OnCombinedTexturesCoroutineFail*) == 0x8);
    // public MB_AtlasesAndRects[] OnCombinedTexturesCoroutineAtlasesAndRects
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::GlobalNamespace::MB_AtlasesAndRects*> OnCombinedTexturesCoroutineAtlasesAndRects;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::MB_AtlasesAndRects*>) == 0x8);
    public:
    // Get instance field reference: public DigitalOpus.MB.Core.MB2_LogLevel LOG_LEVEL
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MB2_LogLevel& dyn_LOG_LEVEL();
    // Get instance field reference: protected MB2_TextureBakeResults _textureBakeResults
    [[deprecated("Use field access instead!")]] ::GlobalNamespace::MB2_TextureBakeResults*& dyn__textureBakeResults();
    // Get instance field reference: protected System.Int32 _atlasPadding
    [[deprecated("Use field access instead!")]] int& dyn__atlasPadding();
    // Get instance field reference: protected System.Int32 _maxAtlasSize
    [[deprecated("Use field access instead!")]] int& dyn__maxAtlasSize();
