// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Valve.VR.VRControllerState_t
#include "Valve/VR/VRControllerState_t.hpp"
// Including type: OVRInput/Controller
#include "GlobalNamespace/OVRInput.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: OrbusTrackedController
  class OrbusTrackedController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::OrbusTrackedController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::OrbusTrackedController*, "", "OrbusTrackedController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x188
  #pragma pack(push, 1)
  // Autogenerated type: OrbusTrackedController
  // [TokenAttribute] Offset: FFFFFFFF
  class OrbusTrackedController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.UInt32 controllerIndex
    // Size: 0x4
    // Offset: 0x18
    uint controllerIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: controllerIndex and: controllerState
    char __padding0[0x4] = {};
    // public Valve.VR.VRControllerState_t controllerState
    // Size: 0x40
    // Offset: 0x20
    ::Valve::VR::VRControllerState_t controllerState;
    // Field size check
    static_assert(sizeof(::Valve::VR::VRControllerState_t) == 0x40);
    // public System.Boolean triggerPressed
    // Size: 0x1
    // Offset: 0x60
    bool triggerPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean steamPressed
    // Size: 0x1
    // Offset: 0x61
    bool steamPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean menuPressed
    // Size: 0x1
    // Offset: 0x62
    bool menuPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean oculusButtonPressed
    // Size: 0x1
    // Offset: 0x63
    bool oculusButtonPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean padPressed
    // Size: 0x1
    // Offset: 0x64
    bool padPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean padTouched
    // Size: 0x1
    // Offset: 0x65
    bool padTouched;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean gripped
    // Size: 0x1
    // Offset: 0x66
    bool gripped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isGesturePointing
    // Size: 0x1
    // Offset: 0x67
    bool isGesturePointing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isGestureThumbUp
    // Size: 0x1
    // Offset: 0x68
    bool isGestureThumbUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isGestureThumbUp and: realTimeLastPadClick
    char __padding10[0x3] = {};
    // private System.Single realTimeLastPadClick
    // Size: 0x4
    // Offset: 0x6C
    float realTimeLastPadClick;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single padClickTimeAllowed
    // Size: 0x4
    // Offset: 0x70
    float padClickTimeAllowed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single timeSinceTriggerClicked
    // Size: 0x4
    // Offset: 0x74
    float timeSinceTriggerClicked;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean disableGrip
    // Size: 0x1
    // Offset: 0x78
    bool disableGrip;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableTrigger
    // Size: 0x1
    // Offset: 0x79
    bool disableTrigger;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disablePadButton
    // Size: 0x1
    // Offset: 0x7A
    bool disablePadButton;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disablePadButton and: MenuButtonClicked
    char __padding16[0x5] = {};
    // [CompilerGeneratedAttribute] Offset: 0xADA218
    // private ClickedEventHandler MenuButtonClicked
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::ClickedEventHandler* MenuButtonClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA228
    // private ClickedEventHandler MenuButtonUnclicked
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::ClickedEventHandler* MenuButtonUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA238
    // private ClickedEventHandler TriggerClicked
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::ClickedEventHandler* TriggerClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA248
    // private ClickedEventHandler TriggerUnclicked
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::ClickedEventHandler* TriggerUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA258
    // private ClickedEventHandler SteamClicked
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::ClickedEventHandler* SteamClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA268
    // private ClickedEventHandler PadClicked
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::ClickedEventHandler* PadClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA278
    // private ClickedEventHandler PadUnclicked
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::ClickedEventHandler* PadUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA288
    // private ClickedEventHandler PadTouched
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::ClickedEventHandler* PadTouched;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA298
    // private ClickedEventHandler PadUntouched
    // Size: 0x8
    // Offset: 0xC0
    ::GlobalNamespace::ClickedEventHandler* PadUntouched;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA2A8
    // private ClickedEventHandler Gripped
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::ClickedEventHandler* Gripped;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA2B8
    // private ClickedEventHandler Ungripped
    // Size: 0x8
    // Offset: 0xD0
    ::GlobalNamespace::ClickedEventHandler* Ungripped;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA2C8
    // private ClickedEventHandler PadTouchMoved
    // Size: 0x8
    // Offset: 0xD8
    ::GlobalNamespace::ClickedEventHandler* PadTouchMoved;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA2D8
    // private ClickedEventHandler PadDoubleClicked
    // Size: 0x8
    // Offset: 0xE0
    ::GlobalNamespace::ClickedEventHandler* PadDoubleClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA2E8
    // private ClickedEventHandler OculusButtonClicked
    // Size: 0x8
    // Offset: 0xE8
    ::GlobalNamespace::ClickedEventHandler* OculusButtonClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA2F8
    // private ClickedEventHandler OculusButtonUnclicked
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::ClickedEventHandler* OculusButtonUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA308
    // private ClickedEventHandler ModuleOverridePadTouchMoved
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::ClickedEventHandler* ModuleOverridePadTouchMoved;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA318
    // private ClickedEventHandler ModuleOverridePadUntouched
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::ClickedEventHandler* ModuleOverridePadUntouched;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // private System.Single hapticTimer
    // Size: 0x4
    // Offset: 0x108
    float hapticTimer;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private OVRInput/Controller myOVRController
    // Size: 0x4
    // Offset: 0x10C
    ::GlobalNamespace::OVRInput::Controller myOVRController;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::OVRInput::Controller) == 0x4);
    // private System.Boolean firstFrame
    // Size: 0x1
    // Offset: 0x110
    bool firstFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: firstFrame and: ovrControllerIndex
    char __padding36[0x3] = {};
    // public System.Int32 ovrControllerIndex
    // Size: 0x4
    // Offset: 0x114
    int ovrControllerIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xADA328
    // private UnityEngine.Vector3 <velocity>k__BackingField
    // Size: 0xC
    // Offset: 0x118
    ::UnityEngine::Vector3 velocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xADA338
    // private UnityEngine.Vector3 <angularVelocity>k__BackingField
    // Size: 0xC
    // Offset: 0x124
    ::UnityEngine::Vector3 angularVelocity;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 oculusPositionAdjustment
    // Size: 0xC
    // Offset: 0x130
    ::UnityEngine::Vector3 oculusPositionAdjustment;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Boolean isIndexController
    // Size: 0x1
    // Offset: 0x13C
    bool isIndexController;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isIndexController and: prevQuaternion
    char __padding41[0x3] = {};
    // private UnityEngine.Quaternion prevQuaternion
    // Size: 0x10
    // Offset: 0x140
    ::UnityEngine::Quaternion prevQuaternion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion currentQuaternion
    // Size: 0x10
    // Offset: 0x150
    ::UnityEngine::Quaternion currentQuaternion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 prevPosition
    // Size: 0xC
    // Offset: 0x160
    ::UnityEngine::Vector3 prevPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 currentPosition
    // Size: 0xC
    // Offset: 0x16C
    ::UnityEngine::Vector3 currentPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single timeSinceFixedUpdate
    // Size: 0x4
    // Offset: 0x178
    float timeSinceFixedUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: timeSinceFixedUpdate and: posSamples
    char __padding46[0x4] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> posSamples
    // Size: 0x8
    // Offset: 0x180
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* posSamples;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.UInt32 controllerIndex
    [[deprecated("Use field access instead!")]] uint& dyn_controllerIndex();
    // Get instance field reference: public Valve.VR.VRControllerState_t controllerState
    [[deprecated("Use field access instead!")]] ::Valve::VR::VRControllerState_t& dyn_controllerState();
    // Get instance field reference: public System.Boolean triggerPressed
    [[deprecated("Use field access instead!")]] bool& dyn_triggerPressed();
    // Get instance field reference: public System.Boolean steamPressed
