// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: InteractableObject
#include "GlobalNamespace/InteractableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Rigidbody
  class Rigidbody;
  // Forward declaring type: BoxCollider
  class BoxCollider;
  // Forward declaring type: GameObject
  class GameObject;
}
// Forward declaring namespace: MagicalActual
namespace MagicalActual {
  // Forward declaring type: Grabber
  class Grabber;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: PhysicsInteractable
  class PhysicsInteractable;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::PhysicsInteractable);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::PhysicsInteractable*, "", "PhysicsInteractable");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x100
  #pragma pack(push, 1)
  // Autogenerated type: PhysicsInteractable
  // [TokenAttribute] Offset: FFFFFFFF
  // [RequireComponent] Offset: ACE028
  // [RequireComponent] Offset: ACE028
  class PhysicsInteractable : public ::GlobalNamespace::InteractableObject {
    public:
    // Nested type: ::GlobalNamespace::PhysicsInteractable::GameObjectEvent
    class GameObjectEvent;
    public:
    // public System.Boolean canPickUp
    // Size: 0x1
    // Offset: 0x18
    bool canPickUp;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte pickUpTracker
    // Size: 0x1
    // Offset: 0x19
    uint8_t pickUpTracker;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte grabIndicatorTracker
    // Size: 0x1
    // Offset: 0x1A
    uint8_t grabIndicatorTracker;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Boolean setFirst
    // Size: 0x1
    // Offset: 0x1B
    bool setFirst;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean isEnemy
    // Size: 0x1
    // Offset: 0x1C
    bool isEnemy;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean throwWhenReleased
    // Size: 0x1
    // Offset: 0x1D
    bool throwWhenReleased;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean cloneToGrab
    // Size: 0x1
    // Offset: 0x1E
    bool cloneToGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isAClone
    // Size: 0x1
    // Offset: 0x1F
    bool isAClone;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean hideHandWhenHolding
    // Size: 0x1
    // Offset: 0x20
    bool hideHandWhenHolding;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean orientWhenGrabbed
    // Size: 0x1
    // Offset: 0x21
    bool orientWhenGrabbed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean allowLongRangeGrab
    // Size: 0x1
    // Offset: 0x22
    bool allowLongRangeGrab;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hideLongRangeGrabCircle
    // Size: 0x1
    // Offset: 0x23
    bool hideLongRangeGrabCircle;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean ignoreOffset
    // Size: 0x1
    // Offset: 0x24
    bool ignoreOffset;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: ignoreOffset and: grabOrientation
    char __padding12[0x3] = {};
    // public UnityEngine.Vector3 grabOrientation
    // Size: 0xC
    // Offset: 0x28
    ::UnityEngine::Vector3 grabOrientation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 grabOrientationVive
    // Size: 0xC
    // Offset: 0x34
    ::UnityEngine::Vector3 grabOrientationVive;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 grabOffset
    // Size: 0xC
    // Offset: 0x40
    ::UnityEngine::Vector3 grabOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: grabOffset and: myRigidBody
    char __padding15[0x4] = {};
    // public UnityEngine.Rigidbody myRigidBody
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Rigidbody* myRigidBody;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rigidbody*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA4A8
    // private MagicalActual.Grabber <attachedToObject>k__BackingField
    // Size: 0x8
    // Offset: 0x58
    ::MagicalActual::Grabber* attachedToObject;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // public MagicalActual.Grabber lastClonedGrabber
    // Size: 0x8
    // Offset: 0x60
    ::MagicalActual::Grabber* lastClonedGrabber;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private UnityEngine.BoxCollider myBoxCollider
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::BoxCollider* myBoxCollider;
    // Field size check
    static_assert(sizeof(::UnityEngine::BoxCollider*) == 0x8);
    // public System.Boolean broadcastToNetwork
    // Size: 0x1
    // Offset: 0x70
    bool broadcastToNetwork;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: broadcastToNetwork and: networkKey
    char __padding20[0x7] = {};
    // public System.String networkKey
    // Size: 0x8
    // Offset: 0x78
    ::StringW networkKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.GameObject clonedCopy
    // Size: 0x8
    // Offset: 0x80
    ::UnityEngine::GameObject* clonedCopy;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Boolean isFakeGrabbing
    // Size: 0x1
    // Offset: 0x88
    bool isFakeGrabbing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isFakeGrabbing and: myGrabIndicator
    char __padding23[0x7] = {};
    // [CompilerGeneratedAttribute] Offset: 0xADA4D8
    // private UnityEngine.GameObject <myGrabIndicator>k__BackingField
    // Size: 0x8
    // Offset: 0x90
    ::UnityEngine::GameObject* myGrabIndicator;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private System.Single lastShakeIndicator
    // Size: 0x4
    // Offset: 0x98
    float lastShakeIndicator;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lastShook
    // Size: 0x4
    // Offset: 0x9C
    float lastShook;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single allowShakeEvery
    // Size: 0x4
    // Offset: 0xA0
    float allowShakeEvery;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single shakeThreshold
    // Size: 0x4
    // Offset: 0xA4
    float shakeThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 previousPosition
    // Size: 0xC
    // Offset: 0xA8
    ::UnityEngine::Vector3 previousPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 prevDirection
    // Size: 0xC
    // Offset: 0xB4
    ::UnityEngine::Vector3 prevDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Int32 numShakes
    // Size: 0x4
    // Offset: 0xC0
    int numShakes;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: numShakes and: latestGrabber
    char __padding31[0x4] = {};
    // private MagicalActual.Grabber latestGrabber
    // Size: 0x8
    // Offset: 0xC8
    ::MagicalActual::Grabber* latestGrabber;
    // Field size check
    static_assert(sizeof(::MagicalActual::Grabber*) == 0x8);
    // private UnityEngine.Vector3 originalGrabLocation
    // Size: 0xC
    // Offset: 0xD0
    ::UnityEngine::Vector3 originalGrabLocation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean justGrabbed
    // Size: 0x1
    // Offset: 0xDC
    bool justGrabbed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: justGrabbed and: stickyGrabTime
    char __padding34[0x3] = {};
    // private System.Single stickyGrabTime
    // Size: 0x4
    // Offset: 0xE0
    float stickyGrabTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single stickyGrabTimeNeeded
    // Size: 0x4
    // Offset: 0xE4
    float stickyGrabTimeNeeded;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean ignoreFirstUngrip
    // Size: 0x1
    // Offset: 0xE8
    bool ignoreFirstUngrip;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean noStickyGrip
    // Size: 0x1
    // Offset: 0xE9
    bool noStickyGrip;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: noStickyGrip and: doGripEvent
    char __padding38[0x6] = {};
    // public PhysicsInteractable/GameObjectEvent doGripEvent
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::PhysicsInteractable::GameObjectEvent* doGripEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable::GameObjectEvent*) == 0x8);
    // public PhysicsInteractable/GameObjectEvent doUngripEvent
    // Size: 0x8
    // Offset: 0xF8
    ::GlobalNamespace::PhysicsInteractable::GameObjectEvent* doUngripEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::PhysicsInteractable::GameObjectEvent*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Boolean canPickUp
    [[deprecated("Use field access instead!")]] bool& dyn_canPickUp();
    // Get instance field reference: private System.Byte pickUpTracker
    [[deprecated("Use field access instead!")]] uint8_t& dyn_pickUpTracker();
    // Get instance field reference: private System.Byte grabIndicatorTracker
    [[deprecated("Use field access instead!")]] uint8_t& dyn_grabIndicatorTracker();
    // Get instance field reference: private System.Boolean setFirst
    [[deprecated("Use field access instead!")]] bool& dyn_setFirst();
