// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: ProceduralWorld
#include "GlobalNamespace/ProceduralWorld.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::ProceduralWorld::ProceduralPrefab);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::ProceduralWorld::ProceduralPrefab*, "", "ProceduralWorld/ProceduralPrefab");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x35
  #pragma pack(push, 1)
  // Autogenerated type: ProceduralWorld/ProceduralPrefab
  // [TokenAttribute] Offset: FFFFFFFF
  class ProceduralWorld::ProceduralPrefab : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.GameObject prefab
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::GameObject* prefab;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public System.Single density
    // Size: 0x4
    // Offset: 0x18
    float density;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single perlin
    // Size: 0x4
    // Offset: 0x1C
    float perlin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single perlinPower
    // Size: 0x4
    // Offset: 0x20
    float perlinPower;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector2 perlinOffset
    // Size: 0x8
    // Offset: 0x24
    ::UnityEngine::Vector2 perlinOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // public System.Single perlinScale
    // Size: 0x4
    // Offset: 0x2C
    float perlinScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single random
    // Size: 0x4
    // Offset: 0x30
    float random;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean singleFixed
    // Size: 0x1
    // Offset: 0x34
    bool singleFixed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: public UnityEngine.GameObject prefab
    [[deprecated("Use field access instead!")]] ::UnityEngine::GameObject*& dyn_prefab();
    // Get instance field reference: public System.Single density
    [[deprecated("Use field access instead!")]] float& dyn_density();
    // Get instance field reference: public System.Single perlin
    [[deprecated("Use field access instead!")]] float& dyn_perlin();
    // Get instance field reference: public System.Single perlinPower
    [[deprecated("Use field access instead!")]] float& dyn_perlinPower();
    // Get instance field reference: public UnityEngine.Vector2 perlinOffset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector2& dyn_perlinOffset();
    // Get instance field reference: public System.Single perlinScale
    [[deprecated("Use field access instead!")]] float& dyn_perlinScale();
    // Get instance field reference: public System.Single random
    [[deprecated("Use field access instead!")]] float& dyn_random();
    // Get instance field reference: public System.Boolean singleFixed
    [[deprecated("Use field access instead!")]] bool& dyn_singleFixed();
    // public System.Void .ctor()
    // Offset: 0xE1F970
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ProceduralWorld::ProceduralPrefab* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::GlobalNamespace::ProceduralWorld::ProceduralPrefab::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ProceduralWorld::ProceduralPrefab*, creationType>()));
    }
  }; // ProceduralWorld/ProceduralPrefab
  #pragma pack(pop)
  static check_size<sizeof(ProceduralWorld::ProceduralPrefab), 52 + sizeof(bool)> __GlobalNamespace_ProceduralWorld_ProceduralPrefabSizeCheck;
  static_assert(sizeof(ProceduralWorld::ProceduralPrefab) == 0x35);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: GlobalNamespace::ProceduralWorld::ProceduralPrefab::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
