// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: Valve.VR.VRControllerState_t
#include "Valve/VR/VRControllerState_t.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: ClickedEventHandler
  class ClickedEventHandler;
  // Forward declaring type: ClickedEventArgs
  struct ClickedEventArgs;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SteamVR_TrackedController
  class SteamVR_TrackedController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SteamVR_TrackedController);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SteamVR_TrackedController*, "", "SteamVR_TrackedController");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xC0
  #pragma pack(push, 1)
  // Autogenerated type: SteamVR_TrackedController
  // [TokenAttribute] Offset: FFFFFFFF
  class SteamVR_TrackedController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // public System.UInt32 controllerIndex
    // Size: 0x4
    // Offset: 0x18
    uint controllerIndex;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: controllerIndex and: controllerState
    char __padding0[0x4] = {};
    // public Valve.VR.VRControllerState_t controllerState
    // Size: 0x40
    // Offset: 0x20
    ::Valve::VR::VRControllerState_t controllerState;
    // Field size check
    static_assert(sizeof(::Valve::VR::VRControllerState_t) == 0x40);
    // public System.Boolean triggerPressed
    // Size: 0x1
    // Offset: 0x60
    bool triggerPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean steamPressed
    // Size: 0x1
    // Offset: 0x61
    bool steamPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean menuPressed
    // Size: 0x1
    // Offset: 0x62
    bool menuPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean padPressed
    // Size: 0x1
    // Offset: 0x63
    bool padPressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean padTouched
    // Size: 0x1
    // Offset: 0x64
    bool padTouched;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean gripped
    // Size: 0x1
    // Offset: 0x65
    bool gripped;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: gripped and: MenuButtonClicked
    char __padding7[0x2] = {};
    // [CompilerGeneratedAttribute] Offset: 0xADC7AC
    // private ClickedEventHandler MenuButtonClicked
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::ClickedEventHandler* MenuButtonClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC7BC
    // private ClickedEventHandler MenuButtonUnclicked
    // Size: 0x8
    // Offset: 0x70
    ::GlobalNamespace::ClickedEventHandler* MenuButtonUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC7CC
    // private ClickedEventHandler TriggerClicked
    // Size: 0x8
    // Offset: 0x78
    ::GlobalNamespace::ClickedEventHandler* TriggerClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC7DC
    // private ClickedEventHandler TriggerUnclicked
    // Size: 0x8
    // Offset: 0x80
    ::GlobalNamespace::ClickedEventHandler* TriggerUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC7EC
    // private ClickedEventHandler SteamClicked
    // Size: 0x8
    // Offset: 0x88
    ::GlobalNamespace::ClickedEventHandler* SteamClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC7FC
    // private ClickedEventHandler PadClicked
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::ClickedEventHandler* PadClicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC80C
    // private ClickedEventHandler PadUnclicked
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::ClickedEventHandler* PadUnclicked;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC81C
    // private ClickedEventHandler PadTouched
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::ClickedEventHandler* PadTouched;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC82C
    // private ClickedEventHandler PadUntouched
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::ClickedEventHandler* PadUntouched;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC83C
    // private ClickedEventHandler Gripped
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::ClickedEventHandler* Gripped;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADC84C
    // private ClickedEventHandler Ungripped
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::ClickedEventHandler* Ungripped;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::ClickedEventHandler*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.UInt32 controllerIndex
    [[deprecated("Use field access instead!")]] uint& dyn_controllerIndex();
    // Get instance field reference: public Valve.VR.VRControllerState_t controllerState
    [[deprecated("Use field access instead!")]] ::Valve::VR::VRControllerState_t& dyn_controllerState();
    // Get instance field reference: public System.Boolean triggerPressed
    [[deprecated("Use field access instead!")]] bool& dyn_triggerPressed();
    // Get instance field reference: public System.Boolean steamPressed
    [[deprecated("Use field access instead!")]] bool& dyn_steamPressed();
