// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.CharacterInfo
#include "UnityEngine/CharacterInfo.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: SuperTextMesh/Alignment
#include "GlobalNamespace/SuperTextMesh.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: STMDrawAnimData
  class STMDrawAnimData;
  // Forward declaring type: STMColorData
  class STMColorData;
  // Forward declaring type: STMGradientData
  class STMGradientData;
  // Forward declaring type: STMTextureData
  class STMTextureData;
  // Forward declaring type: STMDelayData
  class STMDelayData;
  // Forward declaring type: STMWaveData
  class STMWaveData;
  // Forward declaring type: STMJitterData
  class STMJitterData;
  // Forward declaring type: STMAudioClipData
  class STMAudioClipData;
  // Forward declaring type: STMFontData
  class STMFontData;
  // Forward declaring type: STMQuadData
  class STMQuadData;
  // Forward declaring type: STMMaterialData
  class STMMaterialData;
  // Forward declaring type: STMSoundClipData
  class STMSoundClipData;
  // Skipping declaration: SuperTextMesh because it is already included!
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Vector2
  struct Vector2;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: STMTextInfo
  class STMTextInfo;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::STMTextInfo);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::STMTextInfo*, "", "STMTextInfo");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x194
  #pragma pack(push, 1)
  // Autogenerated type: STMTextInfo
  // [TokenAttribute] Offset: FFFFFFFF
  class STMTextInfo : public ::Il2CppObject {
    public:
    public:
    // public UnityEngine.CharacterInfo ch
    // Size: 0x31
    // Offset: 0x10
    ::UnityEngine::CharacterInfo ch;
    // Field size check
    static_assert(sizeof(::UnityEngine::CharacterInfo) == 0x31);
    // Padding between fields: ch and: pos
    char __padding0[0x3] = {};
    // public UnityEngine.Vector3 pos
    // Size: 0xC
    // Offset: 0x44
    ::UnityEngine::Vector3 pos;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public System.Single readTime
    // Size: 0x4
    // Offset: 0x50
    float readTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single unreadTime
    // Size: 0x4
    // Offset: 0x54
    float unreadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 line
    // Size: 0x4
    // Offset: 0x58
    int line;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 rawIndex
    // Size: 0x4
    // Offset: 0x5C
    int rawIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single indent
    // Size: 0x4
    // Offset: 0x60
    float indent;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: indent and: drawAnimData
    char __padding6[0x4] = {};
    // public STMDrawAnimData drawAnimData
    // Size: 0x8
    // Offset: 0x68
    ::GlobalNamespace::STMDrawAnimData* drawAnimData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMDrawAnimData*) == 0x8);
    // public System.Single size
    // Size: 0x4
    // Offset: 0x70
    float size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public SuperTextMesh/Alignment alignment
    // Size: 0x4
    // Offset: 0x74
    ::GlobalNamespace::SuperTextMesh::Alignment alignment;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::Alignment) == 0x4);
    // public SuperTextMesh/DrawOrder drawOrder
    // Size: 0x4
    // Offset: 0x78
    ::GlobalNamespace::SuperTextMesh::DrawOrder drawOrder;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::DrawOrder) == 0x4);
    // Padding between fields: drawOrder and: ev
    char __padding10[0x4] = {};
    // public System.Collections.Generic.List`1<System.String> ev
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::StringW>* ev;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> ev2
    // Size: 0x8
    // Offset: 0x88
    ::System::Collections::Generic::List_1<::StringW>* ev2;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public STMColorData colorData
    // Size: 0x8
    // Offset: 0x90
    ::GlobalNamespace::STMColorData* colorData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMColorData*) == 0x8);
    // public STMGradientData gradientData
    // Size: 0x8
    // Offset: 0x98
    ::GlobalNamespace::STMGradientData* gradientData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMGradientData*) == 0x8);
    // public STMTextureData textureData
    // Size: 0x8
    // Offset: 0xA0
    ::GlobalNamespace::STMTextureData* textureData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMTextureData*) == 0x8);
    // public STMDelayData delayData
    // Size: 0x8
    // Offset: 0xA8
    ::GlobalNamespace::STMDelayData* delayData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMDelayData*) == 0x8);
    // public STMWaveData waveData
    // Size: 0x8
    // Offset: 0xB0
    ::GlobalNamespace::STMWaveData* waveData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMWaveData*) == 0x8);
    // public STMJitterData jitterData
    // Size: 0x8
    // Offset: 0xB8
    ::GlobalNamespace::STMJitterData* jitterData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMJitterData*) == 0x8);
    // public System.Single readDelay
    // Size: 0x4
    // Offset: 0xC0
    float readDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: readDelay and: audioClipData
    char __padding19[0x4] = {};
    // public STMAudioClipData audioClipData
    // Size: 0x8
    // Offset: 0xC8
    ::GlobalNamespace::STMAudioClipData* audioClipData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMAudioClipData*) == 0x8);
    // public System.Boolean stopPreviousSound
    // Size: 0x1
    // Offset: 0xD0
    bool stopPreviousSound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: stopPreviousSound and: pitchMode
    char __padding21[0x3] = {};
    // public SuperTextMesh/PitchMode pitchMode
    // Size: 0x4
    // Offset: 0xD4
    ::GlobalNamespace::SuperTextMesh::PitchMode pitchMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::PitchMode) == 0x4);
    // public System.Single overridePitch
    // Size: 0x4
    // Offset: 0xD8
    float overridePitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single minPitch
    // Size: 0x4
    // Offset: 0xDC
    float minPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single maxPitch
    // Size: 0x4
    // Offset: 0xE0
    float maxPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single speedReadPitch
    // Size: 0x4
    // Offset: 0xE4
    float speedReadPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public STMFontData fontData
    // Size: 0x8
    // Offset: 0xE8
    ::GlobalNamespace::STMFontData* fontData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMFontData*) == 0x8);
    // public STMQuadData quadData
    // Size: 0x8
    // Offset: 0xF0
    ::GlobalNamespace::STMQuadData* quadData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMQuadData*) == 0x8);
    // public System.Boolean isQuad
    // Size: 0x1
    // Offset: 0xF8
    bool isQuad;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isQuad and: quadIndex
    char __padding29[0x3] = {};
    // public System.Int32 quadIndex
    // Size: 0x4
    // Offset: 0xFC
    int quadIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public STMMaterialData materialData
    // Size: 0x8
    // Offset: 0x100
    ::GlobalNamespace::STMMaterialData* materialData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMMaterialData*) == 0x8);
    // public STMSoundClipData soundClipData
    // Size: 0x8
    // Offset: 0x108
    ::GlobalNamespace::STMSoundClipData* soundClipData;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMSoundClipData*) == 0x8);
    // public System.Int32 IdxIdentifier
    // Size: 0x4
    // Offset: 0x110
    int IdxIdentifier;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean InfoInUse
    // Size: 0x1
    // Offset: 0x114
    bool InfoInUse;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: InfoInUse and: chGlyphIndex
    char __padding34[0x3] = {};
    // private System.Int32 chGlyphIndex
    // Size: 0x4
    // Offset: 0x118
    int chGlyphIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chMinX
    // Size: 0x4
    // Offset: 0x11C
    int chMinX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chMaxX
    // Size: 0x4
    // Offset: 0x120
    int chMaxX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chMinY
    // Size: 0x4
    // Offset: 0x124
    int chMinY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chMaxY
    // Size: 0x4
    // Offset: 0x128
    int chMaxY;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chSize
    // Size: 0x4
    // Offset: 0x12C
    int chSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 _topLeftVert
    // Size: 0xC
    // Offset: 0x130
    ::UnityEngine::Vector3 topLeftVert;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _topRightVert
    // Size: 0xC
    // Offset: 0x13C
    ::UnityEngine::Vector3 topRightVert;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _bottomRightVert
    // Size: 0xC
    // Offset: 0x148
    ::UnityEngine::Vector3 bottomRightVert;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _bottomLeftVert
    // Size: 0xC
    // Offset: 0x154
    ::UnityEngine::Vector3 bottomLeftVert;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 _middle
    // Size: 0xC
    // Offset: 0x160
    ::UnityEngine::Vector3 middle;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 RelativePos_ReturnVal
    // Size: 0xC
    // Offset: 0x16C
    ::UnityEngine::Vector3 RelativePos_ReturnVal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single RelativePos_Multiplier
    // Size: 0x4
    // Offset: 0x178
    float RelativePos_Multiplier;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 RelativePos2_ReturnVal
    // Size: 0xC
    // Offset: 0x17C
    ::UnityEngine::Vector3 RelativePos2_ReturnVal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 Advance_ReturnVal
    // Size: 0xC
    // Offset: 0x188
    ::UnityEngine::Vector3 Advance_ReturnVal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Get instance field reference: public UnityEngine.CharacterInfo ch
    [[deprecated("Use field access instead!")]] ::UnityEngine::CharacterInfo& dyn_ch();
    // Get instance field reference: public UnityEngine.Vector3 pos
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_pos();
    // Get instance field reference: public System.Single readTime
    [[deprecated("Use field access instead!")]] float& dyn_readTime();
    // Get instance field reference: public System.Single unreadTime
    [[deprecated("Use field access instead!")]] float& dyn_unreadTime();
    // Get instance field reference: public System.Int32 line
    [[deprecated("Use field access instead!")]] int& dyn_line();
    // Get instance field reference: public System.Int32 rawIndex
