// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.UI.ILayoutElement
#include "UnityEngine/UI/ILayoutElement.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Including type: UnityEngine.FilterMode
#include "UnityEngine/FilterMode.hpp"
// Including type: UnityEngine.FontStyle
#include "UnityEngine/FontStyle.hpp"
// Including type: UnityEngine.TextAnchor
#include "UnityEngine/TextAnchor.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: System.Collections.Generic.KeyValuePair`2
#include "System/Collections/Generic/KeyValuePair_2.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Coroutine
  class Coroutine;
  // Forward declaring type: Mesh
  class Mesh;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: AudioSource
  class AudioSource;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: MeshFilter
  class MeshFilter;
  // Forward declaring type: MeshRenderer
  class MeshRenderer;
  // Forward declaring type: CanvasRenderer
  class CanvasRenderer;
  // Forward declaring type: Font
  class Font;
  // Forward declaring type: AudioClip
  class AudioClip;
  // Forward declaring type: RectTransform
  class RectTransform;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMeshData
  class SuperTextMeshData;
  // Forward declaring type: STMTextInfo
  class STMTextInfo;
  // Forward declaring type: SubMeshData
  class SubMeshData;
  // Forward declaring type: STMDrawAnimData
  class STMDrawAnimData;
  // Forward declaring type: STMColorData
  class STMColorData;
  // Forward declaring type: STMWaveControl
  class STMWaveControl;
  // Forward declaring type: STMWaveRotationControl
  class STMWaveRotationControl;
  // Forward declaring type: STMWaveScaleControl
  class STMWaveScaleControl;
  // Forward declaring type: STMJitterData
  class STMJitterData;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: UnityEngine::Events
namespace UnityEngine::Events {
  // Forward declaring type: UnityEvent
  class UnityEvent;
}
// Forward declaring namespace: UnityEngine::SceneManagement
namespace UnityEngine::SceneManagement {
  // Forward declaring type: Scene
  struct Scene;
  // Forward declaring type: LoadSceneMode
  struct LoadSceneMode;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: SuperTextMesh
  class SuperTextMesh;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::SuperTextMesh);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::SuperTextMesh*, "", "SuperTextMesh");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0x500
  #pragma pack(push, 1)
  // Autogenerated type: SuperTextMesh
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: ACDB64
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [ExecuteInEditMode] Offset: FFFFFFFF
  // [HelpURLAttribute] Offset: ACDB64
  class SuperTextMesh : public ::UnityEngine::MonoBehaviour/*, public ::UnityEngine::UI::ILayoutElement*/ {
    public:
    // Nested type: ::GlobalNamespace::SuperTextMesh::PitchMode
    struct PitchMode;
    // Nested type: ::GlobalNamespace::SuperTextMesh::Alignment
    struct Alignment;
    // Nested type: ::GlobalNamespace::SuperTextMesh::VerticalLimitMode
    struct VerticalLimitMode;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnCompleteAction
    class OnCompleteAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnUndrawnAction
    class OnUndrawnAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnRebuildAction
    class OnRebuildAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnPrintAction
    class OnPrintAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::CustomEvent
    class CustomEvent;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnCustomAction
    class OnCustomAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::VertexMod
    class VertexMod;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnVertexModAction
    class OnVertexModAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::PreParse
    class PreParse;
    // Nested type: ::GlobalNamespace::SuperTextMesh::OnPreParseAction
    class OnPreParseAction;
    // Nested type: ::GlobalNamespace::SuperTextMesh::DrawOrder
    struct DrawOrder;
    // Nested type: ::GlobalNamespace::SuperTextMesh::BestFitMode
    struct BestFitMode;
    // Nested type: ::GlobalNamespace::SuperTextMesh::$WaitFrameThenRebuild$d__196
    class $WaitFrameThenRebuild$d__196;
    // Nested type: ::GlobalNamespace::SuperTextMesh::$ReadOutText$d__230
    class $ReadOutText$d__230;
    // Nested type: ::GlobalNamespace::SuperTextMesh::$UnReadOutText$d__232
    class $UnReadOutText$d__232;
    // Nested type: ::GlobalNamespace::SuperTextMesh::$$c__DisplayClass235_0
    class $$c__DisplayClass235_0;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SuperTextMesh/PitchMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct PitchMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: PitchMode
      constexpr PitchMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SuperTextMesh/PitchMode Normal
      static constexpr const int Normal = 0;
      // Get static field: static public SuperTextMesh/PitchMode Normal
      static ::GlobalNamespace::SuperTextMesh::PitchMode _get_Normal();
      // Set static field: static public SuperTextMesh/PitchMode Normal
      static void _set_Normal(::GlobalNamespace::SuperTextMesh::PitchMode value);
      // static field const value: static public SuperTextMesh/PitchMode Single
      static constexpr const int Single = 1;
      // Get static field: static public SuperTextMesh/PitchMode Single
      static ::GlobalNamespace::SuperTextMesh::PitchMode _get_Single();
      // Set static field: static public SuperTextMesh/PitchMode Single
      static void _set_Single(::GlobalNamespace::SuperTextMesh::PitchMode value);
      // static field const value: static public SuperTextMesh/PitchMode Random
      static constexpr const int Random = 2;
      // Get static field: static public SuperTextMesh/PitchMode Random
      static ::GlobalNamespace::SuperTextMesh::PitchMode _get_Random();
      // Set static field: static public SuperTextMesh/PitchMode Random
      static void _set_Random(::GlobalNamespace::SuperTextMesh::PitchMode value);
      // static field const value: static public SuperTextMesh/PitchMode Perlin
      static constexpr const int Perlin = 3;
      // Get static field: static public SuperTextMesh/PitchMode Perlin
      static ::GlobalNamespace::SuperTextMesh::PitchMode _get_Perlin();
      // Set static field: static public SuperTextMesh/PitchMode Perlin
      static void _set_Perlin(::GlobalNamespace::SuperTextMesh::PitchMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SuperTextMesh/PitchMode
    #pragma pack(pop)
    static check_size<sizeof(SuperTextMesh::PitchMode), 0 + sizeof(int)> __GlobalNamespace_SuperTextMesh_PitchModeSizeCheck;
    static_assert(sizeof(SuperTextMesh::PitchMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SuperTextMesh/Alignment
    // [TokenAttribute] Offset: FFFFFFFF
    struct Alignment/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Alignment
      constexpr Alignment(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SuperTextMesh/Alignment Left
      static constexpr const int Left = 0;
      // Get static field: static public SuperTextMesh/Alignment Left
      static ::GlobalNamespace::SuperTextMesh::Alignment _get_Left();
      // Set static field: static public SuperTextMesh/Alignment Left
      static void _set_Left(::GlobalNamespace::SuperTextMesh::Alignment value);
      // static field const value: static public SuperTextMesh/Alignment Center
      static constexpr const int Center = 1;
      // Get static field: static public SuperTextMesh/Alignment Center
      static ::GlobalNamespace::SuperTextMesh::Alignment _get_Center();
      // Set static field: static public SuperTextMesh/Alignment Center
      static void _set_Center(::GlobalNamespace::SuperTextMesh::Alignment value);
      // static field const value: static public SuperTextMesh/Alignment Right
      static constexpr const int Right = 2;
      // Get static field: static public SuperTextMesh/Alignment Right
      static ::GlobalNamespace::SuperTextMesh::Alignment _get_Right();
      // Set static field: static public SuperTextMesh/Alignment Right
      static void _set_Right(::GlobalNamespace::SuperTextMesh::Alignment value);
      // static field const value: static public SuperTextMesh/Alignment Justified
      static constexpr const int Justified = 3;
      // Get static field: static public SuperTextMesh/Alignment Justified
      static ::GlobalNamespace::SuperTextMesh::Alignment _get_Justified();
      // Set static field: static public SuperTextMesh/Alignment Justified
      static void _set_Justified(::GlobalNamespace::SuperTextMesh::Alignment value);
      // static field const value: static public SuperTextMesh/Alignment ForceJustified
      static constexpr const int ForceJustified = 4;
      // Get static field: static public SuperTextMesh/Alignment ForceJustified
      static ::GlobalNamespace::SuperTextMesh::Alignment _get_ForceJustified();
      // Set static field: static public SuperTextMesh/Alignment ForceJustified
      static void _set_ForceJustified(::GlobalNamespace::SuperTextMesh::Alignment value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SuperTextMesh/Alignment
    #pragma pack(pop)
    static check_size<sizeof(SuperTextMesh::Alignment), 0 + sizeof(int)> __GlobalNamespace_SuperTextMesh_AlignmentSizeCheck;
    static_assert(sizeof(SuperTextMesh::Alignment) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SuperTextMesh/VerticalLimitMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct VerticalLimitMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: VerticalLimitMode
      constexpr VerticalLimitMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SuperTextMesh/VerticalLimitMode ShowLast
      static constexpr const int ShowLast = 0;
      // Get static field: static public SuperTextMesh/VerticalLimitMode ShowLast
      static ::GlobalNamespace::SuperTextMesh::VerticalLimitMode _get_ShowLast();
      // Set static field: static public SuperTextMesh/VerticalLimitMode ShowLast
      static void _set_ShowLast(::GlobalNamespace::SuperTextMesh::VerticalLimitMode value);
      // static field const value: static public SuperTextMesh/VerticalLimitMode CutOff
      static constexpr const int CutOff = 1;
      // Get static field: static public SuperTextMesh/VerticalLimitMode CutOff
      static ::GlobalNamespace::SuperTextMesh::VerticalLimitMode _get_CutOff();
      // Set static field: static public SuperTextMesh/VerticalLimitMode CutOff
      static void _set_CutOff(::GlobalNamespace::SuperTextMesh::VerticalLimitMode value);
      // static field const value: static public SuperTextMesh/VerticalLimitMode Ignore
      static constexpr const int Ignore = 2;
      // Get static field: static public SuperTextMesh/VerticalLimitMode Ignore
      static ::GlobalNamespace::SuperTextMesh::VerticalLimitMode _get_Ignore();
      // Set static field: static public SuperTextMesh/VerticalLimitMode Ignore
      static void _set_Ignore(::GlobalNamespace::SuperTextMesh::VerticalLimitMode value);
      // static field const value: static public SuperTextMesh/VerticalLimitMode AutoPause
      static constexpr const int AutoPause = 3;
      // Get static field: static public SuperTextMesh/VerticalLimitMode AutoPause
      static ::GlobalNamespace::SuperTextMesh::VerticalLimitMode _get_AutoPause();
      // Set static field: static public SuperTextMesh/VerticalLimitMode AutoPause
      static void _set_AutoPause(::GlobalNamespace::SuperTextMesh::VerticalLimitMode value);
      // static field const value: static public SuperTextMesh/VerticalLimitMode AutoPauseFull
      static constexpr const int AutoPauseFull = 4;
      // Get static field: static public SuperTextMesh/VerticalLimitMode AutoPauseFull
      static ::GlobalNamespace::SuperTextMesh::VerticalLimitMode _get_AutoPauseFull();
      // Set static field: static public SuperTextMesh/VerticalLimitMode AutoPauseFull
      static void _set_AutoPauseFull(::GlobalNamespace::SuperTextMesh::VerticalLimitMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SuperTextMesh/VerticalLimitMode
    #pragma pack(pop)
    static check_size<sizeof(SuperTextMesh::VerticalLimitMode), 0 + sizeof(int)> __GlobalNamespace_SuperTextMesh_VerticalLimitModeSizeCheck;
    static_assert(sizeof(SuperTextMesh::VerticalLimitMode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SuperTextMesh/DrawOrder
    // [TokenAttribute] Offset: FFFFFFFF
    struct DrawOrder/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: DrawOrder
      constexpr DrawOrder(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SuperTextMesh/DrawOrder LeftToRight
      static constexpr const int LeftToRight = 0;
      // Get static field: static public SuperTextMesh/DrawOrder LeftToRight
      static ::GlobalNamespace::SuperTextMesh::DrawOrder _get_LeftToRight();
      // Set static field: static public SuperTextMesh/DrawOrder LeftToRight
      static void _set_LeftToRight(::GlobalNamespace::SuperTextMesh::DrawOrder value);
      // static field const value: static public SuperTextMesh/DrawOrder AllAtOnce
      static constexpr const int AllAtOnce = 1;
      // Get static field: static public SuperTextMesh/DrawOrder AllAtOnce
      static ::GlobalNamespace::SuperTextMesh::DrawOrder _get_AllAtOnce();
      // Set static field: static public SuperTextMesh/DrawOrder AllAtOnce
      static void _set_AllAtOnce(::GlobalNamespace::SuperTextMesh::DrawOrder value);
      // static field const value: static public SuperTextMesh/DrawOrder OneWordAtATime
      static constexpr const int OneWordAtATime = 2;
      // Get static field: static public SuperTextMesh/DrawOrder OneWordAtATime
      static ::GlobalNamespace::SuperTextMesh::DrawOrder _get_OneWordAtATime();
      // Set static field: static public SuperTextMesh/DrawOrder OneWordAtATime
      static void _set_OneWordAtATime(::GlobalNamespace::SuperTextMesh::DrawOrder value);
      // static field const value: static public SuperTextMesh/DrawOrder Random
      static constexpr const int Random = 3;
      // Get static field: static public SuperTextMesh/DrawOrder Random
      static ::GlobalNamespace::SuperTextMesh::DrawOrder _get_Random();
      // Set static field: static public SuperTextMesh/DrawOrder Random
      static void _set_Random(::GlobalNamespace::SuperTextMesh::DrawOrder value);
      // static field const value: static public SuperTextMesh/DrawOrder RightToLeft
      static constexpr const int RightToLeft = 4;
      // Get static field: static public SuperTextMesh/DrawOrder RightToLeft
      static ::GlobalNamespace::SuperTextMesh::DrawOrder _get_RightToLeft();
      // Set static field: static public SuperTextMesh/DrawOrder RightToLeft
      static void _set_RightToLeft(::GlobalNamespace::SuperTextMesh::DrawOrder value);
      // static field const value: static public SuperTextMesh/DrawOrder ReverseLTR
      static constexpr const int ReverseLTR = 5;
      // Get static field: static public SuperTextMesh/DrawOrder ReverseLTR
      static ::GlobalNamespace::SuperTextMesh::DrawOrder _get_ReverseLTR();
      // Set static field: static public SuperTextMesh/DrawOrder ReverseLTR
      static void _set_ReverseLTR(::GlobalNamespace::SuperTextMesh::DrawOrder value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SuperTextMesh/DrawOrder
    #pragma pack(pop)
    static check_size<sizeof(SuperTextMesh::DrawOrder), 0 + sizeof(int)> __GlobalNamespace_SuperTextMesh_DrawOrderSizeCheck;
    static_assert(sizeof(SuperTextMesh::DrawOrder) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: SuperTextMesh/BestFitMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct BestFitMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: BestFitMode
      constexpr BestFitMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public SuperTextMesh/BestFitMode Off
      static constexpr const int Off = 0;
      // Get static field: static public SuperTextMesh/BestFitMode Off
      static ::GlobalNamespace::SuperTextMesh::BestFitMode _get_Off();
      // Set static field: static public SuperTextMesh/BestFitMode Off
      static void _set_Off(::GlobalNamespace::SuperTextMesh::BestFitMode value);
      // static field const value: static public SuperTextMesh/BestFitMode Always
      static constexpr const int Always = 1;
      // Get static field: static public SuperTextMesh/BestFitMode Always
      static ::GlobalNamespace::SuperTextMesh::BestFitMode _get_Always();
      // Set static field: static public SuperTextMesh/BestFitMode Always
      static void _set_Always(::GlobalNamespace::SuperTextMesh::BestFitMode value);
      // static field const value: static public SuperTextMesh/BestFitMode OverLimit
      static constexpr const int OverLimit = 2;
      // Get static field: static public SuperTextMesh/BestFitMode OverLimit
      static ::GlobalNamespace::SuperTextMesh::BestFitMode _get_OverLimit();
      // Set static field: static public SuperTextMesh/BestFitMode OverLimit
      static void _set_OverLimit(::GlobalNamespace::SuperTextMesh::BestFitMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // SuperTextMesh/BestFitMode
    #pragma pack(pop)
    static check_size<sizeof(SuperTextMesh::BestFitMode), 0 + sizeof(int)> __GlobalNamespace_SuperTextMesh_BestFitModeSizeCheck;
    static_assert(sizeof(SuperTextMesh::BestFitMode) == 0x4);
    public:
    // public System.Boolean showAppearanceFoldout
    // Size: 0x1
    // Offset: 0x18
    bool showAppearanceFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showMaterialFoldout
    // Size: 0x1
    // Offset: 0x19
    bool showMaterialFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showPositionFoldout
    // Size: 0x1
    // Offset: 0x1A
    bool showPositionFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showTimingFoldout
    // Size: 0x1
    // Offset: 0x1B
    bool showTimingFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showFunctionalityFoldout
    // Size: 0x1
    // Offset: 0x1C
    bool showFunctionalityFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showAudioFoldout
    // Size: 0x1
    // Offset: 0x1D
    bool showAudioFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean showEventFoldout
    // Size: 0x1
    // Offset: 0x1E
    bool showEventFoldout;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: showEventFoldout and: t
    char __padding6[0x1] = {};
    // private UnityEngine.Transform _t
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Transform* t;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.MeshFilter _f
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::MeshFilter* f;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshFilter*) == 0x8);
    // private UnityEngine.MeshRenderer _r
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::MeshRenderer* r;
    // Field size check
    static_assert(sizeof(::UnityEngine::MeshRenderer*) == 0x8);
    // private UnityEngine.CanvasRenderer _c
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::CanvasRenderer* c;
    // Field size check
    static_assert(sizeof(::UnityEngine::CanvasRenderer*) == 0x8);
    // public System.Collections.Generic.List`1<STMTextInfo> info
    // Size: 0x8
    // Offset: 0x40
    ::System::Collections::Generic::List_1<::GlobalNamespace::STMTextInfo*>* info;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::STMTextInfo*>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> lineBreaks
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<int>* lineBreaks;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Collections.Generic.List`1<System.Single> lineHeights
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::List_1<float>* lineHeights;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<float>*) == 0x8);
    // [TextAreaAttribute] Offset: 0xAD9204
    // [FormerlySerializedAsAttribute] Offset: 0xAD9204
    // public System.String _text
    // Size: 0x8
    // Offset: 0x58
    ::StringW text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String drawText
    // Size: 0x8
    // Offset: 0x60
    ::StringW drawText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String hyphenedText
    // Size: 0x8
    // Offset: 0x68
    ::StringW hyphenedText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0xAD9278
    // public UnityEngine.Font font
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Font* font;
    // Field size check
    static_assert(sizeof(::UnityEngine::Font*) == 0x8);
    // [TooltipAttribute] Offset: 0xAD92B0
    // public UnityEngine.Color32 color
    // Size: 0x4
    // Offset: 0x78
    ::UnityEngine::Color32 color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // [TooltipAttribute] Offset: 0xAD92E8
    // public System.Boolean richText
    // Size: 0x1
    // Offset: 0x7C
    bool richText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: richText and: readDelay
    char __padding19[0x3] = {};
    // [TooltipAttribute] Offset: 0xAD9320
    // public System.Single readDelay
    // Size: 0x4
    // Offset: 0x80
    float readDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9358
    // public System.Single speedReadScale
    // Size: 0x4
    // Offset: 0x84
    float speedReadScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9390
    // public System.Boolean ignoreTimeScale
    // Size: 0x1
    // Offset: 0x88
    bool ignoreTimeScale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean disableAnimatedText
    // Size: 0x1
    // Offset: 0x89
    bool disableAnimatedText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: disableAnimatedText and: drawAnimName
    char __padding23[0x6] = {};
    // [TooltipAttribute] Offset: 0xAD93C8
    // public System.String drawAnimName
    // Size: 0x8
    // Offset: 0x90
    ::StringW drawAnimName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0xAD9400
    // public System.Single unreadDelay
    // Size: 0x4
    // Offset: 0x98
    float unreadDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9438
    // public SuperTextMesh/DrawOrder undrawOrder
    // Size: 0x4
    // Offset: 0x9C
    ::GlobalNamespace::SuperTextMesh::DrawOrder undrawOrder;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::DrawOrder) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9470
    // public System.String undrawAnimName
    // Size: 0x8
    // Offset: 0xA0
    ::StringW undrawAnimName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0xAD94A8
    // public UnityEngine.AudioSource audioSource
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::AudioSource* audioSource;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioSource*) == 0x8);
    // [TooltipAttribute] Offset: 0xAD94E0
    // public UnityEngine.AudioClip[] audioClips
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<::UnityEngine::AudioClip*> audioClips;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::AudioClip*>) == 0x8);
    // [TooltipAttribute] Offset: 0xAD9518
    // public System.Boolean stopPreviousSound
    // Size: 0x1
    // Offset: 0xB8
    bool stopPreviousSound;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: stopPreviousSound and: pitchMode
    char __padding30[0x3] = {};
    // [TooltipAttribute] Offset: 0xAD9550
    // public SuperTextMesh/PitchMode pitchMode
    // Size: 0x4
    // Offset: 0xBC
    ::GlobalNamespace::SuperTextMesh::PitchMode pitchMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::PitchMode) == 0x4);
    // [RangeAttribute] Offset: 0xAD9588
    // [TooltipAttribute] Offset: 0xAD9588
    // public System.Single overridePitch
    // Size: 0x4
    // Offset: 0xC0
    float overridePitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAD95DC
    // [TooltipAttribute] Offset: 0xAD95DC
    // public System.Single minPitch
    // Size: 0x4
    // Offset: 0xC4
    float minPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9630
    // [RangeAttribute] Offset: 0xAD9630
    // public System.Single maxPitch
    // Size: 0x4
    // Offset: 0xC8
    float maxPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAD9684
    // [TooltipAttribute] Offset: 0xAD9684
    // public System.Single speedReadPitch
    // Size: 0x4
    // Offset: 0xCC
    float speedReadPitch;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD96D8
    // public System.Single perlinPitchMulti
    // Size: 0x4
    // Offset: 0xD0
    float perlinPitchMulti;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean speedReading
    // Size: 0x1
    // Offset: 0xD4
    bool speedReading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean skippingToEnd
    // Size: 0x1
    // Offset: 0xD5
    bool skippingToEnd;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean reading
    // Size: 0x1
    // Offset: 0xD6
    bool reading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: reading and: readRoutine
    char __padding39[0x1] = {};
    // private UnityEngine.Coroutine readRoutine
    // Size: 0x8
    // Offset: 0xD8
    ::UnityEngine::Coroutine* readRoutine;
    // Field size check
    static_assert(sizeof(::UnityEngine::Coroutine*) == 0x8);
    // public System.Boolean unreading
    // Size: 0x1
    // Offset: 0xE0
    bool unreading;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: unreading and: size
    char __padding41[0x3] = {};
    // [TooltipAttribute] Offset: 0xAD9730
    // public System.Single size
    // Size: 0x4
    // Offset: 0xE4
    float size;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single bestFitMulti
    // Size: 0x4
    // Offset: 0xE8
    float bestFitMulti;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9778
    // [RangeAttribute] Offset: 0xAD9778
    // public System.Int32 quality
    // Size: 0x4
    // Offset: 0xEC
    int quality;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [TooltipAttribute] Offset: 0xAD97D0
    // public UnityEngine.FilterMode filterMode
    // Size: 0x4
    // Offset: 0xF0
    ::UnityEngine::FilterMode filterMode;
    // Field size check
    static_assert(sizeof(::UnityEngine::FilterMode) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9808
    // public UnityEngine.FontStyle style
    // Size: 0x4
    // Offset: 0xF4
    ::UnityEngine::FontStyle style;
    // Field size check
    static_assert(sizeof(::UnityEngine::FontStyle) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9840
    // public UnityEngine.Vector3 baseOffset
    // Size: 0xC
    // Offset: 0xF8
    ::UnityEngine::Vector3 baseOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xAD9878
    // public System.Single lineSpacing
    // Size: 0x4
    // Offset: 0x104
    float lineSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD98B0
    // public System.Single characterSpacing
    // Size: 0x4
    // Offset: 0x108
    float characterSpacing;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD98E8
    // public System.Single tabSize
    // Size: 0x4
    // Offset: 0x10C
    float tabSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9920
    // public System.Single autoWrap
    // Size: 0x4
    // Offset: 0x110
    float autoWrap;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9958
    // public System.Boolean uiWrap
    // Size: 0x1
    // Offset: 0x114
    bool uiWrap;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAD9990
    // public System.Boolean uiLimit
    // Size: 0x1
    // Offset: 0x115
    bool uiLimit;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAD99C8
    // public System.Boolean breakText
    // Size: 0x1
    // Offset: 0x116
    bool breakText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAD9A00
    // public System.Boolean insertHyphens
    // Size: 0x1
    // Offset: 0x117
    bool insertHyphens;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAD9A38
    // public UnityEngine.TextAnchor anchor
    // Size: 0x4
    // Offset: 0x118
    ::UnityEngine::TextAnchor anchor;
    // Field size check
    static_assert(sizeof(::UnityEngine::TextAnchor) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9A70
    // public SuperTextMesh/Alignment alignment
    // Size: 0x4
    // Offset: 0x11C
    ::GlobalNamespace::SuperTextMesh::Alignment alignment;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::Alignment) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9AA8
    // public System.Single verticalLimit
    // Size: 0x4
    // Offset: 0x120
    float verticalLimit;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9AE0
    // public SuperTextMesh/VerticalLimitMode verticalLimitMode
    // Size: 0x4
    // Offset: 0x124
    ::GlobalNamespace::SuperTextMesh::VerticalLimitMode verticalLimitMode;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::VerticalLimitMode) == 0x4);
    // public System.String leftoverText
    // Size: 0x8
    // Offset: 0x128
    ::StringW leftoverText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // [TooltipAttribute] Offset: 0xAD9B18
    // [FormerlySerializedAsAttribute] Offset: 0xAD9B18
    // public UnityEngine.Material textMaterial
    // Size: 0x8
    // Offset: 0x130
    ::UnityEngine::Material* textMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Mesh textMesh
    // Size: 0x8
    // Offset: 0x138
    ::UnityEngine::Mesh* textMesh;
    // Field size check
    static_assert(sizeof(::UnityEngine::Mesh*) == 0x8);
    // private System.Boolean areWeAnimating
    // Size: 0x1
    // Offset: 0x140
    bool areWeAnimating;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: areWeAnimating and: rawTopLeftBounds
    char __padding63[0x3] = {};
    // public UnityEngine.Vector3 rawTopLeftBounds
    // Size: 0xC
    // Offset: 0x144
    ::UnityEngine::Vector3 rawTopLeftBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rawBottomRightBounds
    // Size: 0xC
    // Offset: 0x150
    ::UnityEngine::Vector3 rawBottomRightBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 rawBottomRightTextBounds
    // Size: 0xC
    // Offset: 0x15C
    ::UnityEngine::Vector3 rawBottomRightTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 topLeftBounds
    // Size: 0xC
    // Offset: 0x168
    ::UnityEngine::Vector3 topLeftBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 topRightBounds
    // Size: 0xC
    // Offset: 0x174
    ::UnityEngine::Vector3 topRightBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bottomLeftBounds
    // Size: 0xC
    // Offset: 0x180
    ::UnityEngine::Vector3 bottomLeftBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bottomRightBounds
    // Size: 0xC
    // Offset: 0x18C
    ::UnityEngine::Vector3 bottomRightBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 centerBounds
    // Size: 0xC
    // Offset: 0x198
    ::UnityEngine::Vector3 centerBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 topLeftTextBounds
    // Size: 0xC
    // Offset: 0x1A4
    ::UnityEngine::Vector3 topLeftTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 topRightTextBounds
    // Size: 0xC
    // Offset: 0x1B0
    ::UnityEngine::Vector3 topRightTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bottomLeftTextBounds
    // Size: 0xC
    // Offset: 0x1BC
    ::UnityEngine::Vector3 bottomLeftTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 bottomRightTextBounds
    // Size: 0xC
    // Offset: 0x1C8
    ::UnityEngine::Vector3 bottomRightTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 centerTextBounds
    // Size: 0xC
    // Offset: 0x1D4
    ::UnityEngine::Vector3 centerTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 finalTopLeftTextBounds
    // Size: 0xC
    // Offset: 0x1E0
    ::UnityEngine::Vector3 finalTopLeftTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 finalTopRightTextBounds
    // Size: 0xC
    // Offset: 0x1EC
    ::UnityEngine::Vector3 finalTopRightTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 finalBottomLeftTextBounds
    // Size: 0xC
    // Offset: 0x1F8
    ::UnityEngine::Vector3 finalBottomLeftTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 finalBottomRightTextBounds
    // Size: 0xC
    // Offset: 0x204
    ::UnityEngine::Vector3 finalBottomRightTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 finalCenterTextBounds
    // Size: 0xC
    // Offset: 0x210
    ::UnityEngine::Vector3 finalCenterTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single lowestPosition
    // Size: 0x4
    // Offset: 0x21C
    float lowestPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lowestDrawnPosition
    // Size: 0x4
    // Offset: 0x220
    float lowestDrawnPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single lowestDrawnPositionRaw
    // Size: 0x4
    // Offset: 0x224
    float lowestDrawnPositionRaw;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single furthestDrawnPosition
    // Size: 0x4
    // Offset: 0x228
    float furthestDrawnPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single totalWidth
    // Size: 0x4
    // Offset: 0x22C
    float totalWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 unwrappedBottomRightTextBounds
    // Size: 0xC
    // Offset: 0x230
    ::UnityEngine::Vector3 unwrappedBottomRightTextBounds;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: unwrappedBottomRightTextBounds and: onCompleteEvent
    char __padding87[0x4] = {};
    // public UnityEngine.Events.UnityEvent onCompleteEvent
    // Size: 0x8
    // Offset: 0x240
    ::UnityEngine::Events::UnityEvent* onCompleteEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9C98
    // private SuperTextMesh/OnCompleteAction OnCompleteEvent
    // Size: 0x8
    // Offset: 0x248
    ::GlobalNamespace::SuperTextMesh::OnCompleteAction* OnCompleteEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnCompleteAction*) == 0x8);
    // public UnityEngine.Events.UnityEvent onUndrawnEvent
    // Size: 0x8
    // Offset: 0x250
    ::UnityEngine::Events::UnityEvent* onUndrawnEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9CA8
    // private SuperTextMesh/OnUndrawnAction OnUndrawnEvent
    // Size: 0x8
    // Offset: 0x258
    ::GlobalNamespace::SuperTextMesh::OnUndrawnAction* OnUndrawnEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnUndrawnAction*) == 0x8);
    // public UnityEngine.Events.UnityEvent onRebuildEvent
    // Size: 0x8
    // Offset: 0x260
    ::UnityEngine::Events::UnityEvent* onRebuildEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9CB8
    // private SuperTextMesh/OnRebuildAction OnRebuildEvent
    // Size: 0x8
    // Offset: 0x268
    ::GlobalNamespace::SuperTextMesh::OnRebuildAction* OnRebuildEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnRebuildAction*) == 0x8);
    // public UnityEngine.Events.UnityEvent onPrintEvent
    // Size: 0x8
    // Offset: 0x270
    ::UnityEngine::Events::UnityEvent* onPrintEvent;
    // Field size check
    static_assert(sizeof(::UnityEngine::Events::UnityEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9CC8
    // private SuperTextMesh/OnPrintAction OnPrintEvent
    // Size: 0x8
    // Offset: 0x278
    ::GlobalNamespace::SuperTextMesh::OnPrintAction* OnPrintEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnPrintAction*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xAD9CD8
    // public SuperTextMesh/CustomEvent onCustomEvent
    // Size: 0x8
    // Offset: 0x280
    ::GlobalNamespace::SuperTextMesh::CustomEvent* onCustomEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::CustomEvent*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9D10
    // private SuperTextMesh/OnCustomAction OnCustomEvent
    // Size: 0x8
    // Offset: 0x288
    ::GlobalNamespace::SuperTextMesh::OnCustomAction* OnCustomEvent;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnCustomAction*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xAD9D20
    // public SuperTextMesh/VertexMod onVertexMod
    // Size: 0x8
    // Offset: 0x290
    ::GlobalNamespace::SuperTextMesh::VertexMod* onVertexMod;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::VertexMod*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9D58
    // private SuperTextMesh/OnVertexModAction OnVertexMod
    // Size: 0x8
    // Offset: 0x298
    ::GlobalNamespace::SuperTextMesh::OnVertexModAction* OnVertexMod;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnVertexModAction*) == 0x8);
    // [FormerlySerializedAsAttribute] Offset: 0xAD9D68
    // public SuperTextMesh/PreParse onPreParse
    // Size: 0x8
    // Offset: 0x2A0
    ::GlobalNamespace::SuperTextMesh::PreParse* onPreParse;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::PreParse*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xAD9DA0
    // private SuperTextMesh/OnPreParseAction OnPreParse
    // Size: 0x8
    // Offset: 0x2A8
    ::GlobalNamespace::SuperTextMesh::OnPreParseAction* OnPreParse;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::OnPreParseAction*) == 0x8);
    // public System.Boolean debugMode
    // Size: 0x1
    // Offset: 0x2B0
    bool debugMode;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: debugMode and: totalReadTime
    char __padding102[0x3] = {};
    // public System.Single totalReadTime
    // Size: 0x4
    // Offset: 0x2B4
    float totalReadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single totalUnreadTime
    // Size: 0x4
    // Offset: 0x2B8
    float totalUnreadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single currentReadTime
    // Size: 0x4
    // Offset: 0x2BC
    float currentReadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3[] endVerts
    // Size: 0x8
    // Offset: 0x2C0
    ::ArrayW<::UnityEngine::Vector3> endVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Color32[] endCol32
    // Size: 0x8
    // Offset: 0x2C8
    ::ArrayW<::UnityEngine::Color32> endCol32;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color32>) == 0x8);
    // private UnityEngine.Vector2[] endUv
    // Size: 0x8
    // Offset: 0x2D0
    ::ArrayW<::UnityEngine::Vector2> endUv;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Vector2[] endUv2
    // Size: 0x8
    // Offset: 0x2D8
    ::ArrayW<::UnityEngine::Vector2> endUv2;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector4> ratiosAndUvMids
    // Size: 0x8
    // Offset: 0x2E0
    ::System::Collections::Generic::List_1<::UnityEngine::Vector4>* ratiosAndUvMids;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector4>*) == 0x8);
    // private UnityEngine.Vector3[] startVerts
    // Size: 0x8
    // Offset: 0x2E8
    ::ArrayW<::UnityEngine::Vector3> startVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Color32[] startCol32
    // Size: 0x8
    // Offset: 0x2F0
    ::ArrayW<::UnityEngine::Color32> startCol32;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color32>) == 0x8);
    // private UnityEngine.Vector3[] midVerts
    // Size: 0x8
    // Offset: 0x2F8
    ::ArrayW<::UnityEngine::Vector3> midVerts;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Color32[] midCol32
    // Size: 0x8
    // Offset: 0x300
    ::ArrayW<::UnityEngine::Color32> midCol32;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color32>) == 0x8);
    // private System.Collections.Generic.List`1<SubMeshData> subMeshes
    // Size: 0x8
    // Offset: 0x308
    ::System::Collections::Generic::List_1<::GlobalNamespace::SubMeshData*>* subMeshes;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::GlobalNamespace::SubMeshData*>*) == 0x8);
    // private System.Single timeDrawn
    // Size: 0x4
    // Offset: 0x310
    float timeDrawn;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAD9DE0
    // public System.Boolean autoRead
    // Size: 0x1
    // Offset: 0x314
    bool autoRead;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAD9E18
    // public System.Boolean rememberReadPosition
    // Size: 0x1
    // Offset: 0x315
    bool rememberReadPosition;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [TooltipAttribute] Offset: 0xAD9E50
    // public System.Boolean autoQuality
    // Size: 0x1
    // Offset: 0x316
    bool autoQuality;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: autoQuality and: drawOrder
    char __padding119[0x1] = {};
    // [TooltipAttribute] Offset: 0xAD9E88
    // public SuperTextMesh/DrawOrder drawOrder
    // Size: 0x4
    // Offset: 0x318
    ::GlobalNamespace::SuperTextMesh::DrawOrder drawOrder;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::DrawOrder) == 0x4);
    // private System.Boolean callReadFunction
    // Size: 0x1
    // Offset: 0x31C
    bool callReadFunction;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: callReadFunction and: pauseCount
    char __padding121[0x3] = {};
    // private System.Int32 pauseCount
    // Size: 0x4
    // Offset: 0x320
    int pauseCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 currentPauseCount
    // Size: 0x4
    // Offset: 0x324
    int currentPauseCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single autoPauseStopPoint
    // Size: 0x4
    // Offset: 0x328
    float autoPauseStopPoint;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: autoPauseStopPoint and: allTags
    char __padding124[0x4] = {};
    // private System.Collections.Generic.List`1<System.Collections.Generic.KeyValuePair`2<System.Int32,System.String>> allTags
    // Size: 0x8
    // Offset: 0x330
    ::System::Collections::Generic::List_1<::System::Collections::Generic::KeyValuePair_2<int, ::StringW>>* allTags;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::KeyValuePair_2<int, ::StringW>>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Font> allFonts
    // Size: 0x8
    // Offset: 0x338
    ::System::Collections::Generic::List_1<::UnityEngine::Font*>* allFonts;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Font*>*) == 0x8);
    // public SuperTextMesh/BestFitMode bestFit
    // Size: 0x4
    // Offset: 0x340
    ::GlobalNamespace::SuperTextMesh::BestFitMode bestFit;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::SuperTextMesh::BestFitMode) == 0x4);
    // private System.Boolean applicationFocused
    // Size: 0x1
    // Offset: 0x344
    bool applicationFocused;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: applicationFocused and: latestNumber
    char __padding128[0x3] = {};
    // public System.Int32 latestNumber
    // Size: 0x4
    // Offset: 0x348
    int latestNumber;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single currentUnReadTime
    // Size: 0x4
    // Offset: 0x34C
    float currentUnReadTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.String preParsedText
    // Size: 0x8
    // Offset: 0x350
    ::StringW preParsedText;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Vector3 offset
    // Size: 0xC
    // Offset: 0x358
    ::UnityEngine::Vector3 offset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 uiOffset
    // Size: 0xC
    // Offset: 0x364
    ::UnityEngine::Vector3 uiOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 anchorOffset
    // Size: 0xC
    // Offset: 0x370
    ::UnityEngine::Vector3 anchorOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 TextBounds_leftOffset
    // Size: 0xC
    // Offset: 0x37C
    ::UnityEngine::Vector3 TextBounds_leftOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 TextBounds_rightOffset
    // Size: 0xC
    // Offset: 0x388
    ::UnityEngine::Vector3 TextBounds_rightOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Single TextBounds_diff
    // Size: 0x4
    // Offset: 0x394
    float TextBounds_diff;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32[] drawOrderRTL
    // Size: 0x8
    // Offset: 0x398
    ::ArrayW<int> drawOrderRTL;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private UnityEngine.Vector3 WavePosition_Vect
    // Size: 0xC
    // Offset: 0x3A0
    ::UnityEngine::Vector3 WavePosition_Vect;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 WaveRotation_Pivot
    // Size: 0xC
    // Offset: 0x3AC
    ::UnityEngine::Vector3 WaveRotation_Pivot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 WaveRotation_Offset
    // Size: 0xC
    // Offset: 0x3B8
    ::UnityEngine::Vector3 WaveRotation_Offset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 WaveRotation_ReturnVal
    // Size: 0xC
    // Offset: 0x3C4
    ::UnityEngine::Vector3 WaveRotation_ReturnVal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 WaveRotation_myRotation
    // Size: 0xC
    // Offset: 0x3D0
    ::UnityEngine::Vector3 WaveRotation_myRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion WaveRotation_myQuaternion
    // Size: 0x10
    // Offset: 0x3DC
    ::UnityEngine::Quaternion WaveRotation_myQuaternion;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 JitterValue_MyJit
    // Size: 0xC
    // Offset: 0x3EC
    ::UnityEngine::Vector3 JitterValue_MyJit;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_waveValue
    // Size: 0xC
    // Offset: 0x3F8
    ::UnityEngine::Vector3 UpdateMesh_waveValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_waveValueTopLeft
    // Size: 0xC
    // Offset: 0x404
    ::UnityEngine::Vector3 UpdateMesh_waveValueTopLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_waveValueTopRight
    // Size: 0xC
    // Offset: 0x410
    ::UnityEngine::Vector3 UpdateMesh_waveValueTopRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_waveValueBottomRight
    // Size: 0xC
    // Offset: 0x41C
    ::UnityEngine::Vector3 UpdateMesh_waveValueBottomRight;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_waveValueBottomLeft
    // Size: 0xC
    // Offset: 0x428
    ::UnityEngine::Vector3 UpdateMesh_waveValueBottomLeft;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_lowestLineOffset
    // Size: 0xC
    // Offset: 0x434
    ::UnityEngine::Vector3 UpdateMesh_lowestLineOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 UpdateMesh_wavePosition
    // Size: 0xC
    // Offset: 0x440
    ::UnityEngine::Vector3 UpdateMesh_wavePosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector2 UpdateMesh_uvOffset
    // Size: 0x8
    // Offset: 0x44C
    ::UnityEngine::Vector2 UpdateMesh_uvOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector2) == 0x8);
    // Padding between fields: UpdateMesh_uvOffset and: CurrentTextInfo
    char __padding153[0x4] = {};
    // private STMTextInfo CurrentTextInfo
    // Size: 0x8
    // Offset: 0x458
    ::GlobalNamespace::STMTextInfo* CurrentTextInfo;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::STMTextInfo*) == 0x8);
    // private UnityEngine.Vector3[] UpdateMesh_Middles
    // Size: 0x8
    // Offset: 0x460
    ::ArrayW<::UnityEngine::Vector3> UpdateMesh_Middles;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3[] UpdateMesh_Positions
    // Size: 0x8
    // Offset: 0x468
    ::ArrayW<::UnityEngine::Vector3> UpdateMesh_Positions;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector3 cacheVectThree
    // Size: 0xC
    // Offset: 0x470
    ::UnityEngine::Vector3 cacheVectThree;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 jitterValue
    // Size: 0xC
    // Offset: 0x47C
    ::UnityEngine::Vector3 jitterValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector2 vectA
    // Size: 0x8
    // Offset: 0x488
