// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Collider
  class Collider;
  // Forward declaring type: Mesh
  class Mesh;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: TerrainCell
  class TerrainCell;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: TerrainGrid
  class TerrainGrid;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::TerrainGrid);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::TerrainGrid*, "", "TerrainGrid");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xBC
  #pragma pack(push, 1)
  // Autogenerated type: TerrainGrid
  // [TokenAttribute] Offset: FFFFFFFF
  class TerrainGrid : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [CompilerGeneratedAttribute] Offset: 0xADA348
    // private System.Single <cellSize>k__BackingField
    // Size: 0x4
    // Offset: 0x18
    float cellSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xADA358
    // private System.Int32 <gridWidth>k__BackingField
    // Size: 0x4
    // Offset: 0x1C
    int gridWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xADA368
    // private System.Int32 <gridHeight>k__BackingField
    // Size: 0x4
    // Offset: 0x20
    int gridHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Single yOffset
    // Size: 0x4
    // Offset: 0x24
    float yOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single cellHeightClearance
    // Size: 0x4
    // Offset: 0x28
    float cellHeightClearance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: cellHeightClearance and: cellMaterialValid
    char __padding4[0x4] = {};
    // public UnityEngine.Material cellMaterialValid
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::Material* cellMaterialValid;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material cellMaterialInvalid
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Material* cellMaterialInvalid;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // public UnityEngine.Material outlineMaterial
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Material* outlineMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA378
    // private TerrainCell[] <_cells>k__BackingField
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::GlobalNamespace::TerrainCell*> cells;
    // Field size check
    static_assert(sizeof(::ArrayW<::GlobalNamespace::TerrainCell*>) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xADA388
    // private System.Single[] <_heights>k__BackingField
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<float> heights;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Boolean firstFrame
    // Size: 0x1
    // Offset: 0x58
    bool firstFrame;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: firstFrame and: gridDisplay
    char __padding10[0x7] = {};
    // private UnityEngine.GameObject gridDisplay
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::GameObject* gridDisplay;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.GameObject[] navigationJumps
    // Size: 0x8
    // Offset: 0x68
    ::ArrayW<::UnityEngine::GameObject*> navigationJumps;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // private UnityEngine.GameObject[] taxiExitJumps
    // Size: 0x8
    // Offset: 0x70
    ::ArrayW<::UnityEngine::GameObject*> taxiExitJumps;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GameObject*>) == 0x8);
    // public UnityEngine.Collider[] latestCols
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Collider*> latestCols;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // public UnityEngine.Collider[] ignoreEnemyCols
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<::UnityEngine::Collider*> ignoreEnemyCols;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Collider*>) == 0x8);
    // private System.Int32 numIgnoreEnemyCols
    // Size: 0x4
    // Offset: 0x88
    int numIgnoreEnemyCols;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector3 spaceCheckYOffset
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 spaceCheckYOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xADA3B8
    // private UnityEngine.Vector3 <currentNavmeshPosition>k__BackingField
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 currentNavmeshPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // Padding between fields: currentNavmeshPosition and: vertices
    char __padding18[0x4] = {};
    // private UnityEngine.Vector3[] vertices
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::UnityEngine::Vector3> vertices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Int32[] indices
    // Size: 0x8
    // Offset: 0xB0
    ::ArrayW<int> indices;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // public System.Int32 _NavAreaMask
    // Size: 0x4
    // Offset: 0xB8
    int NavAreaMask;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private System.Single <cellSize>k__BackingField
    [[deprecated("Use field access instead!")]] float& dyn_$cellSize$k__BackingField();
    // Get instance field reference: private System.Int32 <gridWidth>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$gridWidth$k__BackingField();
    // Get instance field reference: private System.Int32 <gridHeight>k__BackingField
    [[deprecated("Use field access instead!")]] int& dyn_$gridHeight$k__BackingField();
    // Get instance field reference: public System.Single yOffset
    [[deprecated("Use field access instead!")]] float& dyn_yOffset();
    // Get instance field reference: private System.Single cellHeightClearance
