// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
}
// Forward declaring namespace: VivoxUnity
namespace VivoxUnity {
  // Forward declaring type: Client
  class Client;
  // Forward declaring type: ILoginSession
  class ILoginSession;
  // Forward declaring type: IChannelSession
  class IChannelSession;
  // Forward declaring type: KeyEventArg`1<TK>
  template<typename TK>
  class KeyEventArg_1;
}
// Forward declaring namespace: System::ComponentModel
namespace System::ComponentModel {
  // Forward declaring type: PropertyChangedEventArgs
  class PropertyChangedEventArgs;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Completed forward declares
// Type namespace: 
namespace GlobalNamespace {
  // Forward declaring type: VivoxVoipClient
  class VivoxVoipClient;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::GlobalNamespace::VivoxVoipClient);
DEFINE_IL2CPP_ARG_TYPE(::GlobalNamespace::VivoxVoipClient*, "", "VivoxVoipClient");
// Type namespace: 
namespace GlobalNamespace {
  // Size: 0xA8
  #pragma pack(push, 1)
  // Autogenerated type: VivoxVoipClient
  // [TokenAttribute] Offset: FFFFFFFF
  class VivoxVoipClient : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$$c
    class $$c;
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$$c__DisplayClass28_0
    class $$c__DisplayClass28_0;
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$ChangeZoneChannelAsync$d__28
    class $ChangeZoneChannelAsync$d__28;
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$$c__DisplayClass30_0
    class $$c__DisplayClass30_0;
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$ChangePartyChannelAsync$d__30
    class $ChangePartyChannelAsync$d__30;
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$$c__DisplayClass32_0
    class $$c__DisplayClass32_0;
    // Nested type: ::GlobalNamespace::VivoxVoipClient::$ChangeFellowshipChannelAsync$d__32
    class $ChangeFellowshipChannelAsync$d__32;
    public:
    // private VivoxUnity.Client _client
    // Size: 0x8
    // Offset: 0x18
    ::VivoxUnity::Client* client;
    // Field size check
    static_assert(sizeof(::VivoxUnity::Client*) == 0x8);
    // private System.String _tokenIssuer
    // Size: 0x8
    // Offset: 0x20
    ::StringW tokenIssuer;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _tokenDomain
    // Size: 0x8
    // Offset: 0x28
    ::StringW tokenDomain;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _tokenKey
    // Size: 0x8
    // Offset: 0x30
    ::StringW tokenKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _apiEndPoint
    // Size: 0x8
    // Offset: 0x38
    ::StringW apiEndPoint;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.TimeSpan _tokenExpiration
    // Size: 0x8
    // Offset: 0x40
    ::System::TimeSpan tokenExpiration;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // private VivoxUnity.ILoginSession _loginSession
    // Size: 0x8
    // Offset: 0x48
    ::VivoxUnity::ILoginSession* loginSession;
    // Field size check
    static_assert(sizeof(::VivoxUnity::ILoginSession*) == 0x8);
    // private System.Single timeSincePositionUpdate
    // Size: 0x4
    // Offset: 0x50
    float timeSincePositionUpdate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean isConnected
    // Size: 0x1
    // Offset: 0x54
    bool isConnected;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isLoggingIn
    // Size: 0x1
    // Offset: 0x55
    bool isLoggingIn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean isLoggedIn
    // Size: 0x1
    // Offset: 0x56
    bool isLoggedIn;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: isLoggedIn and: zoneChannelSession
    char __padding10[0x1] = {};
    // private VivoxUnity.IChannelSession zoneChannelSession
    // Size: 0x8
    // Offset: 0x58
    ::VivoxUnity::IChannelSession* zoneChannelSession;
    // Field size check
    static_assert(sizeof(::VivoxUnity::IChannelSession*) == 0x8);
    // private VivoxUnity.IChannelSession partyChannelSession
    // Size: 0x8
    // Offset: 0x60
    ::VivoxUnity::IChannelSession* partyChannelSession;
    // Field size check
    static_assert(sizeof(::VivoxUnity::IChannelSession*) == 0x8);
    // private VivoxUnity.IChannelSession fellowshipChannelSession
    // Size: 0x8
    // Offset: 0x68
    ::VivoxUnity::IChannelSession* fellowshipChannelSession;
    // Field size check
    static_assert(sizeof(::VivoxUnity::IChannelSession*) == 0x8);
    // private VivoxUnity.IChannelSession currentChannelSession
    // Size: 0x8
    // Offset: 0x70
    ::VivoxUnity::IChannelSession* currentChannelSession;
    // Field size check
    static_assert(sizeof(::VivoxUnity::IChannelSession*) == 0x8);
    // private System.String zoneChannel
    // Size: 0x8
    // Offset: 0x78
    ::StringW zoneChannel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String partyChannel
    // Size: 0x8
    // Offset: 0x80
    ::StringW partyChannel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String fellowshipChannel
    // Size: 0x8
    // Offset: 0x88
    ::StringW fellowshipChannel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String wantZoneChannel
    // Size: 0x8
    // Offset: 0x90
    ::StringW wantZoneChannel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String wantPartyChannel
    // Size: 0x8
    // Offset: 0x98
    ::StringW wantPartyChannel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String wantFellowshipChannel
    // Size: 0x8
    // Offset: 0xA0
    ::StringW wantFellowshipChannel;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static public VivoxVoipClient Instance
    static ::GlobalNamespace::VivoxVoipClient* _get_Instance();
    // Set static field: static public VivoxVoipClient Instance
    static void _set_Instance(::GlobalNamespace::VivoxVoipClient* value);
    // Get instance field reference: private VivoxUnity.Client _client
    [[deprecated("Use field access instead!")]] ::VivoxUnity::Client*& dyn__client();
    // Get instance field reference: private System.String _tokenIssuer
    [[deprecated("Use field access instead!")]] ::StringW& dyn__tokenIssuer();
    // Get instance field reference: private System.String _tokenDomain
    [[deprecated("Use field access instead!")]] ::StringW& dyn__tokenDomain();
