// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: UnityEngine.Color32
#include "UnityEngine/Color32.hpp"
// Including type: Vectrosity.CanvasState
#include "Vectrosity/CanvasState.hpp"
// Including type: Vectrosity.LineType
#include "Vectrosity/LineType.hpp"
// Including type: Vectrosity.Joins
#include "Vectrosity/Joins.hpp"
// Including type: Vectrosity.EndCap
#include "Vectrosity/EndCap.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: RectTransform
  class RectTransform;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: PhysicsMaterial2D
  class PhysicsMaterial2D;
  // Forward declaring type: Canvas
  class Canvas;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Ray
  struct Ray;
  // Forward declaring type: Plane
  struct Plane;
  // Forward declaring type: PolygonCollider2D
  class PolygonCollider2D;
}
// Forward declaring namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: IVectorObject
  class IVectorObject;
  // Forward declaring type: LineManager
  class LineManager;
  // Forward declaring type: CapInfo
  class CapInfo;
}
// Completed forward declares
// Type namespace: Vectrosity
namespace Vectrosity {
  // Forward declaring type: VectorLine
  class VectorLine;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Vectrosity::VectorLine);
DEFINE_IL2CPP_ARG_TYPE(::Vectrosity::VectorLine*, "Vectrosity", "VectorLine");
// Type namespace: Vectrosity
namespace Vectrosity {
  // Size: 0x189
  #pragma pack(push, 1)
  // Autogenerated type: Vectrosity.VectorLine
  // [TokenAttribute] Offset: FFFFFFFF
  class VectorLine : public ::Il2CppObject {
    public:
    public:
    // private UnityEngine.Vector3[] m_lineVertices
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::UnityEngine::Vector3> m_lineVertices;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private UnityEngine.Vector2[] m_lineUVs
    // Size: 0x8
    // Offset: 0x18
    ::ArrayW<::UnityEngine::Vector2> m_lineUVs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private UnityEngine.Color32[] m_lineColors
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<::UnityEngine::Color32> m_lineColors;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color32>) == 0x8);
    // private System.Collections.Generic.List`1<System.Int32> m_lineTriangles
    // Size: 0x8
    // Offset: 0x28
    ::System::Collections::Generic::List_1<int>* m_lineTriangles;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<int>*) == 0x8);
    // private System.Int32 m_vertexCount
    // Size: 0x4
    // Offset: 0x30
    int m_vertexCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_vertexCount and: m_go
    char __padding4[0x4] = {};
    // private UnityEngine.GameObject m_go
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::GameObject* m_go;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // private UnityEngine.RectTransform m_rectTransform
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::RectTransform* m_rectTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::RectTransform*) == 0x8);
    // private Vectrosity.IVectorObject m_vectorObject
    // Size: 0x8
    // Offset: 0x48
    ::Vectrosity::IVectorObject* m_vectorObject;
    // Field size check
    static_assert(sizeof(::Vectrosity::IVectorObject*) == 0x8);
    // private UnityEngine.Color32 m_color
    // Size: 0x4
    // Offset: 0x50
    ::UnityEngine::Color32 m_color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private Vectrosity.CanvasState m_canvasState
    // Size: 0x4
    // Offset: 0x54
    ::Vectrosity::CanvasState m_canvasState;
    // Field size check
    static_assert(sizeof(::Vectrosity::CanvasState) == 0x4);
    // private System.Boolean m_is2D
    // Size: 0x1
    // Offset: 0x58
    bool m_is2D;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_is2D and: m_points2
    char __padding10[0x7] = {};
    // private System.Collections.Generic.List`1<UnityEngine.Vector2> m_points2
    // Size: 0x8
    // Offset: 0x60
    ::System::Collections::Generic::List_1<::UnityEngine::Vector2>* m_points2;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector2>*) == 0x8);
    // private System.Collections.Generic.List`1<UnityEngine.Vector3> m_points3
    // Size: 0x8
    // Offset: 0x68
    ::System::Collections::Generic::List_1<::UnityEngine::Vector3>* m_points3;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Vector3>*) == 0x8);
    // private System.Int32 m_pointsCount
    // Size: 0x4
    // Offset: 0x70
    int m_pointsCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_pointsCount and: m_screenPoints
    char __padding13[0x4] = {};
    // private UnityEngine.Vector3[] m_screenPoints
    // Size: 0x8
    // Offset: 0x78
    ::ArrayW<::UnityEngine::Vector3> m_screenPoints;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector3>) == 0x8);
    // private System.Single[] m_lineWidths
    // Size: 0x8
    // Offset: 0x80
    ::ArrayW<float> m_lineWidths;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single m_lineWidth
    // Size: 0x4
    // Offset: 0x88
    float m_lineWidth;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_maxWeldDistance
    // Size: 0x4
    // Offset: 0x8C
    float m_maxWeldDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single[] m_distances
    // Size: 0x8
    // Offset: 0x90
    ::ArrayW<float> m_distances;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.String m_name
    // Size: 0x8
    // Offset: 0x98
    ::StringW m_name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private UnityEngine.Material m_material
    // Size: 0x8
    // Offset: 0xA0
    ::UnityEngine::Material* m_material;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Texture m_originalTexture
    // Size: 0x8
    // Offset: 0xA8
    ::UnityEngine::Texture* m_originalTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private UnityEngine.Texture m_texture
    // Size: 0x8
    // Offset: 0xB0
    ::UnityEngine::Texture* m_texture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Boolean m_active
    // Size: 0x1
    // Offset: 0xB8
    bool m_active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_active and: m_lineType
    char __padding23[0x3] = {};
    // private Vectrosity.LineType m_lineType
    // Size: 0x4
    // Offset: 0xBC
    ::Vectrosity::LineType m_lineType;
    // Field size check
    static_assert(sizeof(::Vectrosity::LineType) == 0x4);
    // private System.Single m_capLength
    // Size: 0x4
    // Offset: 0xC0
    float m_capLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_smoothWidth
    // Size: 0x1
    // Offset: 0xC4
    bool m_smoothWidth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_smoothColor
    // Size: 0x1
    // Offset: 0xC5
    bool m_smoothColor;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_smoothColor and: m_joins
    char __padding27[0x2] = {};
    // private Vectrosity.Joins m_joins
    // Size: 0x4
    // Offset: 0xC8
    ::Vectrosity::Joins m_joins;
    // Field size check
    static_assert(sizeof(::Vectrosity::Joins) == 0x4);
    // private System.Boolean m_isAutoDrawing
    // Size: 0x1
    // Offset: 0xCC
    bool m_isAutoDrawing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isAutoDrawing and: m_drawStart
    char __padding29[0x3] = {};
    // private System.Int32 m_drawStart
    // Size: 0x4
    // Offset: 0xD0
    int m_drawStart;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_drawEnd
    // Size: 0x4
    // Offset: 0xD4
    int m_drawEnd;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_endPointsUpdate
    // Size: 0x4
    // Offset: 0xD8
    int m_endPointsUpdate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_useNormals
    // Size: 0x1
    // Offset: 0xDC
    bool m_useNormals;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_useTangents
    // Size: 0x1
    // Offset: 0xDD
    bool m_useTangents;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_normalsCalculated
    // Size: 0x1
    // Offset: 0xDE
    bool m_normalsCalculated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_tangentsCalculated
    // Size: 0x1
    // Offset: 0xDF
    bool m_tangentsCalculated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Vectrosity.EndCap m_capType
    // Size: 0x4
    // Offset: 0xE0
    ::Vectrosity::EndCap m_capType;
    // Field size check
    static_assert(sizeof(::Vectrosity::EndCap) == 0x4);
    // Padding between fields: m_capType and: m_endCap
    char __padding37[0x4] = {};
    // private System.String m_endCap
    // Size: 0x8
    // Offset: 0xE8
    ::StringW m_endCap;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean m_useCapColors
    // Size: 0x1
    // Offset: 0xF0
    bool m_useCapColors;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_useCapColors and: m_frontColor
    char __padding39[0x3] = {};
    // private UnityEngine.Color32 m_frontColor
    // Size: 0x4
    // Offset: 0xF4
    ::UnityEngine::Color32 m_frontColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private UnityEngine.Color32 m_backColor
    // Size: 0x4
    // Offset: 0xF8
    ::UnityEngine::Color32 m_backColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color32) == 0x4);
    // private System.Int32 m_frontEndCapIndex
    // Size: 0x4
    // Offset: 0xFC
    int m_frontEndCapIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_backEndCapIndex
    // Size: 0x4
    // Offset: 0x100
    int m_backEndCapIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_lineUVBottom
    // Size: 0x4
    // Offset: 0x104
    float m_lineUVBottom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_lineUVTop
    // Size: 0x4
    // Offset: 0x108
    float m_lineUVTop;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_frontCapUVBottom
    // Size: 0x4
    // Offset: 0x10C
    float m_frontCapUVBottom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_frontCapUVTop
    // Size: 0x4
    // Offset: 0x110
    float m_frontCapUVTop;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_backCapUVBottom
    // Size: 0x4
    // Offset: 0x114
    float m_backCapUVBottom;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_backCapUVTop
    // Size: 0x4
    // Offset: 0x118
    float m_backCapUVTop;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_continuousTexture
    // Size: 0x1
    // Offset: 0x11C
    bool m_continuousTexture;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_continuousTexture and: m_drawTransform
    char __padding50[0x3] = {};
    // private UnityEngine.Transform m_drawTransform
    // Size: 0x8
    // Offset: 0x120
    ::UnityEngine::Transform* m_drawTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Boolean m_viewportDraw
    // Size: 0x1
    // Offset: 0x128
    bool m_viewportDraw;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_viewportDraw and: m_textureScale
    char __padding52[0x3] = {};
    // private System.Single m_textureScale
    // Size: 0x4
    // Offset: 0x12C
    float m_textureScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_useTextureScale
    // Size: 0x1
    // Offset: 0x130
    bool m_useTextureScale;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_useTextureScale and: m_textureOffset
    char __padding54[0x3] = {};
    // private System.Single m_textureOffset
    // Size: 0x4
    // Offset: 0x134
    float m_textureOffset;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_useMatrix
    // Size: 0x1
    // Offset: 0x138
    bool m_useMatrix;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_useMatrix and: m_matrix
    char __padding56[0x3] = {};
    // private UnityEngine.Matrix4x4 m_matrix
    // Size: 0x40
    // Offset: 0x13C
    ::UnityEngine::Matrix4x4 m_matrix;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private System.Boolean m_collider
    // Size: 0x1
    // Offset: 0x17C
    bool m_collider;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_trigger
    // Size: 0x1
    // Offset: 0x17D
    bool m_trigger;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_trigger and: m_physicsMaterial
    char __padding59[0x2] = {};
    // private UnityEngine.PhysicsMaterial2D m_physicsMaterial
    // Size: 0x8
    // Offset: 0x180
    ::UnityEngine::PhysicsMaterial2D* m_physicsMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::PhysicsMaterial2D*) == 0x8);
    // private System.Boolean m_alignOddWidthToPixels
    // Size: 0x1
    // Offset: 0x188
    bool m_alignOddWidthToPixels;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get static field: static private UnityEngine.Vector3 v3zero
    static ::UnityEngine::Vector3 _get_v3zero();
    // Set static field: static private UnityEngine.Vector3 v3zero
    static void _set_v3zero(::UnityEngine::Vector3 value);
    // Get static field: static private UnityEngine.Canvas m_canvas
    static ::UnityEngine::Canvas* _get_m_canvas();
    // Set static field: static private UnityEngine.Canvas m_canvas
    static void _set_m_canvas(::UnityEngine::Canvas* value);
    // Get static field: static private UnityEngine.Transform camTransform
    static ::UnityEngine::Transform* _get_camTransform();
    // Set static field: static private UnityEngine.Transform camTransform
    static void _set_camTransform(::UnityEngine::Transform* value);
    // Get static field: static private UnityEngine.Camera cam3D
