// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: RootMotion::FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: AimIK
  class AimIK;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Forward declaring type: AimController
  class AimController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::RootMotion::FinalIK::AimController);
DEFINE_IL2CPP_ARG_TYPE(::RootMotion::FinalIK::AimController*, "RootMotion.FinalIK", "AimController");
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0xA5
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.AimController
  // [TokenAttribute] Offset: FFFFFFFF
  class AimController : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [TooltipAttribute] Offset: 0xAC5384
    // public RootMotion.FinalIK.AimIK ik
    // Size: 0x8
    // Offset: 0x18
    ::RootMotion::FinalIK::AimIK* ik;
    // Field size check
    static_assert(sizeof(::RootMotion::FinalIK::AimIK*) == 0x8);
    // [TooltipAttribute] Offset: 0xAC53BC
    // [RangeAttribute] Offset: 0xAC53BC
    // public System.Single weight
    // Size: 0x4
    // Offset: 0x20
    float weight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: weight and: target
    char __padding1[0x4] = {};
    // [HeaderAttribute] Offset: 0xAC5410
    // [TooltipAttribute] Offset: 0xAC5410
    // public UnityEngine.Transform target
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Transform* target;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xAC5470
    // public System.Single targetSwitchSmoothTime
    // Size: 0x4
    // Offset: 0x30
    float targetSwitchSmoothTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC54A8
    // public System.Single weightSmoothTime
    // Size: 0x4
    // Offset: 0x34
    float weightSmoothTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0xAC54E0
    // [TooltipAttribute] Offset: 0xAC54E0
    // public System.Boolean smoothTurnTowardsTarget
    // Size: 0x1
    // Offset: 0x38
    bool smoothTurnTowardsTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: smoothTurnTowardsTarget and: maxRadiansDelta
    char __padding5[0x3] = {};
    // [TooltipAttribute] Offset: 0xAC5540
    // public System.Single maxRadiansDelta
    // Size: 0x4
    // Offset: 0x3C
    float maxRadiansDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC5578
    // public System.Single maxMagnitudeDelta
    // Size: 0x4
    // Offset: 0x40
    float maxMagnitudeDelta;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC55B0
    // public System.Single slerpSpeed
    // Size: 0x4
    // Offset: 0x44
    float slerpSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC55E8
    // public UnityEngine.Vector3 pivotOffsetFromRoot
    // Size: 0xC
    // Offset: 0x48
    ::UnityEngine::Vector3 pivotOffsetFromRoot;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [TooltipAttribute] Offset: 0xAC5620
    // public System.Single minDistance
    // Size: 0x4
    // Offset: 0x54
    float minDistance;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC5658
    // public UnityEngine.Vector3 offset
    // Size: 0xC
    // Offset: 0x58
    ::UnityEngine::Vector3 offset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [HeaderAttribute] Offset: 0xAC5690
    // [TooltipAttribute] Offset: 0xAC5690
    // [RangeAttribute] Offset: 0xAC5690
    // public System.Single maxRootAngle
    // Size: 0x4
    // Offset: 0x64
    float maxRootAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [HeaderAttribute] Offset: 0xAC570C
    // [TooltipAttribute] Offset: 0xAC570C
    // public System.Boolean useAnimatedAimDirection
    // Size: 0x1
    // Offset: 0x68
    bool useAnimatedAimDirection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: useAnimatedAimDirection and: animatedAimDirection
    char __padding13[0x3] = {};
    // [TooltipAttribute] Offset: 0xAC576C
    // public UnityEngine.Vector3 animatedAimDirection
    // Size: 0xC
    // Offset: 0x6C
    ::UnityEngine::Vector3 animatedAimDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Transform lastTarget
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Transform* lastTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Single switchWeight
    // Size: 0x4
    // Offset: 0x80
    float switchWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single switchWeightV
    // Size: 0x4
    // Offset: 0x84
    float switchWeightV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single weightV
    // Size: 0x4
    // Offset: 0x88
    float weightV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 lastPosition
    // Size: 0xC
    // Offset: 0x8C
    ::UnityEngine::Vector3 lastPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Vector3 dir
    // Size: 0xC
    // Offset: 0x98
    ::UnityEngine::Vector3 dir;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean lastSmoothTowardsTarget
    // Size: 0x1
    // Offset: 0xA4
    bool lastSmoothTowardsTarget;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public RootMotion.FinalIK.AimIK ik
    [[deprecated("Use field access instead!")]] ::RootMotion::FinalIK::AimIK*& dyn_ik();
    // Get instance field reference: public System.Single weight
    [[deprecated("Use field access instead!")]] float& dyn_weight();
    // Get instance field reference: public UnityEngine.Transform target
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_target();
    // Get instance field reference: public System.Single targetSwitchSmoothTime
    [[deprecated("Use field access instead!")]] float& dyn_targetSwitchSmoothTime();
    // Get instance field reference: public System.Single weightSmoothTime
    [[deprecated("Use field access instead!")]] float& dyn_weightSmoothTime();
    // Get instance field reference: public System.Boolean smoothTurnTowardsTarget
    [[deprecated("Use field access instead!")]] bool& dyn_smoothTurnTowardsTarget();
    // Get instance field reference: public System.Single maxRadiansDelta
    [[deprecated("Use field access instead!")]] float& dyn_maxRadiansDelta();
    // Get instance field reference: public System.Single maxMagnitudeDelta
    [[deprecated("Use field access instead!")]] float& dyn_maxMagnitudeDelta();
    // Get instance field reference: public System.Single slerpSpeed
    [[deprecated("Use field access instead!")]] float& dyn_slerpSpeed();
    // Get instance field reference: public UnityEngine.Vector3 pivotOffsetFromRoot
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_pivotOffsetFromRoot();
    // Get instance field reference: public System.Single minDistance
    [[deprecated("Use field access instead!")]] float& dyn_minDistance();
    // Get instance field reference: public UnityEngine.Vector3 offset
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_offset();
    // Get instance field reference: public System.Single maxRootAngle
    [[deprecated("Use field access instead!")]] float& dyn_maxRootAngle();
    // Get instance field reference: public System.Boolean useAnimatedAimDirection
    [[deprecated("Use field access instead!")]] bool& dyn_useAnimatedAimDirection();
    // Get instance field reference: public UnityEngine.Vector3 animatedAimDirection
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_animatedAimDirection();
    // Get instance field reference: private UnityEngine.Transform lastTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_lastTarget();
    // Get instance field reference: private System.Single switchWeight
    [[deprecated("Use field access instead!")]] float& dyn_switchWeight();
    // Get instance field reference: private System.Single switchWeightV
    [[deprecated("Use field access instead!")]] float& dyn_switchWeightV();
    // Get instance field reference: private System.Single weightV
    [[deprecated("Use field access instead!")]] float& dyn_weightV();
    // Get instance field reference: private UnityEngine.Vector3 lastPosition
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_lastPosition();
    // Get instance field reference: private UnityEngine.Vector3 dir
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_dir();
    // Get instance field reference: private System.Boolean lastSmoothTowardsTarget
    [[deprecated("Use field access instead!")]] bool& dyn_lastSmoothTowardsTarget();
    // private System.Void Start()
    // Offset: 0x1EA549C
    void Start();
    // private System.Void LateUpdate()
    // Offset: 0x1EA5744
    void LateUpdate();
    // private UnityEngine.Vector3 get_pivot()
    // Offset: 0x1EA55CC
    ::UnityEngine::Vector3 get_pivot();
    // private System.Void ApplyMinDistance()
    // Offset: 0x1EA6048
    void ApplyMinDistance();
    // private System.Void RootRotation()
    // Offset: 0x1EA6214
    void RootRotation();
    // public System.Void .ctor()
    // Offset: 0x1EA65C4
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static AimController* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::RootMotion::FinalIK::AimController::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<AimController*, creationType>()));
    }
  }; // RootMotion.FinalIK.AimController
  #pragma pack(pop)
  static check_size<sizeof(AimController), 164 + sizeof(bool)> __RootMotion_FinalIK_AimControllerSizeCheck;
  static_assert(sizeof(AimController) == 0xA5);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: RootMotion::FinalIK::AimController::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::AimController::*)()>(&RootMotion::FinalIK::AimController::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::AimController*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::AimController::LateUpdate
// Il2CppName: LateUpdate
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::AimController::*)()>(&RootMotion::FinalIK::AimController::LateUpdate)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::AimController*), "LateUpdate", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::AimController::get_pivot
// Il2CppName: get_pivot
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<::UnityEngine::Vector3 (RootMotion::FinalIK::AimController::*)()>(&RootMotion::FinalIK::AimController::get_pivot)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::AimController*), "get_pivot", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::AimController::ApplyMinDistance
// Il2CppName: ApplyMinDistance
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::AimController::*)()>(&RootMotion::FinalIK::AimController::ApplyMinDistance)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::AimController*), "ApplyMinDistance", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::AimController::RootRotation
// Il2CppName: RootRotation
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (RootMotion::FinalIK::AimController::*)()>(&RootMotion::FinalIK::AimController::RootRotation)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(RootMotion::FinalIK::AimController*), "RootRotation", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: RootMotion::FinalIK::AimController::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
