// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR
#include "RootMotion/FinalIK/IKSolverVR.hpp"
// Including type: RootMotion.FinalIK.IKSolverVR/BodyPart
#include "RootMotion/FinalIK/IKSolverVR_BodyPart.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
}
// Completed forward declares
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::RootMotion::FinalIK::IKSolverVR::Spine);
DEFINE_IL2CPP_ARG_TYPE(::RootMotion::FinalIK::IKSolverVR::Spine*, "RootMotion.FinalIK", "IKSolverVR/Spine");
// Type namespace: RootMotion.FinalIK
namespace RootMotion::FinalIK {
  // Size: 0x204
  #pragma pack(push, 1)
  // Autogenerated type: RootMotion.FinalIK.IKSolverVR/Spine
  // [TokenAttribute] Offset: FFFFFFFF
  class IKSolverVR::Spine : public ::RootMotion::FinalIK::IKSolverVR::BodyPart {
    public:
    // Writing base type padding for base size: 0x44 to desired offset: 0x48
    char ___base_padding[0x4] = {};
    public:
    // [TooltipAttribute] Offset: 0xAC7B9C
    // public UnityEngine.Transform headTarget
    // Size: 0x8
    // Offset: 0x48
    ::UnityEngine::Transform* headTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xAC7BD4
    // public UnityEngine.Transform pelvisTarget
    // Size: 0x8
    // Offset: 0x50
    ::UnityEngine::Transform* pelvisTarget;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xAC7C0C
    // [RangeAttribute] Offset: 0xAC7C0C
    // public System.Single positionWeight
    // Size: 0x4
    // Offset: 0x58
    float positionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7C60
    // [RangeAttribute] Offset: 0xAC7C60
    // public System.Single rotationWeight
    // Size: 0x4
    // Offset: 0x5C
    float rotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7CB4
    // [RangeAttribute] Offset: 0xAC7CB4
    // public System.Single pelvisPositionWeight
    // Size: 0x4
    // Offset: 0x60
    float pelvisPositionWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7D08
    // [RangeAttribute] Offset: 0xAC7D08
    // public System.Single pelvisRotationWeight
    // Size: 0x4
    // Offset: 0x64
    float pelvisRotationWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7D5C
    // public UnityEngine.Transform chestGoal
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Transform* chestGoal;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // [TooltipAttribute] Offset: 0xAC7D94
    // [RangeAttribute] Offset: 0xAC7D94
    // public System.Single chestGoalWeight
    // Size: 0x4
    // Offset: 0x70
    float chestGoalWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7DE8
    // public System.Single minHeadHeight
    // Size: 0x4
    // Offset: 0x74
    float minHeadHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7E20
    // [RangeAttribute] Offset: 0xAC7E20
    // public System.Single bodyPosStiffness
    // Size: 0x4
    // Offset: 0x78
    float bodyPosStiffness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7E74
    // [RangeAttribute] Offset: 0xAC7E74
    // public System.Single bodyRotStiffness
    // Size: 0x4
    // Offset: 0x7C
    float bodyRotStiffness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7EC8
    // [FormerlySerializedAsAttribute] Offset: 0xAC7EC8
    // [RangeAttribute] Offset: 0xAC7EC8
    // public System.Single neckStiffness
    // Size: 0x4
    // Offset: 0x80
    float neckStiffness;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7F40
    // [RangeAttribute] Offset: 0xAC7F40
    // public System.Single rotateChestByHands
    // Size: 0x4
    // Offset: 0x84
    float rotateChestByHands;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7F94
    // [RangeAttribute] Offset: 0xAC7F94
    // public System.Single chestClampWeight
    // Size: 0x4
    // Offset: 0x88
    float chestClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC7FE8
    // [RangeAttribute] Offset: 0xAC7FE8
    // public System.Single headClampWeight
    // Size: 0x4
    // Offset: 0x8C
    float headClampWeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC803C
    // public System.Single moveBodyBackWhenCrouching
    // Size: 0x4
    // Offset: 0x90
    float moveBodyBackWhenCrouching;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC8074
    // [RangeAttribute] Offset: 0xAC8074
    // public System.Single maintainPelvisPosition
    // Size: 0x4
    // Offset: 0x94
    float maintainPelvisPosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [TooltipAttribute] Offset: 0xAC80C8
    // [RangeAttribute] Offset: 0xAC80C8
    // public System.Single maxRootAngle
    // Size: 0x4
    // Offset: 0x98
    float maxRootAngle;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public UnityEngine.Vector3 IKPositionHead
    // Size: 0xC
    // Offset: 0x9C
    ::UnityEngine::Vector3 IKPositionHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion IKRotationHead
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Quaternion IKRotationHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 IKPositionPelvis
    // Size: 0xC
    // Offset: 0xB8
    ::UnityEngine::Vector3 IKPositionPelvis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion IKRotationPelvis
    // Size: 0x10
    // Offset: 0xC4
    ::UnityEngine::Quaternion IKRotationPelvis;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 goalPositionChest
    // Size: 0xC
    // Offset: 0xD4
    ::UnityEngine::Vector3 goalPositionChest;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 pelvisPositionOffset
    // Size: 0xC
    // Offset: 0xE0
    ::UnityEngine::Vector3 pelvisPositionOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 chestPositionOffset
    // Size: 0xC
    // Offset: 0xEC
    ::UnityEngine::Vector3 chestPositionOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headPositionOffset
    // Size: 0xC
    // Offset: 0xF8
    ::UnityEngine::Vector3 headPositionOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Quaternion pelvisRotationOffset
    // Size: 0x10
    // Offset: 0x104
    ::UnityEngine::Quaternion pelvisRotationOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion chestRotationOffset
    // Size: 0x10
    // Offset: 0x114
    ::UnityEngine::Quaternion chestRotationOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Quaternion headRotationOffset
    // Size: 0x10
    // Offset: 0x124
    ::UnityEngine::Quaternion headRotationOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // public UnityEngine.Vector3 faceDirection
    // Size: 0xC
    // Offset: 0x134
    ::UnityEngine::Vector3 faceDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 locomotionHeadPositionOffset
    // Size: 0xC
    // Offset: 0x140
    ::UnityEngine::Vector3 locomotionHeadPositionOffset;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public UnityEngine.Vector3 headPosition
    // Size: 0xC
    // Offset: 0x14C
    ::UnityEngine::Vector3 headPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [CompilerGeneratedAttribute] Offset: 0xAC8200
    // private UnityEngine.Quaternion <anchorRotation>k__BackingField
    // Size: 0x10
    // Offset: 0x158
    ::UnityEngine::Quaternion anchorRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion headRotation
    // Size: 0x10
    // Offset: 0x168
    ::UnityEngine::Quaternion headRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion anchorRelativeToHead
    // Size: 0x10
    // Offset: 0x178
    ::UnityEngine::Quaternion anchorRelativeToHead;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion pelvisRelativeRotation
    // Size: 0x10
    // Offset: 0x188
    ::UnityEngine::Quaternion pelvisRelativeRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion chestRelativeRotation
    // Size: 0x10
    // Offset: 0x198
    ::UnityEngine::Quaternion chestRelativeRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Vector3 headDeltaPosition
    // Size: 0xC
    // Offset: 0x1A8
    ::UnityEngine::Vector3 headDeltaPosition;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private UnityEngine.Quaternion pelvisDeltaRotation
    // Size: 0x10
    // Offset: 0x1B4
    ::UnityEngine::Quaternion pelvisDeltaRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private UnityEngine.Quaternion chestTargetRotation
    // Size: 0x10
    // Offset: 0x1C4
    ::UnityEngine::Quaternion chestTargetRotation;
    // Field size check
    static_assert(sizeof(::UnityEngine::Quaternion) == 0x10);
    // private System.Int32 pelvisIndex
    // Size: 0x4
    // Offset: 0x1D4
    int pelvisIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 spineIndex
    // Size: 0x4
    // Offset: 0x1D8
    int spineIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 chestIndex
    // Size: 0x4
    // Offset: 0x1DC
    int chestIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 neckIndex
    // Size: 0x4
    // Offset: 0x1E0
    int neckIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 headIndex
    // Size: 0x4
    // Offset: 0x1E4
    int headIndex;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single length
    // Size: 0x4
    // Offset: 0x1E8
    float length;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean hasChest
    // Size: 0x1
    // Offset: 0x1EC
    bool hasChest;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean hasNeck
    // Size: 0x1
    // Offset: 0x1ED
    bool hasNeck;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: hasNeck and: headHeight
    char __padding47[0x2] = {};
    // private System.Single headHeight
    // Size: 0x4
    // Offset: 0x1F0
    float headHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single sizeMlp
    // Size: 0x4
    // Offset: 0x1F4
    float sizeMlp;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 chestForward
    // Size: 0xC
    // Offset: 0x1F8
    ::UnityEngine::Vector3 chestForward;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    public:
    // Get instance field reference: public UnityEngine.Transform headTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_headTarget();
    // Get instance field reference: public UnityEngine.Transform pelvisTarget
    [[deprecated("Use field access instead!")]] ::UnityEngine::Transform*& dyn_pelvisTarget();
    // Get instance field reference: public System.Single positionWeight
    [[deprecated("Use field access instead!")]] float& dyn_positionWeight();
    // Get instance field reference: public System.Single rotationWeight
    [[deprecated("Use field access instead!")]] float& dyn_rotationWeight();
    // Get instance field reference: public System.Single pelvisPositionWeight
    [[deprecated("Use field access instead!")]] float& dyn_pelvisPositionWeight();
