// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: WebSocketSharp.CompressionMethod
#include "WebSocketSharp/CompressionMethod.hpp"
// Including type: WebSocketSharp.Opcode
#include "WebSocketSharp/Opcode.hpp"
// Including type: WebSocketSharp.WebSocketState
#include "WebSocketSharp/WebSocketState.hpp"
// Including type: System.TimeSpan
#include "System/TimeSpan.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: WebSocketSharp
namespace WebSocketSharp {
  // Forward declaring type: Logger
  class Logger;
  // Forward declaring type: MessageEventArgs
  class MessageEventArgs;
  // Forward declaring type: CloseEventArgs
  class CloseEventArgs;
  // Forward declaring type: ErrorEventArgs
  class ErrorEventArgs;
  // Forward declaring type: HttpResponse
  class HttpResponse;
  // Forward declaring type: WebSocketFrame
  class WebSocketFrame;
  // Forward declaring type: HttpRequest
  class HttpRequest;
  // Forward declaring type: CloseStatusCode
  struct CloseStatusCode;
  // Forward declaring type: Fin
  struct Fin;
}
// Forward declaring namespace: WebSocketSharp::Net
namespace WebSocketSharp::Net {
  // Forward declaring type: AuthenticationChallenge
  class AuthenticationChallenge;
  // Forward declaring type: CookieCollection
  class CookieCollection;
  // Forward declaring type: NetworkCredential
  class NetworkCredential;
  // Forward declaring type: ClientSslConfiguration
  class ClientSslConfiguration;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action
  class Action;
  // Forward declaring type: Func`2<T, TResult>
  template<typename T, typename TResult>
  class Func_2;
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Uri
  class Uri;
  // Forward declaring type: EventHandler`1<TEventArgs>
  template<typename TEventArgs>
  class EventHandler_1;
  // Forward declaring type: EventHandler
  class EventHandler;
  // Forward declaring type: String
  class String;
  // Forward declaring type: Exception
  class Exception;
  // Forward declaring type: IAsyncResult
  class IAsyncResult;
}
// Forward declaring namespace: WebSocketSharp::Net::WebSockets
namespace WebSocketSharp::Net::WebSockets {
  // Forward declaring type: WebSocketContext
  class WebSocketContext;
}
// Forward declaring namespace: System::Threading
namespace System::Threading {
  // Forward declaring type: AutoResetEvent
  class AutoResetEvent;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: MemoryStream
  class MemoryStream;
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Queue`1<T>
  template<typename T>
  class Queue_1;
}
// Forward declaring namespace: System::Net::Sockets
namespace System::Net::Sockets {
  // Forward declaring type: TcpClient
  class TcpClient;
}
// Forward declaring namespace: System::Security::Cryptography
namespace System::Security::Cryptography {
  // Forward declaring type: RandomNumberGenerator
  class RandomNumberGenerator;
}
// Completed forward declares
// Type namespace: WebSocketSharp
namespace WebSocketSharp {
  // Forward declaring type: WebSocket
  class WebSocket;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::WebSocketSharp::WebSocket);
DEFINE_IL2CPP_ARG_TYPE(::WebSocketSharp::WebSocket*, "WebSocketSharp", "WebSocket");
// Type namespace: WebSocketSharp
namespace WebSocketSharp {
  // Size: 0x160
  #pragma pack(push, 1)
  // Autogenerated type: WebSocketSharp.WebSocket
  // [TokenAttribute] Offset: FFFFFFFF
  class WebSocket : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::WebSocketSharp::WebSocket::$sendAsync$c__AnonStorey3
    class $sendAsync$c__AnonStorey3;
    // Nested type: ::WebSocketSharp::WebSocket::$startReceiving$c__AnonStorey4
    class $startReceiving$c__AnonStorey4;
    // Nested type: ::WebSocketSharp::WebSocket::$validateSecWebSocketExtensionsServerHeader$c__AnonStorey5
    class $validateSecWebSocketExtensionsServerHeader$c__AnonStorey5;
    // Nested type: ::WebSocketSharp::WebSocket::$validateSecWebSocketProtocolServerHeader$c__AnonStorey6
    class $validateSecWebSocketProtocolServerHeader$c__AnonStorey6;
    public:
    // private WebSocketSharp.Net.AuthenticationChallenge _authChallenge
    // Size: 0x8
    // Offset: 0x10
    ::WebSocketSharp::Net::AuthenticationChallenge* authChallenge;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Net::AuthenticationChallenge*) == 0x8);
    // private System.String _base64Key
    // Size: 0x8
    // Offset: 0x18
    ::StringW base64Key;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _client
    // Size: 0x1
    // Offset: 0x20
    bool client;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: client and: closeContext
    char __padding2[0x7] = {};
    // private System.Action _closeContext
    // Size: 0x8
    // Offset: 0x28
    ::System::Action* closeContext;
    // Field size check
    static_assert(sizeof(::System::Action*) == 0x8);
    // private WebSocketSharp.CompressionMethod _compression
    // Size: 0x1
    // Offset: 0x30
    ::WebSocketSharp::CompressionMethod compression;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::CompressionMethod) == 0x1);
    // Padding between fields: compression and: context
    char __padding4[0x7] = {};
    // private WebSocketSharp.Net.WebSockets.WebSocketContext _context
    // Size: 0x8
    // Offset: 0x38
    ::WebSocketSharp::Net::WebSockets::WebSocketContext* context;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Net::WebSockets::WebSocketContext*) == 0x8);
    // private WebSocketSharp.Net.CookieCollection _cookies
    // Size: 0x8
    // Offset: 0x40
    ::WebSocketSharp::Net::CookieCollection* cookies;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Net::CookieCollection*) == 0x8);
    // private WebSocketSharp.Net.NetworkCredential _credentials
    // Size: 0x8
    // Offset: 0x48
    ::WebSocketSharp::Net::NetworkCredential* credentials;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Net::NetworkCredential*) == 0x8);
    // private System.Boolean _emitOnPing
    // Size: 0x1
    // Offset: 0x50
    bool emitOnPing;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _enableRedirection
    // Size: 0x1
    // Offset: 0x51
    bool enableRedirection;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: enableRedirection and: exitReceiving
    char __padding9[0x6] = {};
    // private System.Threading.AutoResetEvent _exitReceiving
    // Size: 0x8
    // Offset: 0x58
    ::System::Threading::AutoResetEvent* exitReceiving;
    // Field size check
    static_assert(sizeof(::System::Threading::AutoResetEvent*) == 0x8);
    // private System.String _extensions
    // Size: 0x8
    // Offset: 0x60
    ::StringW extensions;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _extensionsRequested
    // Size: 0x1
    // Offset: 0x68
    bool extensionsRequested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: extensionsRequested and: forConn
    char __padding12[0x7] = {};
    // private System.Object _forConn
    // Size: 0x8
    // Offset: 0x70
    ::Il2CppObject* forConn;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _forMessageEventQueue
    // Size: 0x8
    // Offset: 0x78
    ::Il2CppObject* forMessageEventQueue;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.Object _forSend
    // Size: 0x8
    // Offset: 0x80
    ::Il2CppObject* forSend;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private System.IO.MemoryStream _fragmentsBuffer
    // Size: 0x8
    // Offset: 0x88
    ::System::IO::MemoryStream* fragmentsBuffer;
    // Field size check
    static_assert(sizeof(::System::IO::MemoryStream*) == 0x8);
    // private System.Boolean _fragmentsCompressed
    // Size: 0x1
    // Offset: 0x90
    bool fragmentsCompressed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private WebSocketSharp.Opcode _fragmentsOpcode
    // Size: 0x1
    // Offset: 0x91
    ::WebSocketSharp::Opcode fragmentsOpcode;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Opcode) == 0x1);
    // Padding between fields: fragmentsOpcode and: handshakeRequestChecker
    char __padding18[0x6] = {};
    // private System.Func`2<WebSocketSharp.Net.WebSockets.WebSocketContext,System.String> _handshakeRequestChecker
    // Size: 0x8
    // Offset: 0x98
    ::System::Func_2<::WebSocketSharp::Net::WebSockets::WebSocketContext*, ::StringW>* handshakeRequestChecker;
    // Field size check
    static_assert(sizeof(::System::Func_2<::WebSocketSharp::Net::WebSockets::WebSocketContext*, ::StringW>*) == 0x8);
    // private System.Boolean _ignoreExtensions
    // Size: 0x1
    // Offset: 0xA0
    bool ignoreExtensions;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _inContinuation
    // Size: 0x1
    // Offset: 0xA1
    bool inContinuation;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _inMessage
    // Size: 0x1
    // Offset: 0xA2
    bool inMessage;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inMessage and: logger
    char __padding22[0x5] = {};
    // private WebSocketSharp.Logger _logger
    // Size: 0x8
    // Offset: 0xA8
    ::WebSocketSharp::Logger* logger;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Logger*) == 0x8);
    // private System.Action`1<WebSocketSharp.MessageEventArgs> _message
    // Size: 0x8
    // Offset: 0xB0
    ::System::Action_1<::WebSocketSharp::MessageEventArgs*>* message_;
    // Field size check
    static_assert(sizeof(::System::Action_1<::WebSocketSharp::MessageEventArgs*>*) == 0x8);
    // private System.Collections.Generic.Queue`1<WebSocketSharp.MessageEventArgs> _messageEventQueue
    // Size: 0x8
    // Offset: 0xB8
    ::System::Collections::Generic::Queue_1<::WebSocketSharp::MessageEventArgs*>* messageEventQueue;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Queue_1<::WebSocketSharp::MessageEventArgs*>*) == 0x8);
    // private System.UInt32 _nonceCount
    // Size: 0x4
    // Offset: 0xC0
    uint nonceCount;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: nonceCount and: origin
    char __padding26[0x4] = {};
    // private System.String _origin
    // Size: 0x8
    // Offset: 0xC8
    ::StringW origin;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _preAuth
    // Size: 0x1
    // Offset: 0xD0
    bool preAuth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: preAuth and: protocol
    char __padding28[0x7] = {};
    // private System.String _protocol
    // Size: 0x8
    // Offset: 0xD8
    ::StringW protocol;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String[] _protocols
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<::StringW> protocols;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // private System.Boolean _protocolsRequested
    // Size: 0x1
    // Offset: 0xE8
    bool protocolsRequested;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: protocolsRequested and: proxyCredentials
    char __padding31[0x7] = {};
    // private WebSocketSharp.Net.NetworkCredential _proxyCredentials
    // Size: 0x8
    // Offset: 0xF0
    ::WebSocketSharp::Net::NetworkCredential* proxyCredentials;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Net::NetworkCredential*) == 0x8);
    // private System.Uri _proxyUri
    // Size: 0x8
    // Offset: 0xF8
    ::System::Uri* proxyUri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private WebSocketSharp.WebSocketState _readyState
    // Size: 0x2
    // Offset: 0x100
    ::WebSocketSharp::WebSocketState readyState;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::WebSocketState) == 0x2);
    // Padding between fields: readyState and: receivePong
    char __padding34[0x6] = {};
    // private System.Threading.AutoResetEvent _receivePong
    // Size: 0x8
    // Offset: 0x108
    ::System::Threading::AutoResetEvent* receivePong;
    // Field size check
    static_assert(sizeof(::System::Threading::AutoResetEvent*) == 0x8);
    // private System.Boolean _secure
    // Size: 0x1
    // Offset: 0x110
    bool secure;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: secure and: sslConfig
    char __padding36[0x7] = {};
    // private WebSocketSharp.Net.ClientSslConfiguration _sslConfig
    // Size: 0x8
    // Offset: 0x118
    ::WebSocketSharp::Net::ClientSslConfiguration* sslConfig;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Net::ClientSslConfiguration*) == 0x8);
    // private System.IO.Stream _stream
    // Size: 0x8
    // Offset: 0x120
    ::System::IO::Stream* stream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Net.Sockets.TcpClient _tcpClient
    // Size: 0x8
    // Offset: 0x128
    ::System::Net::Sockets::TcpClient* tcpClient;
    // Field size check
    static_assert(sizeof(::System::Net::Sockets::TcpClient*) == 0x8);
    // private System.Uri _uri
    // Size: 0x8
    // Offset: 0x130
    ::System::Uri* uri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // private System.TimeSpan _waitTime
    // Size: 0x8
    // Offset: 0x138
    ::System::TimeSpan waitTime;
    // Field size check
    static_assert(sizeof(::System::TimeSpan) == 0x8);
    // private System.EventHandler`1<WebSocketSharp.CloseEventArgs> OnClose
    // Size: 0x8
    // Offset: 0x140
    ::System::EventHandler_1<::WebSocketSharp::CloseEventArgs*>* OnClose;
    // Field size check
    static_assert(sizeof(::System::EventHandler_1<::WebSocketSharp::CloseEventArgs*>*) == 0x8);
    // private System.EventHandler`1<WebSocketSharp.ErrorEventArgs> OnError
    // Size: 0x8
    // Offset: 0x148
    ::System::EventHandler_1<::WebSocketSharp::ErrorEventArgs*>* OnError;
    // Field size check
    static_assert(sizeof(::System::EventHandler_1<::WebSocketSharp::ErrorEventArgs*>*) == 0x8);
    // private System.EventHandler`1<WebSocketSharp.MessageEventArgs> OnMessage
    // Size: 0x8
    // Offset: 0x150
    ::System::EventHandler_1<::WebSocketSharp::MessageEventArgs*>* OnMessage;
    // Field size check
    static_assert(sizeof(::System::EventHandler_1<::WebSocketSharp::MessageEventArgs*>*) == 0x8);
    // private System.EventHandler OnOpen
    // Size: 0x8
    // Offset: 0x158
    ::System::EventHandler* OnOpen;
    // Field size check
    static_assert(sizeof(::System::EventHandler*) == 0x8);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // static field const value: static private System.String _guid
    static constexpr const char* _guid = "258EAFA5-E914-47DA-95CA-C5AB0DC85B11";
    // Get static field: static private System.String _guid
    static ::StringW _get__guid();
    // Set static field: static private System.String _guid
    static void _set__guid(::StringW value);
    // static field const value: static private System.String _version
    static constexpr const char* _version = "13";
    // Get static field: static private System.String _version
    static ::StringW _get__version();
    // Set static field: static private System.String _version
