// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.Collections.Generic.IEnumerable`1
#include "System/Collections/Generic/IEnumerable_1.hpp"
// Including type: WebSocketSharp.Fin
#include "WebSocketSharp/Fin.hpp"
// Including type: WebSocketSharp.Mask
#include "WebSocketSharp/Mask.hpp"
// Including type: WebSocketSharp.Opcode
#include "WebSocketSharp/Opcode.hpp"
// Including type: WebSocketSharp.Rsv
#include "WebSocketSharp/Rsv.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: WebSocketSharp
namespace WebSocketSharp {
  // Forward declaring type: PayloadData
  class PayloadData;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Action`1<T>
  template<typename T>
  class Action_1;
  // Forward declaring type: Exception
  class Exception;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: IEnumerator`1<T>
  template<typename T>
  class IEnumerator_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Completed forward declares
// Type namespace: WebSocketSharp
namespace WebSocketSharp {
  // Forward declaring type: WebSocketFrame
  class WebSocketFrame;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::WebSocketSharp::WebSocketFrame);
DEFINE_IL2CPP_ARG_TYPE(::WebSocketSharp::WebSocketFrame*, "WebSocketSharp", "WebSocketFrame");
// Type namespace: WebSocketSharp
namespace WebSocketSharp {
  // Size: 0x3C
  #pragma pack(push, 1)
  // Autogenerated type: WebSocketSharp.WebSocketFrame
  // [TokenAttribute] Offset: FFFFFFFF
  class WebSocketFrame : public ::Il2CppObject/*, public ::System::Collections::Generic::IEnumerable_1<uint8_t>*/ {
    public:
    // Nested type: ::WebSocketSharp::WebSocketFrame::$dump$c__AnonStorey1
    class $dump$c__AnonStorey1;
    // Nested type: ::WebSocketSharp::WebSocketFrame::$readExtendedPayloadLengthAsync$c__AnonStorey3
    class $readExtendedPayloadLengthAsync$c__AnonStorey3;
    // Nested type: ::WebSocketSharp::WebSocketFrame::$readHeaderAsync$c__AnonStorey4
    class $readHeaderAsync$c__AnonStorey4;
    // Nested type: ::WebSocketSharp::WebSocketFrame::$readMaskingKeyAsync$c__AnonStorey5
    class $readMaskingKeyAsync$c__AnonStorey5;
    // Nested type: ::WebSocketSharp::WebSocketFrame::$readPayloadDataAsync$c__AnonStorey6
    class $readPayloadDataAsync$c__AnonStorey6;
    // Nested type: ::WebSocketSharp::WebSocketFrame::$ReadFrameAsync$c__AnonStorey7
    class $ReadFrameAsync$c__AnonStorey7;
    // Nested type: ::WebSocketSharp::WebSocketFrame::$GetEnumerator$c__Iterator0
    class $GetEnumerator$c__Iterator0;
    public:
    // private System.Byte[] _extPayloadLength
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<uint8_t> extPayloadLength;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private WebSocketSharp.Fin _fin
    // Size: 0x1
    // Offset: 0x18
    ::WebSocketSharp::Fin fin;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Fin) == 0x1);
    // private WebSocketSharp.Mask _mask
    // Size: 0x1
    // Offset: 0x19
    ::WebSocketSharp::Mask mask;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Mask) == 0x1);
    // Padding between fields: mask and: maskingKey
    char __padding2[0x6] = {};
    // private System.Byte[] _maskingKey
    // Size: 0x8
    // Offset: 0x20
    ::ArrayW<uint8_t> maskingKey;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private WebSocketSharp.Opcode _opcode
    // Size: 0x1
    // Offset: 0x28
    ::WebSocketSharp::Opcode opcode;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Opcode) == 0x1);
    // Padding between fields: opcode and: payloadData
    char __padding4[0x7] = {};
    // private WebSocketSharp.PayloadData _payloadData
    // Size: 0x8
    // Offset: 0x30
    ::WebSocketSharp::PayloadData* payloadData;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::PayloadData*) == 0x8);
    // private System.Byte _payloadLength
    // Size: 0x1
    // Offset: 0x38
    uint8_t payloadLength;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private WebSocketSharp.Rsv _rsv1
    // Size: 0x1
    // Offset: 0x39
    ::WebSocketSharp::Rsv rsv1;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Rsv) == 0x1);
    // private WebSocketSharp.Rsv _rsv2
    // Size: 0x1
    // Offset: 0x3A
    ::WebSocketSharp::Rsv rsv2;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Rsv) == 0x1);
    // private WebSocketSharp.Rsv _rsv3
    // Size: 0x1
    // Offset: 0x3B
    ::WebSocketSharp::Rsv rsv3;
    // Field size check
    static_assert(sizeof(::WebSocketSharp::Rsv) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::Collections::Generic::IEnumerable_1<uint8_t>
    operator ::System::Collections::Generic::IEnumerable_1<uint8_t>() noexcept {
      return *reinterpret_cast<::System::Collections::Generic::IEnumerable_1<uint8_t>*>(this);
    }
    // Get static field: static readonly System.Byte[] EmptyPingBytes
    static ::ArrayW<uint8_t> _get_EmptyPingBytes();
    // Set static field: static readonly System.Byte[] EmptyPingBytes
    static void _set_EmptyPingBytes(::ArrayW<uint8_t> value);
    // Get instance field reference: private System.Byte[] _extPayloadLength
    [[deprecated("Use field access instead!")]] ::ArrayW<uint8_t>& dyn__extPayloadLength();
    // Get instance field reference: private WebSocketSharp.Fin _fin
