// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PowerUI.Css.Style
#include "PowerUI/Css/Style.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: PowerUI.Css.DisplayType
#include "PowerUI/Css/DisplayType.hpp"
// Including type: PowerUI.Css.PositionType
#include "PowerUI/Css/PositionType.hpp"
// Including type: PowerUI.Css.WhiteSpaceType
#include "PowerUI/Css/WhiteSpaceType.hpp"
// Including type: PowerUI.Css.VisibilityType
#include "PowerUI/Css/VisibilityType.hpp"
// Including type: PowerUI.Css.VerticalAlignType
#include "PowerUI/Css/VerticalAlignType.hpp"
// Including type: PowerUI.Css.HorizontalAlignType
#include "PowerUI/Css/HorizontalAlignType.hpp"
// Including type: PowerUI.Css.OverflowType
#include "PowerUI/Css/OverflowType.hpp"
// Including type: PowerUI.Css.DirectionType
#include "PowerUI/Css/DirectionType.hpp"
// Including type: PowerUI.Css.FloatType
#include "PowerUI/Css/FloatType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Transformation
  class Transformation;
  // Forward declaring type: InputTag
  class InputTag;
  // Forward declaring type: Element
  class Element;
}
// Forward declaring namespace: PowerUI::Css
namespace PowerUI::Css {
  // Forward declaring type: BorderProperty
  class BorderProperty;
  // Forward declaring type: BackgroundImage
  class BackgroundImage;
  // Forward declaring type: BackgroundColour
  class BackgroundColour;
  // Forward declaring type: TextRenderingProperty
  class TextRenderingProperty;
  // Forward declaring type: ShaderData
  class ShaderData;
  // Forward declaring type: SelectorType
  struct SelectorType;
  // Forward declaring type: CssProperty
  class CssProperty;
  // Forward declaring type: Value
  class Value;
  // Forward declaring type: ShadowData
  class ShadowData;
  // Forward declaring type: StrokeData
  class StrokeData;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: GameObject
  class GameObject;
}
// Completed forward declares
// Type namespace: PowerUI.Css
namespace PowerUI::Css {
  // Forward declaring type: ComputedStyle
  class ComputedStyle;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::Css::ComputedStyle);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::Css::ComputedStyle*, "PowerUI.Css", "ComputedStyle");
// Type namespace: PowerUI.Css
namespace PowerUI::Css {
  // Size: 0x178
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.Css.ComputedStyle
  // [TokenAttribute] Offset: FFFFFFFF
  class ComputedStyle : public ::PowerUI::Css::Style {
    public:
    public:
    // public System.Boolean Clip
    // Size: 0x1
    // Offset: 0x20
    bool Clip;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Clip and: ZIndex
    char __padding0[0x3] = {};
    // public System.Single ZIndex
    // Size: 0x4
    // Offset: 0x24
    float ZIndex;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Single FixedZIndex
    // Size: 0x4
    // Offset: 0x28
    float FixedZIndex;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Int32 OffsetTop
    // Size: 0x4
    // Offset: 0x2C
    int OffsetTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 OffsetLeft
    // Size: 0x4
    // Offset: 0x30
    int OffsetLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PixelWidth
    // Size: 0x4
    // Offset: 0x34
    int PixelWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PixelHeight
    // Size: 0x4
    // Offset: 0x38
    int PixelHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 InnerWidth
    // Size: 0x4
    // Offset: 0x3C
    int InnerWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 InnerHeight
    // Size: 0x4
    // Offset: 0x40
    int InnerHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean FixedDepth
    // Size: 0x1
    // Offset: 0x44
    bool FixedDepth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean FixedWidth
    // Size: 0x1
    // Offset: 0x45
    bool FixedWidth;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean FixedHeight
    // Size: 0x1
    // Offset: 0x46
    bool FixedHeight;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: FixedHeight and: ParentOffsetTop
    char __padding11[0x1] = {};
    // public System.Int32 ParentOffsetTop
    // Size: 0x4
    // Offset: 0x48
    int ParentOffsetTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 ParentOffsetLeft
    // Size: 0x4
    // Offset: 0x4C
    int ParentOffsetLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 ContentWidth
    // Size: 0x4
    // Offset: 0x50
    int ContentWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 ContentHeight
    // Size: 0x4
    // Offset: 0x54
    int ContentHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 BorderTop
    // Size: 0x4
    // Offset: 0x58
    int BorderTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 BorderLeft
    // Size: 0x4
    // Offset: 0x5C
    int BorderLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public PowerUI.Transformation Transform
    // Size: 0x8
    // Offset: 0x60
    ::PowerUI::Transformation* Transform;
    // Field size check
    static_assert(sizeof(::PowerUI::Transformation*) == 0x8);
    // public UnityEngine.Color ColorOverlay
    // Size: 0x10
    // Offset: 0x68
    ::UnityEngine::Color ColorOverlay;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public System.Int32 PaddedWidth
    // Size: 0x4
    // Offset: 0x78
    int PaddedWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PaddedHeight
    // Size: 0x4
    // Offset: 0x7C
    int PaddedHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 ScrollTop
    // Size: 0x4
    // Offset: 0x80
    int ScrollTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 ScrollLeft
    // Size: 0x4
    // Offset: 0x84
    int ScrollLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 StyleOffsetTop
    // Size: 0x4
    // Offset: 0x88
    int StyleOffsetTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 StyleOffsetLeft
    // Size: 0x4
    // Offset: 0x8C
    int StyleOffsetLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MarginTop
    // Size: 0x4
    // Offset: 0x90
    int MarginTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MarginLeft
    // Size: 0x4
    // Offset: 0x94
    int MarginLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MarginRight
    // Size: 0x4
    // Offset: 0x98
    int MarginRight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MarginBottom
    // Size: 0x4
    // Offset: 0x9C
    int MarginBottom;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PaddingTop
    // Size: 0x4
    // Offset: 0xA0
    int PaddingTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PaddingLeft
    // Size: 0x4
    // Offset: 0xA4
    int PaddingLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PaddingRight
    // Size: 0x4
    // Offset: 0xA8
    int PaddingRight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PaddingBottom
    // Size: 0x4
    // Offset: 0xAC
    int PaddingBottom;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean AutoMarginX
    // Size: 0x1
    // Offset: 0xB0
    bool AutoMarginX;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean AutoMarginY
    // Size: 0x1
    // Offset: 0xB1
    bool AutoMarginY;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: AutoMarginY and: Baseline
    char __padding35[0x2] = {};
    // public System.Int32 Baseline
    // Size: 0x4
    // Offset: 0xB4
    int Baseline;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PositionTop
    // Size: 0x4
    // Offset: 0xB8
    int PositionTop;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PositionLeft
    // Size: 0x4
    // Offset: 0xBC
    int PositionLeft;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PositionRight
    // Size: 0x4
    // Offset: 0xC0
    int PositionRight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 PositionBottom
    // Size: 0x4
    // Offset: 0xC4
    int PositionBottom;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Boolean RightPositioned
    // Size: 0x1
    // Offset: 0xC8
    bool RightPositioned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean BottomPositioned
    // Size: 0x1
    // Offset: 0xC9
    bool BottomPositioned;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: BottomPositioned and: NextPacked
    char __padding42[0x6] = {};
    // public PowerUI.Css.ComputedStyle NextPacked
    // Size: 0x8
    // Offset: 0xD0
    ::PowerUI::Css::ComputedStyle* NextPacked;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ComputedStyle*) == 0x8);
    // public PowerUI.Css.ComputedStyle NextOnLine
    // Size: 0x8
    // Offset: 0xD8
    ::PowerUI::Css::ComputedStyle* NextOnLine;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ComputedStyle*) == 0x8);
    // public PowerUI.Css.DisplayType Display
    // Size: 0x4
    // Offset: 0xE0
    ::PowerUI::Css::DisplayType Display;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::DisplayType) == 0x4);
    // public PowerUI.Css.PositionType Position
    // Size: 0x4
    // Offset: 0xE4
    ::PowerUI::Css::PositionType Position;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::PositionType) == 0x4);
    // public PowerUI.Css.WhiteSpaceType WhiteSpace
    // Size: 0x4
    // Offset: 0xE8
    ::PowerUI::Css::WhiteSpaceType WhiteSpace;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::WhiteSpaceType) == 0x4);
    // public PowerUI.Css.VisibilityType Visibility
    // Size: 0x4
    // Offset: 0xEC
    ::PowerUI::Css::VisibilityType Visibility;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::VisibilityType) == 0x4);
    // public PowerUI.Css.VerticalAlignType VerticalAlign
    // Size: 0x4
    // Offset: 0xF0
    ::PowerUI::Css::VerticalAlignType VerticalAlign;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::VerticalAlignType) == 0x4);
    // public PowerUI.Css.HorizontalAlignType HorizontalAlign
    // Size: 0x4
    // Offset: 0xF4
    ::PowerUI::Css::HorizontalAlignType HorizontalAlign;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::HorizontalAlignType) == 0x4);
    // public PowerUI.Css.HorizontalAlignType HorizontalAlignLast
    // Size: 0x4
    // Offset: 0xF8
    ::PowerUI::Css::HorizontalAlignType HorizontalAlignLast;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::HorizontalAlignType) == 0x4);
    // Padding between fields: HorizontalAlignLast and: Border
    char __padding51[0x4] = {};
    // public PowerUI.Css.BorderProperty Border
    // Size: 0x8
    // Offset: 0x100
    ::PowerUI::Css::BorderProperty* Border;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::BorderProperty*) == 0x8);
    // public PowerUI.Css.BackgroundImage BGImage
    // Size: 0x8
    // Offset: 0x108
    ::PowerUI::Css::BackgroundImage* BGImage;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::BackgroundImage*) == 0x8);
    // public PowerUI.Css.BackgroundColour BGColour
    // Size: 0x8
    // Offset: 0x110
    ::PowerUI::Css::BackgroundColour* BGColour;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::BackgroundColour*) == 0x8);
    // public PowerUI.Css.TextRenderingProperty Text
    // Size: 0x8
    // Offset: 0x118
    ::PowerUI::Css::TextRenderingProperty* Text;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::TextRenderingProperty*) == 0x8);
    // public System.Int32 FullHeight
    // Size: 0x4
    // Offset: 0x120
    int FullHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 FullWidth
    // Size: 0x4
    // Offset: 0x124
    int FullWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.String IDSelector
    // Size: 0x8
    // Offset: 0x128
    ::StringW IDSelector;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String TagSelector
    // Size: 0x8
    // Offset: 0x130
    ::StringW TagSelector;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String ClassSelector
    // Size: 0x8
    // Offset: 0x138
    ::StringW ClassSelector;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String[] ExtraClassSelectors
    // Size: 0x8
    // Offset: 0x140
    ::ArrayW<::StringW> ExtraClassSelectors;
    // Field size check
    static_assert(sizeof(::ArrayW<::StringW>) == 0x8);
    // public System.Int32 MaximumWidth
    // Size: 0x4
    // Offset: 0x148
    int MaximumWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MaximumHeight
    // Size: 0x4
    // Offset: 0x14C
    int MaximumHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MinimumWidth
    // Size: 0x4
    // Offset: 0x150
    int MinimumWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public System.Int32 MinimumHeight
    // Size: 0x4
    // Offset: 0x154
    int MinimumHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // public PowerUI.Css.OverflowType OverflowX
    // Size: 0x4
    // Offset: 0x158
    ::PowerUI::Css::OverflowType OverflowX;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::OverflowType) == 0x4);
    // public PowerUI.Css.OverflowType OverflowY
    // Size: 0x4
    // Offset: 0x15C
    ::PowerUI::Css::OverflowType OverflowY;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::OverflowType) == 0x4);
    // public PowerUI.Css.DirectionType DrawDirection
    // Size: 0x4
    // Offset: 0x160
    ::PowerUI::Css::DirectionType DrawDirection;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::DirectionType) == 0x4);
    // public PowerUI.Css.FloatType Float
    // Size: 0x4
    // Offset: 0x164
    ::PowerUI::Css::FloatType Float;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::FloatType) == 0x4);
    // public UnityEngine.GameObject ParticleSystem
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::GameObject* ParticleSystem;
    // Field size check
    static_assert(sizeof(::UnityEngine::GameObject*) == 0x8);
    // public PowerUI.Css.ShaderData Shading
    // Size: 0x8
    // Offset: 0x170
    ::PowerUI::Css::ShaderData* Shading;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ShaderData*) == 0x8);
    public:
    // Get instance field reference: public System.Boolean Clip
    [[deprecated("Use field access instead!")]] bool& dyn_Clip();
    // Get instance field reference: public System.Single ZIndex
    [[deprecated("Use field access instead!")]] float& dyn_ZIndex();
    // Get instance field reference: public System.Single FixedZIndex
    [[deprecated("Use field access instead!")]] float& dyn_FixedZIndex();
    // Get instance field reference: public System.Int32 OffsetTop
    [[deprecated("Use field access instead!")]] int& dyn_OffsetTop();
    // Get instance field reference: public System.Int32 OffsetLeft
    [[deprecated("Use field access instead!")]] int& dyn_OffsetLeft();
    // Get instance field reference: public System.Int32 PixelWidth
    [[deprecated("Use field access instead!")]] int& dyn_PixelWidth();
