// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: PowerUI.Css.ValueType
#include "PowerUI/Css/ValueType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: PowerUI::Css
namespace PowerUI::Css {
  // Forward declaring type: Calculation
  class Calculation;
  // Forward declaring type: CssProperty
  class CssProperty;
  // Forward declaring type: ComputedStyle
  class ComputedStyle;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Color
  struct Color;
}
// Forward declaring namespace: PowerUI
namespace PowerUI {
  // Forward declaring type: Element
  class Element;
}
// Completed forward declares
// Type namespace: PowerUI.Css
namespace PowerUI::Css {
  // Forward declaring type: Value
  class Value;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::PowerUI::Css::Value);
DEFINE_IL2CPP_ARG_TYPE(::PowerUI::Css::Value*, "PowerUI.Css", "Value");
// Type namespace: PowerUI.Css
namespace PowerUI::Css {
  // Size: 0x3C
  #pragma pack(push, 1)
  // Autogenerated type: PowerUI.Css.Value
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: AD1468
  class Value : public ::Il2CppObject {
    public:
    public:
    // public System.Int32 PX
    // Size: 0x4
    // Offset: 0x10
    int PX;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: PX and: Text
    char __padding0[0x4] = {};
    // public System.String Text
    // Size: 0x8
    // Offset: 0x18
    ::StringW Text;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Single Single
    // Size: 0x4
    // Offset: 0x20
    float Single;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean Boolean
    // Size: 0x1
    // Offset: 0x24
    bool Boolean;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // public System.Boolean Important
    // Size: 0x1
    // Offset: 0x25
    bool Important;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: Important and: InnerValues
    char __padding4[0x2] = {};
    // public PowerUI.Css.Value[] InnerValues
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::PowerUI::Css::Value*> InnerValues;
    // Field size check
    static_assert(sizeof(::ArrayW<::PowerUI::Css::Value*>) == 0x8);
    // public PowerUI.Css.Calculation Calculation
    // Size: 0x8
    // Offset: 0x30
    ::PowerUI::Css::Calculation* Calculation;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::Calculation*) == 0x8);
    // public PowerUI.Css.ValueType Type
    // Size: 0x4
    // Offset: 0x38
    ::PowerUI::Css::ValueType Type;
    // Field size check
    static_assert(sizeof(::PowerUI::Css::ValueType) == 0x4);
    public:
    // Get instance field reference: public System.Int32 PX
    [[deprecated("Use field access instead!")]] int& dyn_PX();
    // Get instance field reference: public System.String Text
    [[deprecated("Use field access instead!")]] ::StringW& dyn_Text();
    // Get instance field reference: public System.Single Single
    [[deprecated("Use field access instead!")]] float& dyn_Single();
    // Get instance field reference: public System.Boolean Boolean
    [[deprecated("Use field access instead!")]] bool& dyn_Boolean();
    // Get instance field reference: public System.Boolean Important
    [[deprecated("Use field access instead!")]] bool& dyn_Important();
    // Get instance field reference: public PowerUI.Css.Value[] InnerValues
    [[deprecated("Use field access instead!")]] ::ArrayW<::PowerUI::Css::Value*>& dyn_InnerValues();
