// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Light
  class Light;
}
// Completed forward declares
// Type namespace: EpicToonFX
namespace EpicToonFX {
  // Forward declaring type: ETFXLightFade
  class ETFXLightFade;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::EpicToonFX::ETFXLightFade);
DEFINE_IL2CPP_ARG_TYPE(::EpicToonFX::ETFXLightFade*, "EpicToonFX", "ETFXLightFade");
// Type namespace: EpicToonFX
namespace EpicToonFX {
  // Size: 0x2C
  #pragma pack(push, 1)
  // Autogenerated type: EpicToonFX.ETFXLightFade
  // [TokenAttribute] Offset: FFFFFFFF
  class ETFXLightFade : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // [HeaderAttribute] Offset: 0xAE2B80
    // public System.Single life
    // Size: 0x4
    // Offset: 0x18
    float life;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // public System.Boolean killAfterLife
    // Size: 0x1
    // Offset: 0x1C
    bool killAfterLife;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: killAfterLife and: li
    char __padding1[0x3] = {};
    // private UnityEngine.Light li
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Light* li;
    // Field size check
    static_assert(sizeof(::UnityEngine::Light*) == 0x8);
    // private System.Single initIntensity
    // Size: 0x4
    // Offset: 0x28
    float initIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public System.Single life
    [[deprecated("Use field access instead!")]] float& dyn_life();
    // Get instance field reference: public System.Boolean killAfterLife
    [[deprecated("Use field access instead!")]] bool& dyn_killAfterLife();
    // Get instance field reference: private UnityEngine.Light li
    [[deprecated("Use field access instead!")]] ::UnityEngine::Light*& dyn_li();
    // Get instance field reference: private System.Single initIntensity
    [[deprecated("Use field access instead!")]] float& dyn_initIntensity();
    // private System.Void Start()
    // Offset: 0xF46880
    void Start();
    // private System.Void Update()
    // Offset: 0xF469B4
    void Update();
    // public System.Void .ctor()
    // Offset: 0xF46B58
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ETFXLightFade* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::EpicToonFX::ETFXLightFade::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ETFXLightFade*, creationType>()));
    }
  }; // EpicToonFX.ETFXLightFade
  #pragma pack(pop)
  static check_size<sizeof(ETFXLightFade), 40 + sizeof(float)> __EpicToonFX_ETFXLightFadeSizeCheck;
  static_assert(sizeof(ETFXLightFade) == 0x2C);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: EpicToonFX::ETFXLightFade::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (EpicToonFX::ETFXLightFade::*)()>(&EpicToonFX::ETFXLightFade::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(EpicToonFX::ETFXLightFade*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: EpicToonFX::ETFXLightFade::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (EpicToonFX::ETFXLightFade::*)()>(&EpicToonFX::ETFXLightFade::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(EpicToonFX::ETFXLightFade*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: EpicToonFX::ETFXLightFade::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
