// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Type namespace: EpicToonFX
namespace EpicToonFX {
  // Forward declaring type: ETFXRotation
  class ETFXRotation;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::EpicToonFX::ETFXRotation);
DEFINE_IL2CPP_ARG_TYPE(::EpicToonFX::ETFXRotation*, "EpicToonFX", "ETFXRotation");
// Type namespace: EpicToonFX
namespace EpicToonFX {
  // Size: 0x28
  #pragma pack(push, 1)
  // Autogenerated type: EpicToonFX.ETFXRotation
  // [TokenAttribute] Offset: FFFFFFFF
  class ETFXRotation : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::EpicToonFX::ETFXRotation::spaceEnum
    struct spaceEnum;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: EpicToonFX.ETFXRotation/spaceEnum
    // [TokenAttribute] Offset: FFFFFFFF
    struct spaceEnum/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: spaceEnum
      constexpr spaceEnum(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public EpicToonFX.ETFXRotation/spaceEnum Local
      static constexpr const int Local = 0;
      // Get static field: static public EpicToonFX.ETFXRotation/spaceEnum Local
      static ::EpicToonFX::ETFXRotation::spaceEnum _get_Local();
      // Set static field: static public EpicToonFX.ETFXRotation/spaceEnum Local
      static void _set_Local(::EpicToonFX::ETFXRotation::spaceEnum value);
      // static field const value: static public EpicToonFX.ETFXRotation/spaceEnum World
      static constexpr const int World = 1;
      // Get static field: static public EpicToonFX.ETFXRotation/spaceEnum World
      static ::EpicToonFX::ETFXRotation::spaceEnum _get_World();
      // Set static field: static public EpicToonFX.ETFXRotation/spaceEnum World
      static void _set_World(::EpicToonFX::ETFXRotation::spaceEnum value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // EpicToonFX.ETFXRotation/spaceEnum
    #pragma pack(pop)
    static check_size<sizeof(ETFXRotation::spaceEnum), 0 + sizeof(int)> __EpicToonFX_ETFXRotation_spaceEnumSizeCheck;
    static_assert(sizeof(ETFXRotation::spaceEnum) == 0x4);
    public:
    // [HeaderAttribute] Offset: 0xAE2BB8
    // public UnityEngine.Vector3 rotateVector
    // Size: 0xC
    // Offset: 0x18
    ::UnityEngine::Vector3 rotateVector;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // public EpicToonFX.ETFXRotation/spaceEnum rotateSpace
    // Size: 0x4
    // Offset: 0x24
    ::EpicToonFX::ETFXRotation::spaceEnum rotateSpace;
    // Field size check
    static_assert(sizeof(::EpicToonFX::ETFXRotation::spaceEnum) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: public UnityEngine.Vector3 rotateVector
    [[deprecated("Use field access instead!")]] ::UnityEngine::Vector3& dyn_rotateVector();
    // Get instance field reference: public EpicToonFX.ETFXRotation/spaceEnum rotateSpace
    [[deprecated("Use field access instead!")]] ::EpicToonFX::ETFXRotation::spaceEnum& dyn_rotateSpace();
    // private System.Void Start()
    // Offset: 0xF46C58
    void Start();
    // private System.Void Update()
    // Offset: 0xF46C5C
    void Update();
    // public System.Void .ctor()
    // Offset: 0xF46DEC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ETFXRotation* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::EpicToonFX::ETFXRotation::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ETFXRotation*, creationType>()));
    }
  }; // EpicToonFX.ETFXRotation
  #pragma pack(pop)
  static check_size<sizeof(ETFXRotation), 36 + sizeof(::EpicToonFX::ETFXRotation::spaceEnum)> __EpicToonFX_ETFXRotationSizeCheck;
  static_assert(sizeof(ETFXRotation) == 0x28);
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::EpicToonFX::ETFXRotation::spaceEnum, "EpicToonFX", "ETFXRotation/spaceEnum");
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: EpicToonFX::ETFXRotation::Start
// Il2CppName: Start
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (EpicToonFX::ETFXRotation::*)()>(&EpicToonFX::ETFXRotation::Start)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(EpicToonFX::ETFXRotation*), "Start", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: EpicToonFX::ETFXRotation::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (EpicToonFX::ETFXRotation::*)()>(&EpicToonFX::ETFXRotation::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(EpicToonFX::ETFXRotation*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: EpicToonFX::ETFXRotation::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
