// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: DigitalOpus.MB.Core.MB2_LogLevel
#include "DigitalOpus/MB/Core/MB2_LogLevel.hpp"
// Including type: DigitalOpus.MB.Core.MB2_PackingAlgorithmEnum
#include "DigitalOpus/MB/Core/MB2_PackingAlgorithmEnum.hpp"
// Including type: DigitalOpus.MB.Core.MB3_TextureCombinerPipeline
#include "DigitalOpus/MB/Core/MB3_TextureCombinerPipeline.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: DigitalOpus::MB::Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: ShaderTextureProperty
  class ShaderTextureProperty;
  // Forward declaring type: ProgressUpdateDelegate
  class ProgressUpdateDelegate;
  // Forward declaring type: MB2_EditorMethodsInterface
  class MB2_EditorMethodsInterface;
  // Forward declaring type: AtlasPackingResult
  class AtlasPackingResult;
  // Forward declaring type: CombineTexturesIntoAtlasesCoroutineResult
  class MB3_TextureCombiner_CombineTexturesIntoAtlasesCoroutineResult;
  // Forward declaring type: MB_TexSet
  class MB_TexSet;
}
// Forward declaring namespace: GlobalNamespace
namespace GlobalNamespace {
  // Forward declaring type: MB2_TextureBakeResults
  class MB2_TextureBakeResults;
  // Forward declaring type: MB_AtlasesAndRects
  class MB_AtlasesAndRects;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Forward declaring namespace: System::Collections
namespace System::Collections {
  // Forward declaring type: IEnumerator
  class IEnumerator;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: GameObject
  class GameObject;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: TextureFormat
  struct TextureFormat;
}
// Completed forward declares
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Forward declaring type: MB3_TextureCombiner
  class MB3_TextureCombiner;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::DigitalOpus::MB::Core::MB3_TextureCombiner);
DEFINE_IL2CPP_ARG_TYPE(::DigitalOpus::MB::Core::MB3_TextureCombiner*, "DigitalOpus.MB.Core", "MB3_TextureCombiner");
// Type namespace: DigitalOpus.MB.Core
namespace DigitalOpus::MB::Core {
  // Size: 0x60
  #pragma pack(push, 1)
  // Autogenerated type: DigitalOpus.MB.Core.MB3_TextureCombiner
  // [TokenAttribute] Offset: FFFFFFFF
  class MB3_TextureCombiner : public ::Il2CppObject {
    public:
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombiner::TemporaryTexture
    class TemporaryTexture;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombiner::$CombineTexturesIntoAtlasesCoroutine$d__68
    class $CombineTexturesIntoAtlasesCoroutine$d__68;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombiner::$_CombineTexturesIntoAtlases$d__69
    class $_CombineTexturesIntoAtlases$d__69;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombiner::$__CombineTexturesIntoAtlases$d__71
    class $__CombineTexturesIntoAtlases$d__71;
    // Nested type: ::DigitalOpus::MB::Core::MB3_TextureCombiner::$__RunTexturePacker$d__72
    class $__RunTexturePacker$d__72;
    public:
    // public DigitalOpus.MB.Core.MB2_LogLevel LOG_LEVEL
    // Size: 0x4
    // Offset: 0x10
    ::DigitalOpus::MB::Core::MB2_LogLevel LOG_LEVEL;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_LogLevel) == 0x4);
    // Padding between fields: LOG_LEVEL and: textureBakeResults
    char __padding0[0x4] = {};
    // protected MB2_TextureBakeResults _textureBakeResults
    // Size: 0x8
    // Offset: 0x18
    ::GlobalNamespace::MB2_TextureBakeResults* textureBakeResults;
    // Field size check
    static_assert(sizeof(::GlobalNamespace::MB2_TextureBakeResults*) == 0x8);
    // protected System.Int32 _atlasPadding
    // Size: 0x4
    // Offset: 0x20
    int atlasPadding;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _maxAtlasSize
    // Size: 0x4
    // Offset: 0x24
    int maxAtlasSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _maxAtlasWidthOverride
    // Size: 0x4
    // Offset: 0x28
    int maxAtlasWidthOverride;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Int32 _maxAtlasHeightOverride
    // Size: 0x4
    // Offset: 0x2C
    int maxAtlasHeightOverride;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _useMaxAtlasWidthOverride
    // Size: 0x1
    // Offset: 0x30
    bool useMaxAtlasWidthOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _useMaxAtlasHeightOverride
    // Size: 0x1
    // Offset: 0x31
    bool useMaxAtlasHeightOverride;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _resizePowerOfTwoTextures
    // Size: 0x1
    // Offset: 0x32
    bool resizePowerOfTwoTextures;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _fixOutOfBoundsUVs
    // Size: 0x1
    // Offset: 0x33
    bool fixOutOfBoundsUVs;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Int32 _maxTilingBakeSize
    // Size: 0x4
    // Offset: 0x34
    int maxTilingBakeSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _saveAtlasesAsAssets
    // Size: 0x1
    // Offset: 0x38
    bool saveAtlasesAsAssets;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: saveAtlasesAsAssets and: packingAlgorithm
    char __padding11[0x3] = {};
    // protected DigitalOpus.MB.Core.MB2_PackingAlgorithmEnum _packingAlgorithm
    // Size: 0x4
    // Offset: 0x3C
    ::DigitalOpus::MB::Core::MB2_PackingAlgorithmEnum packingAlgorithm;
    // Field size check
    static_assert(sizeof(::DigitalOpus::MB::Core::MB2_PackingAlgorithmEnum) == 0x4);
    // protected System.Boolean _meshBakerTexturePackerForcePowerOfTwo
    // Size: 0x1
    // Offset: 0x40
    bool meshBakerTexturePackerForcePowerOfTwo;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: meshBakerTexturePackerForcePowerOfTwo and: customShaderPropNames
    char __padding13[0x7] = {};
    // protected System.Collections.Generic.List`1<DigitalOpus.MB.Core.ShaderTextureProperty> _customShaderPropNames
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::ShaderTextureProperty*>* customShaderPropNames;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::ShaderTextureProperty*>*) == 0x8);
    // protected System.Boolean _normalizeTexelDensity
    // Size: 0x1
    // Offset: 0x50
    bool normalizeTexelDensity;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _considerNonTextureProperties
    // Size: 0x1
    // Offset: 0x51
    bool considerNonTextureProperties;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: considerNonTextureProperties and: temporaryTextures
    char __padding16[0x6] = {};
    // private System.Collections.Generic.List`1<DigitalOpus.MB.Core.MB3_TextureCombiner/TemporaryTexture> _temporaryTextures
    // Size: 0x8
    // Offset: 0x58
    ::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::MB3_TextureCombiner::TemporaryTexture*>* temporaryTextures;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::DigitalOpus::MB::Core::MB3_TextureCombiner::TemporaryTexture*>*) == 0x8);
    public:
    // Get static field: static public System.Boolean _RunCorutineWithoutPauseIsRunning
    static bool _get__RunCorutineWithoutPauseIsRunning();
    // Set static field: static public System.Boolean _RunCorutineWithoutPauseIsRunning
    static void _set__RunCorutineWithoutPauseIsRunning(bool value);
    // Get instance field reference: public DigitalOpus.MB.Core.MB2_LogLevel LOG_LEVEL
    [[deprecated("Use field access instead!")]] ::DigitalOpus::MB::Core::MB2_LogLevel& dyn_LOG_LEVEL();
    // Get instance field reference: protected MB2_TextureBakeResults _textureBakeResults
