// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: Tayx.Graphy.Utils.Singleton`1
#include "Tayx/Graphy/Utils/Singleton_1.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.KeyCode
#include "UnityEngine/KeyCode.hpp"
// Including type: UnityEngine.FFTWindow
#include "UnityEngine/FFTWindow.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Tayx::Graphy
namespace Tayx::Graphy {
  // Skipping declaration: LookForAudioListener because it is already included!
  // Skipping declaration: Mode because it is already included!
  // Skipping declaration: ModulePosition because it is already included!
  // Skipping declaration: ModuleState because it is already included!
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AudioListener
  class AudioListener;
}
// Forward declaring namespace: Tayx::Graphy::Fps
namespace Tayx::Graphy::Fps {
  // Forward declaring type: FpsManager
  class FpsManager;
  // Forward declaring type: FpsMonitor
  class FpsMonitor;
}
// Forward declaring namespace: Tayx::Graphy::Ram
namespace Tayx::Graphy::Ram {
  // Forward declaring type: RamManager
  class RamManager;
  // Forward declaring type: RamMonitor
  class RamMonitor;
}
// Forward declaring namespace: Tayx::Graphy::Audio
namespace Tayx::Graphy::Audio {
  // Forward declaring type: AudioManager
  class AudioManager;
  // Forward declaring type: AudioMonitor
  class AudioMonitor;
}
// Forward declaring namespace: Tayx::Graphy::Advanced
namespace Tayx::Graphy::Advanced {
  // Forward declaring type: AdvancedData
  class AdvancedData;
}
// Completed forward declares
// Type namespace: Tayx.Graphy
namespace Tayx::Graphy {
  // Forward declaring type: GraphyManager
  class GraphyManager;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Tayx::Graphy::GraphyManager);
DEFINE_IL2CPP_ARG_TYPE(::Tayx::Graphy::GraphyManager*, "Tayx.Graphy", "GraphyManager");
// Type namespace: Tayx.Graphy
namespace Tayx::Graphy {
  // WARNING Size may be invalid!
  // Autogenerated type: Tayx.Graphy.GraphyManager
  // [TokenAttribute] Offset: FFFFFFFF
  class GraphyManager : public ::Tayx::Graphy::Utils::Singleton_1<::Tayx::Graphy::GraphyManager*> {
    public:
    // Nested type: ::Tayx::Graphy::GraphyManager::Mode
    struct Mode;
    // Nested type: ::Tayx::Graphy::GraphyManager::ModuleType
    struct ModuleType;
    // Nested type: ::Tayx::Graphy::GraphyManager::ModuleState
    struct ModuleState;
    // Nested type: ::Tayx::Graphy::GraphyManager::ModulePosition
    struct ModulePosition;
    // Nested type: ::Tayx::Graphy::GraphyManager::LookForAudioListener
    struct LookForAudioListener;
    // Nested type: ::Tayx::Graphy::GraphyManager::ModuleToggleState
    struct ModuleToggleState;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Tayx.Graphy.GraphyManager/Mode
    // [TokenAttribute] Offset: FFFFFFFF
    struct Mode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: Mode
      constexpr Mode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Tayx.Graphy.GraphyManager/Mode FULL
      static constexpr const int FULL = 0;
      // Get static field: static public Tayx.Graphy.GraphyManager/Mode FULL
      static ::Tayx::Graphy::GraphyManager::Mode _get_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/Mode FULL
      static void _set_FULL(::Tayx::Graphy::GraphyManager::Mode value);
      // static field const value: static public Tayx.Graphy.GraphyManager/Mode LIGHT
      static constexpr const int LIGHT = 1;
      // Get static field: static public Tayx.Graphy.GraphyManager/Mode LIGHT
      static ::Tayx::Graphy::GraphyManager::Mode _get_LIGHT();
      // Set static field: static public Tayx.Graphy.GraphyManager/Mode LIGHT
      static void _set_LIGHT(::Tayx::Graphy::GraphyManager::Mode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Tayx.Graphy.GraphyManager/Mode
    #pragma pack(pop)
    static check_size<sizeof(GraphyManager::Mode), 0 + sizeof(int)> __Tayx_Graphy_GraphyManager_ModeSizeCheck;
    static_assert(sizeof(GraphyManager::Mode) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Tayx.Graphy.GraphyManager/ModuleState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ModuleState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ModuleState
      constexpr ModuleState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleState FULL
      static constexpr const int FULL = 0;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleState FULL
      static ::Tayx::Graphy::GraphyManager::ModuleState _get_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleState FULL
      static void _set_FULL(::Tayx::Graphy::GraphyManager::ModuleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleState TEXT
      static constexpr const int TEXT = 1;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleState TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleState _get_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleState TEXT
      static void _set_TEXT(::Tayx::Graphy::GraphyManager::ModuleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleState BASIC
      static constexpr const int BASIC = 2;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleState BASIC
      static ::Tayx::Graphy::GraphyManager::ModuleState _get_BASIC();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleState BASIC
      static void _set_BASIC(::Tayx::Graphy::GraphyManager::ModuleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleState BACKGROUND
      static constexpr const int BACKGROUND = 3;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleState BACKGROUND
      static ::Tayx::Graphy::GraphyManager::ModuleState _get_BACKGROUND();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleState BACKGROUND
      static void _set_BACKGROUND(::Tayx::Graphy::GraphyManager::ModuleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleState OFF
      static constexpr const int OFF = 4;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleState OFF
      static ::Tayx::Graphy::GraphyManager::ModuleState _get_OFF();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleState OFF
      static void _set_OFF(::Tayx::Graphy::GraphyManager::ModuleState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Tayx.Graphy.GraphyManager/ModuleState
    #pragma pack(pop)
    static check_size<sizeof(GraphyManager::ModuleState), 0 + sizeof(int)> __Tayx_Graphy_GraphyManager_ModuleStateSizeCheck;
    static_assert(sizeof(GraphyManager::ModuleState) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Tayx.Graphy.GraphyManager/ModulePosition
    // [TokenAttribute] Offset: FFFFFFFF
    struct ModulePosition/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ModulePosition
      constexpr ModulePosition(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Tayx.Graphy.GraphyManager/ModulePosition TOP_RIGHT
      static constexpr const int TOP_RIGHT = 0;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModulePosition TOP_RIGHT
      static ::Tayx::Graphy::GraphyManager::ModulePosition _get_TOP_RIGHT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModulePosition TOP_RIGHT
      static void _set_TOP_RIGHT(::Tayx::Graphy::GraphyManager::ModulePosition value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModulePosition TOP_LEFT
      static constexpr const int TOP_LEFT = 1;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModulePosition TOP_LEFT
      static ::Tayx::Graphy::GraphyManager::ModulePosition _get_TOP_LEFT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModulePosition TOP_LEFT
      static void _set_TOP_LEFT(::Tayx::Graphy::GraphyManager::ModulePosition value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModulePosition BOTTOM_RIGHT
      static constexpr const int BOTTOM_RIGHT = 2;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModulePosition BOTTOM_RIGHT
      static ::Tayx::Graphy::GraphyManager::ModulePosition _get_BOTTOM_RIGHT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModulePosition BOTTOM_RIGHT
      static void _set_BOTTOM_RIGHT(::Tayx::Graphy::GraphyManager::ModulePosition value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModulePosition BOTTOM_LEFT
      static constexpr const int BOTTOM_LEFT = 3;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModulePosition BOTTOM_LEFT
      static ::Tayx::Graphy::GraphyManager::ModulePosition _get_BOTTOM_LEFT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModulePosition BOTTOM_LEFT
      static void _set_BOTTOM_LEFT(::Tayx::Graphy::GraphyManager::ModulePosition value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Tayx.Graphy.GraphyManager/ModulePosition
    #pragma pack(pop)
    static check_size<sizeof(GraphyManager::ModulePosition), 0 + sizeof(int)> __Tayx_Graphy_GraphyManager_ModulePositionSizeCheck;
    static_assert(sizeof(GraphyManager::ModulePosition) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Tayx.Graphy.GraphyManager/LookForAudioListener
    // [TokenAttribute] Offset: FFFFFFFF
    struct LookForAudioListener/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: LookForAudioListener
      constexpr LookForAudioListener(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Tayx.Graphy.GraphyManager/LookForAudioListener ALWAYS
      static constexpr const int ALWAYS = 0;
      // Get static field: static public Tayx.Graphy.GraphyManager/LookForAudioListener ALWAYS
      static ::Tayx::Graphy::GraphyManager::LookForAudioListener _get_ALWAYS();
      // Set static field: static public Tayx.Graphy.GraphyManager/LookForAudioListener ALWAYS
      static void _set_ALWAYS(::Tayx::Graphy::GraphyManager::LookForAudioListener value);
      // static field const value: static public Tayx.Graphy.GraphyManager/LookForAudioListener ON_SCENE_LOAD
      static constexpr const int ON_SCENE_LOAD = 1;
      // Get static field: static public Tayx.Graphy.GraphyManager/LookForAudioListener ON_SCENE_LOAD
      static ::Tayx::Graphy::GraphyManager::LookForAudioListener _get_ON_SCENE_LOAD();
      // Set static field: static public Tayx.Graphy.GraphyManager/LookForAudioListener ON_SCENE_LOAD
      static void _set_ON_SCENE_LOAD(::Tayx::Graphy::GraphyManager::LookForAudioListener value);
      // static field const value: static public Tayx.Graphy.GraphyManager/LookForAudioListener NEVER
      static constexpr const int NEVER = 2;
      // Get static field: static public Tayx.Graphy.GraphyManager/LookForAudioListener NEVER
      static ::Tayx::Graphy::GraphyManager::LookForAudioListener _get_NEVER();
      // Set static field: static public Tayx.Graphy.GraphyManager/LookForAudioListener NEVER
      static void _set_NEVER(::Tayx::Graphy::GraphyManager::LookForAudioListener value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Tayx.Graphy.GraphyManager/LookForAudioListener
    #pragma pack(pop)
    static check_size<sizeof(GraphyManager::LookForAudioListener), 0 + sizeof(int)> __Tayx_Graphy_GraphyManager_LookForAudioListenerSizeCheck;
    static_assert(sizeof(GraphyManager::LookForAudioListener) == 0x4);
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Tayx.Graphy.GraphyManager/ModuleToggleState
    // [TokenAttribute] Offset: FFFFFFFF
    struct ModuleToggleState/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: ModuleToggleState
      constexpr ModuleToggleState(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_BASIC
      static constexpr const int FPS_BASIC = 0;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_BASIC
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_BASIC();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_BASIC
      static void _set_FPS_BASIC(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT
      static constexpr const int FPS_TEXT = 1;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT
      static void _set_FPS_TEXT(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL
      static constexpr const int FPS_FULL = 2;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL
      static void _set_FPS_FULL(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT_RAM_TEXT
      static constexpr const int FPS_TEXT_RAM_TEXT = 3;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT_RAM_TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_TEXT_RAM_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT_RAM_TEXT
      static void _set_FPS_TEXT_RAM_TEXT(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_TEXT
      static constexpr const int FPS_FULL_RAM_TEXT = 4;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL_RAM_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_TEXT
      static void _set_FPS_FULL_RAM_TEXT(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL
      static constexpr const int FPS_FULL_RAM_FULL = 5;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL_RAM_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL
      static void _set_FPS_FULL_RAM_FULL(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT_RAM_TEXT_AUDIO_TEXT
      static constexpr const int FPS_TEXT_RAM_TEXT_AUDIO_TEXT = 6;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT_RAM_TEXT_AUDIO_TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_TEXT_RAM_TEXT_AUDIO_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_TEXT_RAM_TEXT_AUDIO_TEXT
      static void _set_FPS_TEXT_RAM_TEXT_AUDIO_TEXT(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_TEXT_AUDIO_TEXT
      static constexpr const int FPS_FULL_RAM_TEXT_AUDIO_TEXT = 7;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_TEXT_AUDIO_TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL_RAM_TEXT_AUDIO_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_TEXT_AUDIO_TEXT
      static void _set_FPS_FULL_RAM_TEXT_AUDIO_TEXT(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_TEXT
      static constexpr const int FPS_FULL_RAM_FULL_AUDIO_TEXT = 8;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_TEXT
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL_RAM_FULL_AUDIO_TEXT();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_TEXT
      static void _set_FPS_FULL_RAM_FULL_AUDIO_TEXT(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_FULL
      static constexpr const int FPS_FULL_RAM_FULL_AUDIO_FULL = 9;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_FULL
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL_RAM_FULL_AUDIO_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_FULL
      static void _set_FPS_FULL_RAM_FULL_AUDIO_FULL(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_FULL_ADVANCED_FULL
      static constexpr const int FPS_FULL_RAM_FULL_AUDIO_FULL_ADVANCED_FULL = 10;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_FULL_ADVANCED_FULL
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_FULL_RAM_FULL_AUDIO_FULL_ADVANCED_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_FULL_RAM_FULL_AUDIO_FULL_ADVANCED_FULL
      static void _set_FPS_FULL_RAM_FULL_AUDIO_FULL_ADVANCED_FULL(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // static field const value: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_BASIC_ADVANCED_FULL
      static constexpr const int FPS_BASIC_ADVANCED_FULL = 11;
      // Get static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_BASIC_ADVANCED_FULL
      static ::Tayx::Graphy::GraphyManager::ModuleToggleState _get_FPS_BASIC_ADVANCED_FULL();
      // Set static field: static public Tayx.Graphy.GraphyManager/ModuleToggleState FPS_BASIC_ADVANCED_FULL
      static void _set_FPS_BASIC_ADVANCED_FULL(::Tayx::Graphy::GraphyManager::ModuleToggleState value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Tayx.Graphy.GraphyManager/ModuleToggleState
    #pragma pack(pop)
    static check_size<sizeof(GraphyManager::ModuleToggleState), 0 + sizeof(int)> __Tayx_Graphy_GraphyManager_ModuleToggleStateSizeCheck;
    static_assert(sizeof(GraphyManager::ModuleToggleState) == 0x4);
    public:
    // private Tayx.Graphy.Fps.FpsManager m_fpsManager
    // Size: 0x8
    // Offset: 0x18
    ::Tayx::Graphy::Fps::FpsManager* m_fpsManager;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Fps::FpsManager*) == 0x8);
    // private Tayx.Graphy.Ram.RamManager m_ramManager
    // Size: 0x8
    // Offset: 0x20
    ::Tayx::Graphy::Ram::RamManager* m_ramManager;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Ram::RamManager*) == 0x8);
    // private Tayx.Graphy.Audio.AudioManager m_audioManager
    // Size: 0x8
    // Offset: 0x28
    ::Tayx::Graphy::Audio::AudioManager* m_audioManager;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Audio::AudioManager*) == 0x8);
    // private Tayx.Graphy.Advanced.AdvancedData m_advancedData
    // Size: 0x8
    // Offset: 0x30
    ::Tayx::Graphy::Advanced::AdvancedData* m_advancedData;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Advanced::AdvancedData*) == 0x8);
    // private Tayx.Graphy.Fps.FpsMonitor m_fpsMonitor
    // Size: 0x8
    // Offset: 0x38
    ::Tayx::Graphy::Fps::FpsMonitor* m_fpsMonitor;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Fps::FpsMonitor*) == 0x8);
    // private Tayx.Graphy.Ram.RamMonitor m_ramMonitor
    // Size: 0x8
    // Offset: 0x40
    ::Tayx::Graphy::Ram::RamMonitor* m_ramMonitor;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Ram::RamMonitor*) == 0x8);
    // private Tayx.Graphy.Audio.AudioMonitor m_audioMonitor
    // Size: 0x8
    // Offset: 0x48
    ::Tayx::Graphy::Audio::AudioMonitor* m_audioMonitor;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Audio::AudioMonitor*) == 0x8);
    // private Tayx.Graphy.GraphyManager/Mode m_graphyMode
    // Size: 0x4
    // Offset: 0x50
    ::Tayx::Graphy::GraphyManager::Mode m_graphyMode;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::Mode) == 0x4);
    // private Tayx.Graphy.GraphyManager/ModuleToggleState m_moduleToggleState
    // Size: 0x4
    // Offset: 0x54
    ::Tayx::Graphy::GraphyManager::ModuleToggleState m_moduleToggleState;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModuleToggleState) == 0x4);
    // private System.Boolean m_active
    // Size: 0x1
    // Offset: 0x58
    bool m_active;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_keepAlive
    // Size: 0x1
    // Offset: 0x59
    bool m_keepAlive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_background
    // Size: 0x1
    // Offset: 0x5A
    bool m_background;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.Color m_backgroundColor
    // Size: 0x10
    // Offset: 0x5C
    ::UnityEngine::Color m_backgroundColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.KeyCode m_toggleModeKeyCode
    // Size: 0x4
    // Offset: 0x6C
    ::UnityEngine::KeyCode m_toggleModeKeyCode;
    // Field size check
    static_assert(sizeof(::UnityEngine::KeyCode) == 0x4);
    // private System.Boolean m_toggleModeCtrl
    // Size: 0x1
    // Offset: 0x70
    bool m_toggleModeCtrl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_toggleModeAlt
    // Size: 0x1
    // Offset: 0x71
    bool m_toggleModeAlt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private UnityEngine.KeyCode m_toggleActiveKeyCode
    // Size: 0x4
    // Offset: 0x74
    ::UnityEngine::KeyCode m_toggleActiveKeyCode;
    // Field size check
    static_assert(sizeof(::UnityEngine::KeyCode) == 0x4);
    // private System.Boolean m_toggleActiveCtrl
    // Size: 0x1
    // Offset: 0x78
    bool m_toggleActiveCtrl;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean m_toggleActiveAlt
    // Size: 0x1
    // Offset: 0x79
    bool m_toggleActiveAlt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Tayx.Graphy.GraphyManager/ModulePosition m_graphModulePosition
    // Size: 0x4
    // Offset: 0x7C
    ::Tayx::Graphy::GraphyManager::ModulePosition m_graphModulePosition;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModulePosition) == 0x4);
    // private Tayx.Graphy.GraphyManager/ModuleState m_fpsModuleState
    // Size: 0x4
    // Offset: 0x80
    ::Tayx::Graphy::GraphyManager::ModuleState m_fpsModuleState;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModuleState) == 0x4);
    // [TooltipAttribute] Offset: 0xADD298
    // [RangeAttribute] Offset: 0xADD298
    // private System.Int32 m_timeToResetMinMaxFps
    // Size: 0x4
    // Offset: 0x84
    int m_timeToResetMinMaxFps;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Color m_goodFpsColor
    // Size: 0x10
    // Offset: 0x88
    ::UnityEngine::Color m_goodFpsColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Int32 m_goodFpsThreshold
    // Size: 0x4
    // Offset: 0x98
    int m_goodFpsThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Color m_cautionFpsColor
    // Size: 0x10
    // Offset: 0x9C
    ::UnityEngine::Color m_cautionFpsColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Int32 m_cautionFpsThreshold
    // Size: 0x4
    // Offset: 0xAC
    int m_cautionFpsThreshold;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Color m_criticalFpsColor
    // Size: 0x10
    // Offset: 0xB0
    ::UnityEngine::Color m_criticalFpsColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xADD350
    // private System.Int32 m_fpsGraphResolution
    // Size: 0x4
    // Offset: 0xC0
    int m_fpsGraphResolution;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xADD394
    // private System.Int32 m_fpsTextUpdateRate
    // Size: 0x4
    // Offset: 0xC4
    int m_fpsTextUpdateRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Tayx.Graphy.GraphyManager/ModuleState m_ramModuleState
    // Size: 0x4
    // Offset: 0xC8
    ::Tayx::Graphy::GraphyManager::ModuleState m_ramModuleState;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModuleState) == 0x4);
    // private UnityEngine.Color m_allocatedRamColor
    // Size: 0x10
    // Offset: 0xCC
    ::UnityEngine::Color m_allocatedRamColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_reservedRamColor
    // Size: 0x10
    // Offset: 0xDC
    ::UnityEngine::Color m_reservedRamColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color m_monoRamColor
    // Size: 0x10
    // Offset: 0xEC
    ::UnityEngine::Color m_monoRamColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xADD418
    // private System.Int32 m_ramGraphResolution
    // Size: 0x4
    // Offset: 0xFC
    int m_ramGraphResolution;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xADD45C
    // private System.Int32 m_ramTextUpdateRate
    // Size: 0x4
    // Offset: 0x100
    int m_ramTextUpdateRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Tayx.Graphy.GraphyManager/ModuleState m_audioModuleState
    // Size: 0x4
    // Offset: 0x104
    ::Tayx::Graphy::GraphyManager::ModuleState m_audioModuleState;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModuleState) == 0x4);
    // private Tayx.Graphy.GraphyManager/LookForAudioListener m_findAudioListenerInCameraIfNull
    // Size: 0x4
    // Offset: 0x108
    ::Tayx::Graphy::GraphyManager::LookForAudioListener m_findAudioListenerInCameraIfNull;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::LookForAudioListener) == 0x4);
    // private UnityEngine.AudioListener m_audioListener
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::AudioListener* m_audioListener;
    // Field size check
    static_assert(sizeof(::UnityEngine::AudioListener*) == 0x8);
    // private UnityEngine.Color m_audioGraphColor
    // Size: 0x10
    // Offset: 0x118
    ::UnityEngine::Color m_audioGraphColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xADD4E0
    // private System.Int32 m_audioGraphResolution
    // Size: 0x4
    // Offset: 0x128
    int m_audioGraphResolution;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xADD524
    // private System.Int32 m_audioTextUpdateRate
    // Size: 0x4
    // Offset: 0x12C
    int m_audioTextUpdateRate;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.FFTWindow m_FFTWindow
    // Size: 0x4
    // Offset: 0x130
    ::UnityEngine::FFTWindow m_FFTWindow;
    // Field size check
    static_assert(sizeof(::UnityEngine::FFTWindow) == 0x4);
    // [TooltipAttribute] Offset: 0xADD578
    // private System.Int32 m_spectrumSize
    // Size: 0x4
    // Offset: 0x134
    int m_spectrumSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Tayx.Graphy.GraphyManager/ModulePosition m_advancedModulePosition
    // Size: 0x4
    // Offset: 0x138
    ::Tayx::Graphy::GraphyManager::ModulePosition m_advancedModulePosition;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModulePosition) == 0x4);
    // private Tayx.Graphy.GraphyManager/ModuleState m_advancedModuleState
    // Size: 0x4
    // Offset: 0x13C
    ::Tayx::Graphy::GraphyManager::ModuleState m_advancedModuleState;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager::ModuleState) == 0x4);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private Tayx.Graphy.Fps.FpsManager m_fpsManager
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::Fps::FpsManager*& dyn_m_fpsManager();
    // Get instance field reference: private Tayx.Graphy.Ram.RamManager m_ramManager
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::Ram::RamManager*& dyn_m_ramManager();
    // Get instance field reference: private Tayx.Graphy.Audio.AudioManager m_audioManager
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::Audio::AudioManager*& dyn_m_audioManager();
