// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Tayx::Graphy
namespace Tayx::Graphy {
  // Forward declaring type: GraphyManager
  class GraphyManager;
}
// Forward declaring namespace: Tayx::Graphy::Ram
namespace Tayx::Graphy::Ram {
  // Forward declaring type: RamMonitor
  class RamMonitor;
}
// Forward declaring namespace: UnityEngine::UI
namespace UnityEngine::UI {
  // Forward declaring type: Text
  class Text;
}
// Completed forward declares
// Type namespace: Tayx.Graphy.Ram
namespace Tayx::Graphy::Ram {
  // Forward declaring type: RamText
  class RamText;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Tayx::Graphy::Ram::RamText);
DEFINE_IL2CPP_ARG_TYPE(::Tayx::Graphy::Ram::RamText*, "Tayx.Graphy.Ram", "RamText");
// Type namespace: Tayx.Graphy.Ram
namespace Tayx::Graphy::Ram {
  // Size: 0x50
  #pragma pack(push, 1)
  // Autogenerated type: Tayx.Graphy.Ram.RamText
  // [TokenAttribute] Offset: FFFFFFFF
  class RamText : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private Tayx.Graphy.GraphyManager m_graphyManager
    // Size: 0x8
    // Offset: 0x18
    ::Tayx::Graphy::GraphyManager* m_graphyManager;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::GraphyManager*) == 0x8);
    // private Tayx.Graphy.Ram.RamMonitor m_ramMonitor
    // Size: 0x8
    // Offset: 0x20
    ::Tayx::Graphy::Ram::RamMonitor* m_ramMonitor;
    // Field size check
    static_assert(sizeof(::Tayx::Graphy::Ram::RamMonitor*) == 0x8);
    // private UnityEngine.UI.Text m_allocatedSystemMemorySizeText
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::UI::Text* m_allocatedSystemMemorySizeText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text m_reservedSystemMemorySizeText
    // Size: 0x8
    // Offset: 0x30
    ::UnityEngine::UI::Text* m_reservedSystemMemorySizeText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private UnityEngine.UI.Text m_monoSystemMemorySizeText
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::UI::Text* m_monoSystemMemorySizeText;
    // Field size check
    static_assert(sizeof(::UnityEngine::UI::Text*) == 0x8);
    // private System.Single m_updateRate
    // Size: 0x4
    // Offset: 0x40
    float m_updateRate;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_deltaTime
    // Size: 0x4
    // Offset: 0x44
    float m_deltaTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private readonly System.String m_memoryStringFormat
    // Size: 0x8
    // Offset: 0x48
    ::StringW m_memoryStringFormat;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get instance field reference: private Tayx.Graphy.GraphyManager m_graphyManager
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::GraphyManager*& dyn_m_graphyManager();
    // Get instance field reference: private Tayx.Graphy.Ram.RamMonitor m_ramMonitor
    [[deprecated("Use field access instead!")]] ::Tayx::Graphy::Ram::RamMonitor*& dyn_m_ramMonitor();
    // Get instance field reference: private UnityEngine.UI.Text m_allocatedSystemMemorySizeText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_m_allocatedSystemMemorySizeText();
    // Get instance field reference: private UnityEngine.UI.Text m_reservedSystemMemorySizeText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_m_reservedSystemMemorySizeText();
    // Get instance field reference: private UnityEngine.UI.Text m_monoSystemMemorySizeText
    [[deprecated("Use field access instead!")]] ::UnityEngine::UI::Text*& dyn_m_monoSystemMemorySizeText();
    // Get instance field reference: private System.Single m_updateRate
    [[deprecated("Use field access instead!")]] float& dyn_m_updateRate();
    // Get instance field reference: private System.Single m_deltaTime
    [[deprecated("Use field access instead!")]] float& dyn_m_deltaTime();
    // Get instance field reference: private readonly System.String m_memoryStringFormat
    [[deprecated("Use field access instead!")]] ::StringW& dyn_m_memoryStringFormat();
    // private System.Void Awake()
    // Offset: 0x104A3E4
    void Awake();
    // private System.Void Update()
    // Offset: 0x104A53C
    void Update();
    // public System.Void UpdateParameters()
    // Offset: 0x104A1A8
    void UpdateParameters();
    // private System.Void Init()
    // Offset: 0x104A3E8
    void Init();
    // public System.Void .ctor()
    // Offset: 0x104A6BC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static RamText* New_ctor() {
      static auto ___internal__logger = ::Logger::get().WithContext("::Tayx::Graphy::Ram::RamText::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<RamText*, creationType>()));
    }
  }; // Tayx.Graphy.Ram.RamText
  #pragma pack(pop)
  static check_size<sizeof(RamText), 72 + sizeof(::StringW)> __Tayx_Graphy_Ram_RamTextSizeCheck;
  static_assert(sizeof(RamText) == 0x50);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Tayx::Graphy::Ram::RamText::Awake
// Il2CppName: Awake
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Ram::RamText::*)()>(&Tayx::Graphy::Ram::RamText::Awake)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Ram::RamText*), "Awake", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Ram::RamText::Update
// Il2CppName: Update
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Ram::RamText::*)()>(&Tayx::Graphy::Ram::RamText::Update)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Ram::RamText*), "Update", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Ram::RamText::UpdateParameters
// Il2CppName: UpdateParameters
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Ram::RamText::*)()>(&Tayx::Graphy::Ram::RamText::UpdateParameters)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Ram::RamText*), "UpdateParameters", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Ram::RamText::Init
// Il2CppName: Init
template<>
struct ::il2cpp_utils::il2cpp_type_check::MetadataGetter<static_cast<void (Tayx::Graphy::Ram::RamText::*)()>(&Tayx::Graphy::Ram::RamText::Init)> {
  static const MethodInfo* get() {
    return ::il2cpp_utils::FindMethod(classof(Tayx::Graphy::Ram::RamText*), "Init", std::vector<Il2CppClass*>(), ::std::vector<const Il2CppType*>{});
  }
};
// Writing MetadataGetter for method: Tayx::Graphy::Ram::RamText::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
