// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Funly::SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: ProfileFeatureDefinition
  class ProfileFeatureDefinition;
}
// Completed forward declares
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: ProfileFeatureSection
  class ProfileFeatureSection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Funly::SkyStudio::ProfileFeatureSection);
DEFINE_IL2CPP_ARG_TYPE(::Funly::SkyStudio::ProfileFeatureSection*, "Funly.SkyStudio", "ProfileFeatureSection");
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Size: 0x30
  #pragma pack(push, 1)
  // Autogenerated type: Funly.SkyStudio.ProfileFeatureSection
  // [TokenAttribute] Offset: FFFFFFFF
  class ProfileFeatureSection : public ::Il2CppObject {
    public:
    public:
    // public System.String sectionTitle
    // Size: 0x8
    // Offset: 0x10
    ::StringW sectionTitle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String sectionKey
    // Size: 0x8
    // Offset: 0x18
    ::StringW sectionKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String sectionIcon
    // Size: 0x8
    // Offset: 0x20
    ::StringW sectionIcon;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Funly.SkyStudio.ProfileFeatureDefinition[] featureDefinitions
    // Size: 0x8
    // Offset: 0x28
    ::ArrayW<::Funly::SkyStudio::ProfileFeatureDefinition*> featureDefinitions;
    // Field size check
    static_assert(sizeof(::ArrayW<::Funly::SkyStudio::ProfileFeatureDefinition*>) == 0x8);
    public:
    // Get instance field reference: public System.String sectionTitle
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sectionTitle();
    // Get instance field reference: public System.String sectionKey
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sectionKey();
    // Get instance field reference: public System.String sectionIcon
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sectionIcon();
    // Get instance field reference: public Funly.SkyStudio.ProfileFeatureDefinition[] featureDefinitions
    [[deprecated("Use field access instead!")]] ::ArrayW<::Funly::SkyStudio::ProfileFeatureDefinition*>& dyn_featureDefinitions();
    // public System.Void .ctor(System.String sectionTitle, System.String sectionKey, Funly.SkyStudio.ProfileFeatureDefinition[] featureDefinitions)
    // Offset: 0x1513D00
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ProfileFeatureSection* New_ctor(::StringW sectionTitle, ::StringW sectionKey, ::ArrayW<::Funly::SkyStudio::ProfileFeatureDefinition*> featureDefinitions) {
      static auto ___internal__logger = ::Logger::get().WithContext("::Funly::SkyStudio::ProfileFeatureSection::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ProfileFeatureSection*, creationType>(sectionTitle, sectionKey, featureDefinitions)));
    }
  }; // Funly.SkyStudio.ProfileFeatureSection
  #pragma pack(pop)
  static check_size<sizeof(ProfileFeatureSection), 40 + sizeof(::ArrayW<::Funly::SkyStudio::ProfileFeatureDefinition*>)> __Funly_SkyStudio_ProfileFeatureSectionSizeCheck;
  static_assert(sizeof(ProfileFeatureSection) == 0x30);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Funly::SkyStudio::ProfileFeatureSection::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
