// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Funly::SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: ProfileGroupDefinition
  class ProfileGroupDefinition;
}
// Completed forward declares
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: ProfileGroupSection
  class ProfileGroupSection;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Funly::SkyStudio::ProfileGroupSection);
DEFINE_IL2CPP_ARG_TYPE(::Funly::SkyStudio::ProfileGroupSection*, "Funly.SkyStudio", "ProfileGroupSection");
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Size: 0x40
  #pragma pack(push, 1)
  // Autogenerated type: Funly.SkyStudio.ProfileGroupSection
  // [TokenAttribute] Offset: FFFFFFFF
  class ProfileGroupSection : public ::Il2CppObject {
    public:
    public:
    // public System.String sectionTitle
    // Size: 0x8
    // Offset: 0x10
    ::StringW sectionTitle;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String sectionIcon
    // Size: 0x8
    // Offset: 0x18
    ::StringW sectionIcon;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String sectionKey
    // Size: 0x8
    // Offset: 0x20
    ::StringW sectionKey;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.String dependsOnFeature
    // Size: 0x8
    // Offset: 0x28
    ::StringW dependsOnFeature;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public System.Boolean dependsOnValue
    // Size: 0x1
    // Offset: 0x30
    bool dependsOnValue;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: dependsOnValue and: groups
    char __padding4[0x7] = {};
    // public Funly.SkyStudio.ProfileGroupDefinition[] groups
    // Size: 0x8
    // Offset: 0x38
    ::ArrayW<::Funly::SkyStudio::ProfileGroupDefinition*> groups;
    // Field size check
    static_assert(sizeof(::ArrayW<::Funly::SkyStudio::ProfileGroupDefinition*>) == 0x8);
    public:
    // Get instance field reference: public System.String sectionTitle
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sectionTitle();
    // Get instance field reference: public System.String sectionIcon
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sectionIcon();
    // Get instance field reference: public System.String sectionKey
    [[deprecated("Use field access instead!")]] ::StringW& dyn_sectionKey();
    // Get instance field reference: public System.String dependsOnFeature
    [[deprecated("Use field access instead!")]] ::StringW& dyn_dependsOnFeature();
    // Get instance field reference: public System.Boolean dependsOnValue
    [[deprecated("Use field access instead!")]] bool& dyn_dependsOnValue();
    // Get instance field reference: public Funly.SkyStudio.ProfileGroupDefinition[] groups
    [[deprecated("Use field access instead!")]] ::ArrayW<::Funly::SkyStudio::ProfileGroupDefinition*>& dyn_groups();
    // public System.Void .ctor(System.String sectionTitle, System.String sectionKey, System.String sectionIcon, System.String dependsOnFeature, System.Boolean dependsOnValue, Funly.SkyStudio.ProfileGroupDefinition[] groups)
    // Offset: 0x15144DC
    template<::il2cpp_utils::CreationType creationType = ::il2cpp_utils::CreationType::Temporary>
    static ProfileGroupSection* New_ctor(::StringW sectionTitle, ::StringW sectionKey, ::StringW sectionIcon, ::StringW dependsOnFeature, bool dependsOnValue, ::ArrayW<::Funly::SkyStudio::ProfileGroupDefinition*> groups) {
      static auto ___internal__logger = ::Logger::get().WithContext("::Funly::SkyStudio::ProfileGroupSection::.ctor");
      return THROW_UNLESS((::il2cpp_utils::New<ProfileGroupSection*, creationType>(sectionTitle, sectionKey, sectionIcon, dependsOnFeature, dependsOnValue, groups)));
    }
  }; // Funly.SkyStudio.ProfileGroupSection
  #pragma pack(pop)
  static check_size<sizeof(ProfileGroupSection), 56 + sizeof(::ArrayW<::Funly::SkyStudio::ProfileGroupDefinition*>)> __Funly_SkyStudio_ProfileGroupSectionSizeCheck;
  static_assert(sizeof(ProfileGroupSection) == 0x40);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
// Writing MetadataGetter for method: Funly::SkyStudio::ProfileGroupSection::New_ctor
// Il2CppName: .ctor
// Cannot get method pointer of value based method overload from template for constructor!
// Try using FindMethod instead!
