// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Cubemap
  class Cubemap;
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Vector2
  struct Vector2;
}
// Completed forward declares
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: SkyMaterialController
  class SkyMaterialController;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Funly::SkyStudio::SkyMaterialController);
DEFINE_IL2CPP_ARG_TYPE(::Funly::SkyStudio::SkyMaterialController*, "Funly.SkyStudio", "SkyMaterialController");
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Size: 0x270
  #pragma pack(push, 1)
  // Autogenerated type: Funly.SkyStudio.SkyMaterialController
  // [TokenAttribute] Offset: FFFFFFFF
  class SkyMaterialController : public ::Il2CppObject {
    public:
    public:
    // private UnityEngine.Material _skyboxMaterial
    // Size: 0x8
    // Offset: 0x10
    ::UnityEngine::Material* skyboxMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Color _skyColor
    // Size: 0x10
    // Offset: 0x18
    ::UnityEngine::Color skyColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _skyMiddleColor
    // Size: 0x10
    // Offset: 0x28
    ::UnityEngine::Color skyMiddleColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _horizonColor
    // Size: 0x10
    // Offset: 0x38
    ::UnityEngine::Color horizonColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xAE1A74
    // private System.Single _gradientFadeBegin
    // Size: 0x4
    // Offset: 0x48
    float gradientFadeBegin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1AB4
    // private System.Single _gradientFadeLength
    // Size: 0x4
    // Offset: 0x4C
    float gradientFadeLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1AF4
    // private System.Single _skyMiddlePosition
    // Size: 0x4
    // Offset: 0x50
    float skyMiddlePosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: skyMiddlePosition and: backgroundCubemap
    char __padding6[0x4] = {};
    // private UnityEngine.Cubemap _backgroundCubemap
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Cubemap* backgroundCubemap;
    // Field size check
    static_assert(sizeof(::UnityEngine::Cubemap*) == 0x8);
    // [RangeAttribute] Offset: 0xAE1B44
    // private System.Single _starFadeBegin
    // Size: 0x4
    // Offset: 0x60
    float starFadeBegin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1B84
    // private System.Single _starFadeLength
    // Size: 0x4
    // Offset: 0x64
    float starFadeLength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1BC4
    // private System.Single _horizonDistanceScale
    // Size: 0x4
    // Offset: 0x68
    float horizonDistanceScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: horizonDistanceScale and: starLayer1Texture
    char __padding10[0x4] = {};
    // private UnityEngine.Texture _starLayer1Texture
    // Size: 0x8
    // Offset: 0x70
    ::UnityEngine::Texture* starLayer1Texture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private UnityEngine.Texture2D _starLayer1DataTexture
    // Size: 0x8
    // Offset: 0x78
    ::UnityEngine::Texture2D* starLayer1DataTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Color _starLayer1Color
    // Size: 0x10
    // Offset: 0x80
    ::UnityEngine::Color starLayer1Color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xAE1C34
    // private System.Single _starLayer1MaxRadius
    // Size: 0x4
    // Offset: 0x90
    float starLayer1MaxRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1C78
    // private System.Single _starLayer1TwinkleAmount
    // Size: 0x4
    // Offset: 0x94
    float starLayer1TwinkleAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1CB8
    // private System.Single _starLayer1TwinkleSpeed
    // Size: 0x4
    // Offset: 0x98
    float starLayer1TwinkleSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1CF8
    // private System.Single _starLayer1RotationSpeed
    // Size: 0x4
    // Offset: 0x9C
    float starLayer1RotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1D38
    // private System.Single _starLayer1EdgeFeathering
    // Size: 0x4
    // Offset: 0xA0
    float starLayer1EdgeFeathering;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1D80
    // private System.Single _starLayer1BloomFilterBoost
    // Size: 0x4
    // Offset: 0xA4
    float starLayer1BloomFilterBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 _starLayer1SpriteDimensions
    // Size: 0x10
    // Offset: 0xA8
    ::UnityEngine::Vector4 starLayer1SpriteDimensions;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Int32 _starLayer1SpriteItemCount
    // Size: 0x4
    // Offset: 0xB8
    int starLayer1SpriteItemCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xAE1DE0
    // private System.Single _starLayer1SpriteAnimationSpeed
    // Size: 0x4
    // Offset: 0xBC
    float starLayer1SpriteAnimationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Texture _starLayer2Texture
    // Size: 0x8
    // Offset: 0xC0
    ::UnityEngine::Texture* starLayer2Texture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private UnityEngine.Texture2D _starLayer2DataTexture
    // Size: 0x8
    // Offset: 0xC8
    ::UnityEngine::Texture2D* starLayer2DataTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Color _starLayer2Color
    // Size: 0x10
    // Offset: 0xD0
    ::UnityEngine::Color starLayer2Color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xAE1E50
    // private System.Single _starLayer2MaxRadius
    // Size: 0x4
    // Offset: 0xE0
    float starLayer2MaxRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1E94
    // private System.Single _starLayer2TwinkleAmount
    // Size: 0x4
    // Offset: 0xE4
    float starLayer2TwinkleAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1ED4
    // private System.Single _starLayer2TwinkleSpeed
    // Size: 0x4
    // Offset: 0xE8
    float starLayer2TwinkleSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1F14
    // private System.Single _starLayer2RotationSpeed
    // Size: 0x4
    // Offset: 0xEC
    float starLayer2RotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1F54
    // private System.Single _starLayer2EdgeFeathering
    // Size: 0x4
    // Offset: 0xF0
    float starLayer2EdgeFeathering;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE1F9C
    // private System.Single _starLayer2BloomFilterBoost
    // Size: 0x4
    // Offset: 0xF4
    float starLayer2BloomFilterBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 _starLayer2SpriteDimensions
    // Size: 0x10
    // Offset: 0xF8
    ::UnityEngine::Vector4 starLayer2SpriteDimensions;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Int32 _starLayer2SpriteItemCount
    // Size: 0x4
    // Offset: 0x108
    int starLayer2SpriteItemCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xAE1FFC
    // private System.Single _starLayer2SpriteAnimationSpeed
    // Size: 0x4
    // Offset: 0x10C
    float starLayer2SpriteAnimationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Texture _starLayer3Texture
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Texture* starLayer3Texture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private UnityEngine.Texture2D _starLayer3DataTexture
    // Size: 0x8
    // Offset: 0x118
    ::UnityEngine::Texture2D* starLayer3DataTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Color _starLayer3Color
    // Size: 0x10
    // Offset: 0x120
    ::UnityEngine::Color starLayer3Color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // [RangeAttribute] Offset: 0xAE206C
    // private System.Single _starLayer3MaxRadius
    // Size: 0x4
    // Offset: 0x130
    float starLayer3MaxRadius;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE20B0
    // private System.Single _starLayer3TwinkleAmount
    // Size: 0x4
    // Offset: 0x134
    float starLayer3TwinkleAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE20F0
    // private System.Single _starLayer3TwinkleSpeed
    // Size: 0x4
    // Offset: 0x138
    float starLayer3TwinkleSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE2130
    // private System.Single _starLayer3RotationSpeed
    // Size: 0x4
    // Offset: 0x13C
    float starLayer3RotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE2170
    // private System.Single _starLayer3EdgeFeathering
    // Size: 0x4
    // Offset: 0x140
    float starLayer3EdgeFeathering;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE21B8
    // private System.Single _starLayer3BloomFilterBoost
    // Size: 0x4
    // Offset: 0x144
    float starLayer3BloomFilterBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 _starLayer3SpriteDimensions
    // Size: 0x10
    // Offset: 0x148
    ::UnityEngine::Vector4 starLayer3SpriteDimensions;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Int32 _starLayer3SpriteItemCount
    // Size: 0x4
    // Offset: 0x158
    int starLayer3SpriteItemCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xAE2218
    // private System.Single _starLayer3SpriteAnimationSpeed
    // Size: 0x4
    // Offset: 0x15C
    float starLayer3SpriteAnimationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Texture _moonTexture
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::Texture* moonTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Single _moonRotationSpeed
    // Size: 0x4
    // Offset: 0x168
    float moonRotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _moonColor
    // Size: 0x10
    // Offset: 0x16C
    ::UnityEngine::Color moonColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Vector3 _moonDirection
    // Size: 0xC
    // Offset: 0x17C
    ::UnityEngine::Vector3 moonDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RangeAttribute] Offset: 0xAE2298
    // private System.Single _moonSize
    // Size: 0x4
    // Offset: 0x188
    float moonSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE22D8
    // private System.Single _moonEdgeFeathering
    // Size: 0x4
    // Offset: 0x18C
    float moonEdgeFeathering;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE2320
    // private System.Single _moonBloomFilterBoost
    // Size: 0x4
    // Offset: 0x190
    float moonBloomFilterBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 _moonSpriteDimensions
    // Size: 0x10
    // Offset: 0x194
    ::UnityEngine::Vector4 moonSpriteDimensions;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Int32 _moonSpriteItemCount
    // Size: 0x4
    // Offset: 0x1A4
    int moonSpriteItemCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xAE2380
    // private System.Single _moonSpriteAnimationSpeed
    // Size: 0x4
    // Offset: 0x1A8
    float moonSpriteAnimationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: moonSpriteAnimationSpeed and: sunTexture
    char __padding56[0x4] = {};
    // private UnityEngine.Texture _sunTexture
    // Size: 0x8
    // Offset: 0x1B0
    ::UnityEngine::Texture* sunTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private UnityEngine.Color _sunColor
    // Size: 0x10
    // Offset: 0x1B8
    ::UnityEngine::Color sunColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single _sunRotationSpeed
    // Size: 0x4
    // Offset: 0x1C8
    float sunRotationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector3 _sunDirection
    // Size: 0xC
    // Offset: 0x1CC
    ::UnityEngine::Vector3 sunDirection;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // [RangeAttribute] Offset: 0xAE2400
    // private System.Single _sunSize
    // Size: 0x4
    // Offset: 0x1D8
    float sunSize;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE2440
    // private System.Single _sunEdgeFeathering
    // Size: 0x4
    // Offset: 0x1DC
    float sunEdgeFeathering;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE2488
    // private System.Single _sunBloomFilterBoost
    // Size: 0x4
    // Offset: 0x1E0
    float sunBloomFilterBoost;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 _sunSpriteDimensions
    // Size: 0x10
    // Offset: 0x1E4
    ::UnityEngine::Vector4 sunSpriteDimensions;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Int32 _sunSpriteItemCount
    // Size: 0x4
    // Offset: 0x1F4
    int sunSpriteItemCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [RangeAttribute] Offset: 0xAE24E8
    // private System.Single _sunSpriteAnimationSpeed
    // Size: 0x4
    // Offset: 0x1F8
    float sunSpriteAnimationSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [RangeAttribute] Offset: 0xAE2528
    // private System.Single _cloudBegin
    // Size: 0x4
    // Offset: 0x1FC
    float cloudBegin;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _cloudTextureTiling
    // Size: 0x4
    // Offset: 0x200
    float cloudTextureTiling;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _cloudColor
    // Size: 0x10
    // Offset: 0x204
    ::UnityEngine::Color cloudColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: cloudColor and: cloudTexture
    char __padding69[0x4] = {};
    // private UnityEngine.Texture _cloudTexture
    // Size: 0x8
    // Offset: 0x218
    ::UnityEngine::Texture* cloudTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Single _cloudDensity
    // Size: 0x4
    // Offset: 0x220
    float cloudDensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _cloudSpeed
    // Size: 0x4
    // Offset: 0x224
    float cloudSpeed;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _cloudDirection
    // Size: 0x4
    // Offset: 0x228
    float cloudDirection;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _cloudHeight
    // Size: 0x4
    // Offset: 0x22C
    float cloudHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _cloudColor1
    // Size: 0x10
    // Offset: 0x230
    ::UnityEngine::Color cloudColor1;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Color _cloudColor2
    // Size: 0x10
    // Offset: 0x240
    ::UnityEngine::Color cloudColor2;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single _cloudFadePosition
    // Size: 0x4
    // Offset: 0x250
    float cloudFadePosition;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _cloudFadeAmount
    // Size: 0x4
    // Offset: 0x254
    float cloudFadeAmount;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Color _fogColor
    // Size: 0x10
    // Offset: 0x258
    ::UnityEngine::Color fogColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single _fogDensity
    // Size: 0x4
    // Offset: 0x268
    float fogDensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single _fogHeight
    // Size: 0x4
    // Offset: 0x26C
    float fogHeight;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    public:
    // Get instance field reference: private UnityEngine.Material _skyboxMaterial
    [[deprecated("Use field access instead!")]] ::UnityEngine::Material*& dyn__skyboxMaterial();
    // Get instance field reference: private UnityEngine.Color _skyColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__skyColor();
    // Get instance field reference: private UnityEngine.Color _skyMiddleColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__skyMiddleColor();
    // Get instance field reference: private UnityEngine.Color _horizonColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__horizonColor();
    // Get instance field reference: private System.Single _gradientFadeBegin
    [[deprecated("Use field access instead!")]] float& dyn__gradientFadeBegin();
