// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.ScriptableObject
#include "UnityEngine/ScriptableObject.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: Color
  struct Color;
  // Forward declaring type: Texture
  class Texture;
}
// Forward declaring namespace: Funly::SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: IProfileDefinition
  class IProfileDefinition;
  // Forward declaring type: KeyframeGroupDictionary
  class KeyframeGroupDictionary;
  // Forward declaring type: BoolDictionary
  class BoolDictionary;
  // Forward declaring type: LightningArtSet
  class LightningArtSet;
  // Forward declaring type: RainSplashArtSet
  class RainSplashArtSet;
  // Forward declaring type: ProfileGroupDefinition
  class ProfileGroupDefinition;
  // Forward declaring type: ProfileGroupSection
  class ProfileGroupSection;
  // Forward declaring type: ProfileFeatureSection
  class ProfileFeatureSection;
  // Forward declaring type: SpherePoint
  class SpherePoint;
  // Forward declaring type: IKeyframeGroup
  class IKeyframeGroup;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Completed forward declares
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Forward declaring type: SkyProfile
  class SkyProfile;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Funly::SkyStudio::SkyProfile);
DEFINE_IL2CPP_ARG_TYPE(::Funly::SkyStudio::SkyProfile*, "Funly.SkyStudio", "SkyProfile");
// Type namespace: Funly.SkyStudio
namespace Funly::SkyStudio {
  // Size: 0x80
  #pragma pack(push, 1)
  // Autogenerated type: Funly.SkyStudio.SkyProfile
  // [TokenAttribute] Offset: FFFFFFFF
  // [CreateAssetMenuAttribute] Offset: AD25F0
  class SkyProfile : public ::UnityEngine::ScriptableObject {
    public:
    public:
    // private UnityEngine.Material m_SkyboxMaterial
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Material* m_SkyboxMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private System.String m_ShaderName
    // Size: 0x8
    // Offset: 0x20
    ::StringW m_ShaderName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // public Funly.SkyStudio.IProfileDefinition profileDefinition
    // Size: 0x8
    // Offset: 0x28
    ::Funly::SkyStudio::IProfileDefinition* profileDefinition;
    // Field size check
    static_assert(sizeof(::Funly::SkyStudio::IProfileDefinition*) == 0x8);
    // public System.Collections.Generic.List`1<System.String> timelineManagedKeys
    // Size: 0x8
    // Offset: 0x30
    ::System::Collections::Generic::List_1<::StringW>* timelineManagedKeys;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::StringW>*) == 0x8);
    // public Funly.SkyStudio.KeyframeGroupDictionary keyframeGroups
    // Size: 0x8
    // Offset: 0x38
    ::Funly::SkyStudio::KeyframeGroupDictionary* keyframeGroups;
    // Field size check
    static_assert(sizeof(::Funly::SkyStudio::KeyframeGroupDictionary*) == 0x8);
    // public Funly.SkyStudio.BoolDictionary featureStatus
    // Size: 0x8
    // Offset: 0x40
    ::Funly::SkyStudio::BoolDictionary* featureStatus;
    // Field size check
    static_assert(sizeof(::Funly::SkyStudio::BoolDictionary*) == 0x8);
    // public Funly.SkyStudio.LightningArtSet lightningArtSet
    // Size: 0x8
    // Offset: 0x48
    ::Funly::SkyStudio::LightningArtSet* lightningArtSet;
    // Field size check
    static_assert(sizeof(::Funly::SkyStudio::LightningArtSet*) == 0x8);
    // public Funly.SkyStudio.RainSplashArtSet rainSplashArtSet
    // Size: 0x8
    // Offset: 0x50
    ::Funly::SkyStudio::RainSplashArtSet* rainSplashArtSet;
    // Field size check
    static_assert(sizeof(::Funly::SkyStudio::RainSplashArtSet*) == 0x8);
    // public UnityEngine.Texture2D starLayer1DataTexture
    // Size: 0x8
    // Offset: 0x58
    ::UnityEngine::Texture2D* starLayer1DataTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public UnityEngine.Texture2D starLayer2DataTexture
    // Size: 0x8
    // Offset: 0x60
    ::UnityEngine::Texture2D* starLayer2DataTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // public UnityEngine.Texture2D starLayer3DataTexture
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Texture2D* starLayer3DataTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private System.Int32 m_ProfileVersion
    // Size: 0x4
    // Offset: 0x70
    int m_ProfileVersion;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_ProfileVersion and: m_KeyToGroupInfo
    char __padding11[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,Funly.SkyStudio.ProfileGroupDefinition> m_KeyToGroupInfo
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::Dictionary_2<::StringW, ::Funly::SkyStudio::ProfileGroupDefinition*>* m_KeyToGroupInfo;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::Funly::SkyStudio::ProfileGroupDefinition*>*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String DefaultShaderName
    static constexpr const char* DefaultShaderName = "Funly/Sky Studio/Skybox/3D Standard";
    // Get static field: static public System.String DefaultShaderName
    static ::StringW _get_DefaultShaderName();
    // Set static field: static public System.String DefaultShaderName
    static void _set_DefaultShaderName(::StringW value);
    // Get instance field reference: private UnityEngine.Material m_SkyboxMaterial
