// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include <initializer_list>
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.DateTime
#include "System/DateTime.hpp"
// Including type: Pathfinding.Ionic.Zlib.CompressionLevel
#include "Pathfinding/Ionic/Zlib/CompressionLevel.hpp"
// Including type: Pathfinding.Ionic.Zip.ZipEntrySource
#include "Pathfinding/Ionic/Zip/ZipEntrySource.hpp"
// Including type: Pathfinding.Ionic.Zip.EncryptionAlgorithm
#include "Pathfinding/Ionic/Zip/EncryptionAlgorithm.hpp"
// Including type: System.Nullable`1
#include "System/Nullable_1.hpp"
// Including type: Pathfinding.Ionic.Zip.ZipEntryTimestamp
#include "Pathfinding/Ionic/Zip/ZipEntryTimestamp.hpp"
// Including type: Pathfinding.Ionic.Zip.ExtractExistingFileAction
#include "Pathfinding/Ionic/Zip/ExtractExistingFileAction.hpp"
// Including type: Pathfinding.Ionic.Zip.ZipErrorAction
#include "Pathfinding/Ionic/Zip/ZipErrorAction.hpp"
// Including type: Pathfinding.Ionic.Zip.ZipOption
#include "Pathfinding/Ionic/Zip/ZipOption.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::Ionic::Zip
namespace Pathfinding::Ionic::Zip {
  // Forward declaring type: ZipCrypto
  class ZipCrypto;
  // Forward declaring type: ZipContainer
  class ZipContainer;
  // Forward declaring type: WriteDelegate
  class WriteDelegate;
  // Forward declaring type: OpenDelegate
  class OpenDelegate;
  // Forward declaring type: CloseDelegate
  class CloseDelegate;
  // Forward declaring type: SetCompressionCallback
  class SetCompressionCallback;
  // Forward declaring type: ZipFile
  class ZipFile;
  // Forward declaring type: CountingStream
  class CountingStream;
  // Forward declaring type: CompressionMethod
  struct CompressionMethod;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: Stream
  class Stream;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: Pathfinding::Ionic::Crc
namespace Pathfinding::Ionic::Crc {
  // Forward declaring type: CrcCalculatorStream
  class CrcCalculatorStream;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Exception
  class Exception;
}
// Completed forward declares
// Type namespace: Pathfinding.Ionic.Zip
namespace Pathfinding::Ionic::Zip {
  // Forward declaring type: ZipEntry
  class ZipEntry;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Ionic::Zip::ZipEntry);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Ionic::Zip::ZipEntry*, "Pathfinding.Ionic.Zip", "ZipEntry");
// Type namespace: Pathfinding.Ionic.Zip
namespace Pathfinding::Ionic::Zip {
  // WARNING Size may be invalid!
  // Autogenerated type: Pathfinding.Ionic.Zip.ZipEntry
  // [TokenAttribute] Offset: FFFFFFFF
  // [GuidAttribute] Offset: ABBCDC
  // [ComVisibleAttribute] Offset: ABBCDC
  // [ClassInterfaceAttribute] Offset: ABBCDC
  class ZipEntry : public ::Il2CppObject {
    public:
    // Nested type: ::Pathfinding::Ionic::Zip::ZipEntry::CopyHelper
    class CopyHelper;
    public:
    // private System.Int16 _VersionMadeBy
    // Size: 0x2
    // Offset: 0x10
    int16_t VersionMadeBy;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.Int16 _InternalFileAttrs
    // Size: 0x2
    // Offset: 0x12
    int16_t InternalFileAttrs;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.Int32 _ExternalFileAttrs
    // Size: 0x4
    // Offset: 0x14
    int ExternalFileAttrs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int16 _filenameLength
    // Size: 0x2
    // Offset: 0x18
    int16_t filenameLength;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.Int16 _extraFieldLength
    // Size: 0x2
    // Offset: 0x1A
    int16_t extraFieldLength;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.Int16 _commentLength
    // Size: 0x2
    // Offset: 0x1C
    int16_t commentLength;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.IO.Stream _inputDecryptorStream
    // Size: 0x8
    // Offset: 0x20
    ::System::IO::Stream* inputDecryptorStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Object _outputLock
    // Size: 0x8
    // Offset: 0x28
    ::Il2CppObject* outputLock;
    // Field size check
    static_assert(sizeof(::Il2CppObject*) == 0x8);
    // private Pathfinding.Ionic.Zip.ZipCrypto _zipCrypto_forExtract
    // Size: 0x8
    // Offset: 0x30
    ::Pathfinding::Ionic::Zip::ZipCrypto* zipCrypto_forExtract;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipCrypto*) == 0x8);
    // private Pathfinding.Ionic.Zip.ZipCrypto _zipCrypto_forWrite
    // Size: 0x8
    // Offset: 0x38
    ::Pathfinding::Ionic::Zip::ZipCrypto* zipCrypto_forWrite;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipCrypto*) == 0x8);
    // System.DateTime _LastModified
    // Size: 0x8
    // Offset: 0x40
    ::System::DateTime LastModified;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.DateTime _Mtime
    // Size: 0x8
    // Offset: 0x48
    ::System::DateTime Mtime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.DateTime _Atime
    // Size: 0x8
    // Offset: 0x50
    ::System::DateTime Atime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.DateTime _Ctime
    // Size: 0x8
    // Offset: 0x58
    ::System::DateTime Ctime;
    // Field size check
    static_assert(sizeof(::System::DateTime) == 0x8);
    // private System.Boolean _ntfsTimesAreSet
    // Size: 0x1
    // Offset: 0x60
    bool ntfsTimesAreSet;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _emitNtfsTimes
    // Size: 0x1
    // Offset: 0x61
    bool emitNtfsTimes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _emitUnixTimes
    // Size: 0x1
    // Offset: 0x62
    bool emitUnixTimes;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _TrimVolumeFromFullyQualifiedPaths
    // Size: 0x1
    // Offset: 0x63
    bool TrimVolumeFromFullyQualifiedPaths;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.String _LocalFileName
    // Size: 0x8
    // Offset: 0x68
    ::StringW LocalFileName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _FileNameInArchive
    // Size: 0x8
    // Offset: 0x70
    ::StringW FileNameInArchive;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Int16 _VersionNeeded
    // Size: 0x2
    // Offset: 0x78
    int16_t VersionNeeded;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // System.Int16 _BitField
    // Size: 0x2
    // Offset: 0x7A
    int16_t BitField;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // System.Int16 _CompressionMethod
    // Size: 0x2
    // Offset: 0x7C
    int16_t CompressionMethod;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private System.Int16 _CompressionMethod_FromZipFile
    // Size: 0x2
    // Offset: 0x7E
    int16_t CompressionMethod_FromZipFile;
    // Field size check
    static_assert(sizeof(int16_t) == 0x2);
    // private Pathfinding.Ionic.Zlib.CompressionLevel _CompressionLevel
    // Size: 0x4
    // Offset: 0x80
    ::Pathfinding::Ionic::Zlib::CompressionLevel CompressionLevel;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zlib::CompressionLevel) == 0x4);
    // System.String _Comment
    // Size: 0x8
    // Offset: 0x88
    ::StringW Comment;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.Boolean _IsDirectory
    // Size: 0x1
    // Offset: 0x90
    bool IsDirectory;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Byte[] _CommentBytes
    // Size: 0x8
    // Offset: 0x98
    ::ArrayW<uint8_t> CommentBytes;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Int64 _CompressedSize
    // Size: 0x8
    // Offset: 0xA0
    int64_t CompressedSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Int64 _CompressedFileDataSize
    // Size: 0x8
    // Offset: 0xA8
    int64_t CompressedFileDataSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Int64 _UncompressedSize
    // Size: 0x8
    // Offset: 0xB0
    int64_t UncompressedSize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // System.Int32 _TimeBlob
    // Size: 0x4
    // Offset: 0xB8
    int TimeBlob;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean _crcCalculated
    // Size: 0x1
    // Offset: 0xBC
    bool crcCalculated;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // System.Int32 _Crc32
    // Size: 0x4
    // Offset: 0xC0
    int Crc32;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Byte[] _Extra
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<uint8_t> Extra;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // private System.Boolean _metadataChanged
    // Size: 0x1
    // Offset: 0xD0
    bool metadataChanged;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _restreamRequiredOnSave
    // Size: 0x1
    // Offset: 0xD1
    bool restreamRequiredOnSave;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _sourceIsEncrypted
    // Size: 0x1
    // Offset: 0xD2
    bool sourceIsEncrypted;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _skippedDuringSave
    // Size: 0x1
    // Offset: 0xD3
    bool skippedDuringSave;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.UInt32 _diskNumber
    // Size: 0x4
    // Offset: 0xD4
    uint diskNumber;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Text.Encoding _actualEncoding
    // Size: 0x8
    // Offset: 0xD8
    ::System::Text::Encoding* actualEncoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // Pathfinding.Ionic.Zip.ZipContainer _container
    // Size: 0x8
    // Offset: 0xE0
    ::Pathfinding::Ionic::Zip::ZipContainer* container;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipContainer*) == 0x8);
    // private System.Int64 __FileDataPosition
    // Size: 0x8
    // Offset: 0xE8
    int64_t FileDataPosition;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Byte[] _EntryHeader
    // Size: 0x8
    // Offset: 0xF0
    ::ArrayW<uint8_t> EntryHeader;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.Int64 _RelativeOffsetOfLocalHeader
    // Size: 0x8
    // Offset: 0xF8
    int64_t RelativeOffsetOfLocalHeader;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _future_ROLH
    // Size: 0x8
    // Offset: 0x100
    int64_t future_ROLH;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int64 _TotalEntrySize
    // Size: 0x8
    // Offset: 0x108
    int64_t TotalEntrySize;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int32 _LengthOfHeader
    // Size: 0x4
    // Offset: 0x110
    int LengthOfHeader;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 _LengthOfTrailer
    // Size: 0x4
    // Offset: 0x114
    int LengthOfTrailer;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // System.Boolean _InputUsesZip64
    // Size: 0x1
    // Offset: 0x118
    bool InputUsesZip64;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.UInt32 _UnsupportedAlgorithmId
    // Size: 0x4
    // Offset: 0x11C
    uint UnsupportedAlgorithmId;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // System.String _Password
    // Size: 0x8
    // Offset: 0x120
    ::StringW Password;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // Pathfinding.Ionic.Zip.ZipEntrySource _Source
    // Size: 0x4
    // Offset: 0x128
    ::Pathfinding::Ionic::Zip::ZipEntrySource Source;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipEntrySource) == 0x4);
    // Pathfinding.Ionic.Zip.EncryptionAlgorithm _Encryption
    // Size: 0x4
    // Offset: 0x12C
    ::Pathfinding::Ionic::Zip::EncryptionAlgorithm Encryption;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::EncryptionAlgorithm) == 0x4);
    // Pathfinding.Ionic.Zip.EncryptionAlgorithm _Encryption_FromZipFile
    // Size: 0x4
    // Offset: 0x130
    ::Pathfinding::Ionic::Zip::EncryptionAlgorithm Encryption_FromZipFile;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::EncryptionAlgorithm) == 0x4);
    // System.Byte[] _WeakEncryptionHeader
    // Size: 0x8
    // Offset: 0x138
    ::ArrayW<uint8_t> WeakEncryptionHeader;
    // Field size check
    static_assert(sizeof(::ArrayW<uint8_t>) == 0x8);
    // System.IO.Stream _archiveStream
    // Size: 0x8
    // Offset: 0x140
    ::System::IO::Stream* archiveStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.Stream _sourceStream
    // Size: 0x8
    // Offset: 0x148
    ::System::IO::Stream* sourceStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.Nullable`1<System.Int64> _sourceStreamOriginalPosition
    // Size: 0xFFFFFFFF
    // Offset: 0x150
    ::System::Nullable_1<int64_t> sourceStreamOriginalPosition;
    // private System.Boolean _ioOperationCanceled
    // Size: 0x1
    // Offset: 0x160
    bool ioOperationCanceled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _presumeZip64
    // Size: 0x1
    // Offset: 0x161
    bool presumeZip64;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Nullable`1<System.Boolean> _entryRequiresZip64
    // Size: 0xFFFFFFFF
    // Offset: 0x162
    ::System::Nullable_1<bool> entryRequiresZip64;
    // private System.Nullable`1<System.Boolean> _OutputUsesZip64
    // Size: 0xFFFFFFFF
    // Offset: 0x164
    ::System::Nullable_1<bool> OutputUsesZip64;
    // private System.Boolean _IsText
    // Size: 0x1
    // Offset: 0x166
    bool IsText;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private Pathfinding.Ionic.Zip.ZipEntryTimestamp _timestamp
    // Size: 0x4
    // Offset: 0x168
    ::Pathfinding::Ionic::Zip::ZipEntryTimestamp timestamp;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipEntryTimestamp) == 0x4);
    // private Pathfinding.Ionic.Zip.WriteDelegate _WriteDelegate
    // Size: 0x8
    // Offset: 0x170
    ::Pathfinding::Ionic::Zip::WriteDelegate* WriteDelegate;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::WriteDelegate*) == 0x8);
    // private Pathfinding.Ionic.Zip.OpenDelegate _OpenDelegate
    // Size: 0x8
    // Offset: 0x178
    ::Pathfinding::Ionic::Zip::OpenDelegate* OpenDelegate;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::OpenDelegate*) == 0x8);
    // private Pathfinding.Ionic.Zip.CloseDelegate _CloseDelegate
    // Size: 0x8
    // Offset: 0x180
    ::Pathfinding::Ionic::Zip::CloseDelegate* CloseDelegate;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::CloseDelegate*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABBF08
    // private Pathfinding.Ionic.Zip.ExtractExistingFileAction <ExtractExistingFile>k__BackingField
    // Size: 0x4
    // Offset: 0x188
    ::Pathfinding::Ionic::Zip::ExtractExistingFileAction ExtractExistingFile;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ExtractExistingFileAction) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xABBF18
    // private Pathfinding.Ionic.Zip.ZipErrorAction <ZipErrorAction>k__BackingField
    // Size: 0x4
    // Offset: 0x18C
    ::Pathfinding::Ionic::Zip::ZipErrorAction ZipErrorAction;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipErrorAction) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xABBF28
    // private Pathfinding.Ionic.Zip.SetCompressionCallback <SetCompression>k__BackingField
    // Size: 0x8
    // Offset: 0x190
    ::Pathfinding::Ionic::Zip::SetCompressionCallback* SetCompression;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::SetCompressionCallback*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABBF38
    // private System.Text.Encoding <AlternateEncoding>k__BackingField
    // Size: 0x8
    // Offset: 0x198
    ::System::Text::Encoding* AlternateEncoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABBF48
    // private Pathfinding.Ionic.Zip.ZipOption <AlternateEncodingUsage>k__BackingField
    // Size: 0x4
    // Offset: 0x1A0
    ::Pathfinding::Ionic::Zip::ZipOption AlternateEncodingUsage;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipOption) == 0x4);
    public:
    // Get static field: static private System.Text.Encoding ibm437
    static ::System::Text::Encoding* _get_ibm437();
    // Set static field: static private System.Text.Encoding ibm437
    static void _set_ibm437(::System::Text::Encoding* value);
    // Get static field: static private System.DateTime _unixEpoch
    static ::System::DateTime _get__unixEpoch();
    // Set static field: static private System.DateTime _unixEpoch
    static void _set__unixEpoch(::System::DateTime value);
    // Get static field: static private System.DateTime _win32Epoch
    static ::System::DateTime _get__win32Epoch();
    // Set static field: static private System.DateTime _win32Epoch
    static void _set__win32Epoch(::System::DateTime value);
    // Get static field: static private System.DateTime _zeroHour
