// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: Pathfinding.Ionic.Zip.Zip64Option
#include "Pathfinding/Ionic/Zip/Zip64Option.hpp"
// Including type: Pathfinding.Ionic.Zip.ZipOption
#include "Pathfinding/Ionic/Zip/ZipOption.hpp"
// Including type: Pathfinding.Ionic.Zlib.CompressionStrategy
#include "Pathfinding/Ionic/Zlib/CompressionStrategy.hpp"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Pathfinding::Ionic::Zip
namespace Pathfinding::Ionic::Zip {
  // Forward declaring type: ZipEntry
  class ZipEntry;
  // Forward declaring type: CountingStream
  class CountingStream;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
}
// Forward declaring namespace: System::Text
namespace System::Text {
  // Forward declaring type: Encoding
  class Encoding;
}
// Forward declaring namespace: Pathfinding::Ionic::Crc
namespace Pathfinding::Ionic::Crc {
  // Forward declaring type: CrcCalculatorStream
  class CrcCalculatorStream;
}
// Forward declaring namespace: Pathfinding::Ionic::Zlib
namespace Pathfinding::Ionic::Zlib {
  // Forward declaring type: ParallelDeflateOutputStream
  class ParallelDeflateOutputStream;
}
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Completed forward declares
// Type namespace: Pathfinding.Ionic.Zip
namespace Pathfinding::Ionic::Zip {
  // Forward declaring type: ZipOutputStream
  class ZipOutputStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Ionic::Zip::ZipOutputStream);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Ionic::Zip::ZipOutputStream*, "Pathfinding.Ionic.Zip", "ZipOutputStream");
// Type namespace: Pathfinding.Ionic.Zip
namespace Pathfinding::Ionic::Zip {
  // Size: 0xBC
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Ionic.Zip.ZipOutputStream
  // [TokenAttribute] Offset: FFFFFFFF
  class ZipOutputStream : public ::System::IO::Stream {
    public:
    public:
    // System.String _password
    // Size: 0x8
    // Offset: 0x28
    ::StringW password;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _comment
    // Size: 0x8
    // Offset: 0x30
    ::StringW comment;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.IO.Stream _outputStream
    // Size: 0x8
    // Offset: 0x38
    ::System::IO::Stream* outputStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private Pathfinding.Ionic.Zip.ZipEntry _currentEntry
    // Size: 0x8
    // Offset: 0x40
    ::Pathfinding::Ionic::Zip::ZipEntry* currentEntry;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipEntry*) == 0x8);
    // Pathfinding.Ionic.Zip.Zip64Option _zip64
    // Size: 0x4
    // Offset: 0x48
    ::Pathfinding::Ionic::Zip::Zip64Option zip64;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::Zip64Option) == 0x4);
    // Padding between fields: zip64 and: entriesWritten
    char __padding4[0x4] = {};
    // private System.Collections.Generic.Dictionary`2<System.String,Pathfinding.Ionic.Zip.ZipEntry> _entriesWritten
    // Size: 0x8
    // Offset: 0x50
    ::System::Collections::Generic::Dictionary_2<::StringW, ::Pathfinding::Ionic::Zip::ZipEntry*>* entriesWritten;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::Dictionary_2<::StringW, ::Pathfinding::Ionic::Zip::ZipEntry*>*) == 0x8);
    // private System.Int32 _entryCount
    // Size: 0x4
    // Offset: 0x58
    int entryCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private Pathfinding.Ionic.Zip.ZipOption _alternateEncodingUsage
    // Size: 0x4
    // Offset: 0x5C
    ::Pathfinding::Ionic::Zip::ZipOption alternateEncodingUsage;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipOption) == 0x4);
    // private System.Text.Encoding _alternateEncoding
    // Size: 0x8
    // Offset: 0x60
    ::System::Text::Encoding* alternateEncoding;
    // Field size check
    static_assert(sizeof(::System::Text::Encoding*) == 0x8);
    // private System.Boolean _leaveUnderlyingStreamOpen
    // Size: 0x1
    // Offset: 0x68
    bool leaveUnderlyingStreamOpen;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _disposed
    // Size: 0x1
    // Offset: 0x69
    bool disposed;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _exceptionPending
    // Size: 0x1
    // Offset: 0x6A
    bool exceptionPending;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _anyEntriesUsedZip64
    // Size: 0x1
    // Offset: 0x6B
    bool anyEntriesUsedZip64;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean _directoryNeededZip64
    // Size: 0x1
    // Offset: 0x6C
    bool directoryNeededZip64;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: directoryNeededZip64 and: outputCounter
    char __padding13[0x3] = {};
    // private Pathfinding.Ionic.Zip.CountingStream _outputCounter
    // Size: 0x8
    // Offset: 0x70
    ::Pathfinding::Ionic::Zip::CountingStream* outputCounter;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::CountingStream*) == 0x8);
    // private System.IO.Stream _encryptor
    // Size: 0x8
    // Offset: 0x78
    ::System::IO::Stream* encryptor;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private System.IO.Stream _deflater
    // Size: 0x8
    // Offset: 0x80
    ::System::IO::Stream* deflater;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // private Pathfinding.Ionic.Crc.CrcCalculatorStream _entryOutputStream
    // Size: 0x8
    // Offset: 0x88
    ::Pathfinding::Ionic::Crc::CrcCalculatorStream* entryOutputStream;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Crc::CrcCalculatorStream*) == 0x8);
    // private System.Boolean _needToWriteEntryHeader
    // Size: 0x1
    // Offset: 0x90
    bool needToWriteEntryHeader;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: needToWriteEntryHeader and: name
    char __padding18[0x7] = {};
    // private System.String _name
    // Size: 0x8
    // Offset: 0x98
    ::StringW name;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // Pathfinding.Ionic.Zlib.ParallelDeflateOutputStream ParallelDeflater
    // Size: 0x8
    // Offset: 0xA0
    ::Pathfinding::Ionic::Zlib::ParallelDeflateOutputStream* ParallelDeflater;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zlib::ParallelDeflateOutputStream*) == 0x8);
    // private System.Int64 _ParallelDeflateThreshold
    // Size: 0x8
    // Offset: 0xA8
    int64_t ParallelDeflateThreshold;
    // Field size check
    static_assert(sizeof(int64_t) == 0x8);
    // private System.Int32 _maxBufferPairs
    // Size: 0x4
    // Offset: 0xB0
    int maxBufferPairs;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xABBFE8
    // private System.Int32 <CodecBufferSize>k__BackingField
    // Size: 0x4
    // Offset: 0xB4
    int CodecBufferSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [CompilerGeneratedAttribute] Offset: 0xABBFF8
    // private Pathfinding.Ionic.Zlib.CompressionStrategy <Strategy>k__BackingField
    // Size: 0x4
    // Offset: 0xB8
    ::Pathfinding::Ionic::Zlib::CompressionStrategy Strategy;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zlib::CompressionStrategy) == 0x4);
    public:
    // Get instance field reference: System.String _password
    [[deprecated("Use field access instead!")]] ::StringW& dyn__password();
    // Get instance field reference: private System.String _comment
    [[deprecated("Use field access instead!")]] ::StringW& dyn__comment();
    // Get instance field reference: private System.IO.Stream _outputStream
    [[deprecated("Use field access instead!")]] ::System::IO::Stream*& dyn__outputStream();
    // Get instance field reference: private Pathfinding.Ionic.Zip.ZipEntry _currentEntry
    [[deprecated("Use field access instead!")]] ::Pathfinding::Ionic::Zip::ZipEntry*& dyn__currentEntry();
    // Get instance field reference: Pathfinding.Ionic.Zip.Zip64Option _zip64
