// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IO.Stream
#include "System/IO/Stream.hpp"
// Including type: System.Enum
#include "System/Enum.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::IO
namespace System::IO {
  // Forward declaring type: SeekOrigin
  struct SeekOrigin;
}
// Completed forward declares
// Type namespace: Pathfinding.Ionic.Zip
namespace Pathfinding::Ionic::Zip {
  // Forward declaring type: ZipSegmentedStream
  class ZipSegmentedStream;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::Pathfinding::Ionic::Zip::ZipSegmentedStream);
DEFINE_IL2CPP_ARG_TYPE(::Pathfinding::Ionic::Zip::ZipSegmentedStream*, "Pathfinding.Ionic.Zip", "ZipSegmentedStream");
// Type namespace: Pathfinding.Ionic.Zip
namespace Pathfinding::Ionic::Zip {
  // Size: 0x69
  #pragma pack(push, 1)
  // Autogenerated type: Pathfinding.Ionic.Zip.ZipSegmentedStream
  // [TokenAttribute] Offset: FFFFFFFF
  class ZipSegmentedStream : public ::System::IO::Stream {
    public:
    // Nested type: ::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode
    struct RwMode;
    // Size: 0x4
    #pragma pack(push, 1)
    // Autogenerated type: Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode
    // [TokenAttribute] Offset: FFFFFFFF
    struct RwMode/*, public ::System::Enum*/ {
      public:
      public:
      // public System.Int32 value__
      // Size: 0x4
      // Offset: 0x0
      int value;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RwMode
      constexpr RwMode(int value_ = {}) noexcept : value{value_} {}
      // Creating interface conversion operator: operator ::System::Enum
      operator ::System::Enum() noexcept {
        return *reinterpret_cast<::System::Enum*>(this);
      }
      // Creating conversion operator: operator int
      constexpr operator int() const noexcept {
        return value;
      }
      // static field const value: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode None
      static constexpr const int None = 0;
      // Get static field: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode None
      static ::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode _get_None();
      // Set static field: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode None
      static void _set_None(::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode value);
      // static field const value: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode ReadOnly
      static constexpr const int ReadOnly = 1;
      // Get static field: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode ReadOnly
      static ::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode _get_ReadOnly();
      // Set static field: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode ReadOnly
      static void _set_ReadOnly(::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode value);
      // static field const value: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode Write
      static constexpr const int Write = 2;
      // Get static field: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode Write
      static ::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode _get_Write();
      // Set static field: static public Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode Write
      static void _set_Write(::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode value);
      // Get instance field reference: public System.Int32 value__
      [[deprecated("Use field access instead!")]] int& dyn_value__();
    }; // Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode
    #pragma pack(pop)
    static check_size<sizeof(ZipSegmentedStream::RwMode), 0 + sizeof(int)> __Pathfinding_Ionic_Zip_ZipSegmentedStream_RwModeSizeCheck;
    static_assert(sizeof(ZipSegmentedStream::RwMode) == 0x4);
    public:
    // private Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode rwMode
    // Size: 0x4
    // Offset: 0x28
    ::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode rwMode;
    // Field size check
    static_assert(sizeof(::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode) == 0x4);
    // private System.Boolean _exceptionPending
    // Size: 0x1
    // Offset: 0x2C
    bool exceptionPending;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: exceptionPending and: baseName
    char __padding1[0x3] = {};
    // private System.String _baseName
    // Size: 0x8
    // Offset: 0x30
    ::StringW baseName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _baseDir
    // Size: 0x8
    // Offset: 0x38
    ::StringW baseDir;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _currentName
    // Size: 0x8
    // Offset: 0x40
    ::StringW currentName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String _currentTempName
    // Size: 0x8
    // Offset: 0x48
    ::StringW currentTempName;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.UInt32 _currentDiskNumber
    // Size: 0x4
    // Offset: 0x50
    uint currentDiskNumber;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 _maxDiskNumber
    // Size: 0x4
    // Offset: 0x54
    uint maxDiskNumber;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Int32 _maxSegmentSize
    // Size: 0x4
    // Offset: 0x58
    int maxSegmentSize;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: maxSegmentSize and: innerStream
    char __padding8[0x4] = {};
    // private System.IO.Stream _innerStream
    // Size: 0x8
    // Offset: 0x60
    ::System::IO::Stream* innerStream;
    // Field size check
    static_assert(sizeof(::System::IO::Stream*) == 0x8);
    // [CompilerGeneratedAttribute] Offset: 0xABC008
    // private System.Boolean <ContiguousWrite>k__BackingField
    // Size: 0x1
    // Offset: 0x68
    bool ContiguousWrite;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Get instance field reference: private Pathfinding.Ionic.Zip.ZipSegmentedStream/RwMode rwMode
    [[deprecated("Use field access instead!")]] ::Pathfinding::Ionic::Zip::ZipSegmentedStream::RwMode& dyn_rwMode();
    // Get instance field reference: private System.Boolean _exceptionPending
    [[deprecated("Use field access instead!")]] bool& dyn__exceptionPending();
    // Get instance field reference: private System.String _baseName
    [[deprecated("Use field access instead!")]] ::StringW& dyn__baseName();
    // Get instance field reference: private System.String _baseDir
    [[deprecated("Use field access instead!")]] ::StringW& dyn__baseDir();
    // Get instance field reference: private System.String _currentName
    [[deprecated("Use field access instead!")]] ::StringW& dyn__currentName();
