// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.RenderTextureDescriptor
#include "UnityEngine/RenderTextureDescriptor.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: HighlightingSystem.BlurDirections
#include "HighlightingSystem/BlurDirections.hpp"
// Including type: HighlightingSystem.AntiAliasing
#include "HighlightingSystem/AntiAliasing.hpp"
// Including type: UnityEngine.Rendering.RenderTargetIdentifier
#include "UnityEngine/Rendering/RenderTargetIdentifier.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Rendering.CameraEvent
#include "UnityEngine/Rendering/CameraEvent.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Forward declaring namespace: HighlightingSystem
namespace HighlightingSystem {
  // Forward declaring type: HighlightingBlitter
  class HighlightingBlitter;
  // Forward declaring type: HighlighterRenderer
  class HighlighterRenderer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Camera
  class Camera;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Shader
  class Shader;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: HashSet`1<T>
  template<typename T>
  class HashSet_1;
}
// Completed forward declares
// Type namespace: HighlightingSystem
namespace HighlightingSystem {
  // Forward declaring type: HighlightingBase
  class HighlightingBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HighlightingSystem::HighlightingBase);
DEFINE_IL2CPP_ARG_TYPE(::HighlightingSystem::HighlightingBase*, "HighlightingSystem", "HighlightingBase");
// Type namespace: HighlightingSystem
namespace HighlightingSystem {
  // Size: 0x118
  #pragma pack(push, 1)
  // Autogenerated type: HighlightingSystem.HighlightingBase
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  // [RequireComponent] Offset: AC1EE8
  class HighlightingBase : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // protected UnityEngine.Rendering.CommandBuffer renderBuffer
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Rendering::CommandBuffer* renderBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::CommandBuffer*) == 0x8);
    // protected UnityEngine.RenderTextureDescriptor cachedDescriptor
    // Size: 0x2C
    // Offset: 0x20
    ::UnityEngine::RenderTextureDescriptor cachedDescriptor;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTextureDescriptor) == 0x2C);
    // protected System.Single _fillAlpha
    // Size: 0x4
    // Offset: 0x4C
    float fillAlpha;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xAC60F4
    // protected System.Int32 _downsampleFactor
    // Size: 0x4
    // Offset: 0x50
    int downsampleFactor;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xAC6140
    // protected System.Int32 _iterations
    // Size: 0x4
    // Offset: 0x54
    int iterations;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xAC618C
    // protected System.Single _blurMinSpread
    // Size: 0x4
    // Offset: 0x58
    float blurMinSpread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // [FormerlySerializedAsAttribute] Offset: 0xAC61D8
    // protected System.Single _blurSpread
    // Size: 0x4
    // Offset: 0x5C
    float blurSpread;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single _blurIntensity
    // Size: 0x4
    // Offset: 0x60
    float blurIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected HighlightingSystem.BlurDirections _blurDirections
    // Size: 0x4
    // Offset: 0x64
    ::HighlightingSystem::BlurDirections blurDirections;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::BlurDirections) == 0x4);
    // protected HighlightingSystem.HighlightingBlitter _blitter
    // Size: 0x8
    // Offset: 0x68
    ::HighlightingSystem::HighlightingBlitter* blitter;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::HighlightingBlitter*) == 0x8);
    // protected HighlightingSystem.AntiAliasing _antiAliasing
    // Size: 0x4
    // Offset: 0x70
    ::HighlightingSystem::AntiAliasing antiAliasing;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::AntiAliasing) == 0x4);
    // Padding between fields: antiAliasing and: highlightingBufferID
    char __padding10[0x4] = {};
    // protected UnityEngine.Rendering.RenderTargetIdentifier highlightingBufferID
    // Size: 0x24
    // Offset: 0x78
    ::UnityEngine::Rendering::RenderTargetIdentifier highlightingBufferID;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
    // Padding between fields: highlightingBufferID and: blur1ID
    char __padding11[0x4] = {};
    // protected UnityEngine.Rendering.RenderTargetIdentifier blur1ID
    // Size: 0x24
    // Offset: 0xA0
    ::UnityEngine::Rendering::RenderTargetIdentifier blur1ID;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
    // Padding between fields: blur1ID and: blur2ID
    char __padding12[0x4] = {};
    // protected UnityEngine.Rendering.RenderTargetIdentifier blur2ID
    // Size: 0x24
    // Offset: 0xC8
    ::UnityEngine::Rendering::RenderTargetIdentifier blur2ID;
    // Field size check
    static_assert(sizeof(::UnityEngine::Rendering::RenderTargetIdentifier) == 0x24);
    // Padding between fields: blur2ID and: highlightingBuffer
    char __padding13[0x4] = {};
    // protected UnityEngine.RenderTexture highlightingBuffer
    // Size: 0x8
    // Offset: 0xF0
    ::UnityEngine::RenderTexture* highlightingBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // protected UnityEngine.Camera cam
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Camera* cam;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // protected UnityEngine.Material blurMaterial
    // Size: 0x8
    // Offset: 0x100
    ::UnityEngine::Material* blurMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected UnityEngine.Material cutMaterial
    // Size: 0x8
    // Offset: 0x108
    ::UnityEngine::Material* cutMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // protected UnityEngine.Material compMaterial
    // Size: 0x8
    // Offset: 0x110
    ::UnityEngine::Material* compMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // Get static field: static protected readonly UnityEngine.Color colorClear
    static ::UnityEngine::Color _get_colorClear();
    // Set static field: static protected readonly UnityEngine.Color colorClear
    static void _set_colorClear(::UnityEngine::Color value);
    // Get static field: static protected readonly System.String renderBufferName
    static ::StringW _get_renderBufferName();
    // Set static field: static protected readonly System.String renderBufferName
    static void _set_renderBufferName(::StringW value);
    // Get static field: static protected readonly UnityEngine.Matrix4x4 identityMatrix
    static ::UnityEngine::Matrix4x4 _get_identityMatrix();
