// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: HighlightingSystem.HighlighterCore
#include "HighlightingSystem/HighlighterCore.hpp"
// Including type: HighlightingSystem.LoopMode
#include "HighlightingSystem/LoopMode.hpp"
// Including type: HighlightingSystem.Easing
#include "HighlightingSystem/Easing.hpp"
// Including type: HighlightingSystem.RendererFilterMode
#include "HighlightingSystem/RendererFilterMode.hpp"
// Including type: UnityEngine.GradientColorKey
#include "UnityEngine/GradientColorKey.hpp"
// Including type: UnityEngine.GradientAlphaKey
#include "UnityEngine/GradientAlphaKey.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Renderer
  class Renderer;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: HighlightingSystem
namespace HighlightingSystem {
  // Forward declaring type: Highlighter
  class Highlighter;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HighlightingSystem::Highlighter);
DEFINE_IL2CPP_ARG_TYPE(::HighlightingSystem::Highlighter*, "HighlightingSystem", "Highlighter");
// Type namespace: HighlightingSystem
namespace HighlightingSystem {
  // Size: 0x110
  #pragma pack(push, 1)
  // Autogenerated type: HighlightingSystem.Highlighter
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: AC1D2C
  class Highlighter : public ::HighlightingSystem::HighlighterCore {
    public:
    public:
    // protected System.Boolean _overlay
    // Size: 0x1
    // Offset: 0x78
    bool overlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _occluder
    // Size: 0x1
    // Offset: 0x79
    bool occluder;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: occluder and: hoverColor
    char __padding1[0x2] = {};
    // protected UnityEngine.Color _hoverColor
    // Size: 0x10
    // Offset: 0x7C
    ::UnityEngine::Color hoverColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // protected System.Int32 _hoverFrame
    // Size: 0x4
    // Offset: 0x8C
    int hoverFrame;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _tween
    // Size: 0x1
    // Offset: 0x90
    bool tween;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tween and: tweenGradient
    char __padding4[0x7] = {};
    // protected UnityEngine.Gradient _tweenGradient
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Gradient* tweenGradient;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // protected System.Single _tweenDuration
    // Size: 0x4
    // Offset: 0xA0
    float tweenDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean _tweenReverse
    // Size: 0x1
    // Offset: 0xA4
    bool tweenReverse;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tweenReverse and: tweenLoop
    char __padding7[0x3] = {};
    // protected HighlightingSystem.LoopMode _tweenLoop
    // Size: 0x4
    // Offset: 0xA8
    ::HighlightingSystem::LoopMode tweenLoop;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::LoopMode) == 0x4);
    // protected HighlightingSystem.Easing _tweenEasing
    // Size: 0x4
    // Offset: 0xAC
    ::HighlightingSystem::Easing tweenEasing;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::Easing) == 0x4);
    // protected System.Single _tweenDelay
    // Size: 0x4
    // Offset: 0xB0
    float tweenDelay;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Int32 _tweenRepeatCount
    // Size: 0x4
    // Offset: 0xB4
    int tweenRepeatCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // protected System.Boolean _tweenUseUnscaledTime
    // Size: 0x1
    // Offset: 0xB8
    bool tweenUseUnscaledTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // protected System.Boolean _constant
    // Size: 0x1
    // Offset: 0xB9
    bool constant;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: constant and: constantColor
    char __padding13[0x2] = {};
    // protected UnityEngine.Color _constantColor
    // Size: 0x10
    // Offset: 0xBC
    ::UnityEngine::Color constantColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // protected System.Single _constantFadeInTime
    // Size: 0x4
    // Offset: 0xCC
    float constantFadeInTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single _constantFadeOutTime
    // Size: 0x4
    // Offset: 0xD0
    float constantFadeOutTime;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected HighlightingSystem.Easing _constantEasing
    // Size: 0x4
    // Offset: 0xD4
    ::HighlightingSystem::Easing constantEasing;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::Easing) == 0x4);
    // protected System.Boolean _constantUseUnscaledTime
    // Size: 0x1
    // Offset: 0xD8
    bool constantUseUnscaledTime;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: constantUseUnscaledTime and: filterMode
    char __padding18[0x3] = {};
    // protected HighlightingSystem.RendererFilterMode _filterMode
    // Size: 0x4
    // Offset: 0xDC
    ::HighlightingSystem::RendererFilterMode filterMode;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::RendererFilterMode) == 0x4);
    // protected System.Collections.Generic.List`1<UnityEngine.Transform> _filterList
    // Size: 0x8
    // Offset: 0xE0
    ::System::Collections::Generic::List_1<::UnityEngine::Transform*>* filterList;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Transform*>*) == 0x8);
    // protected System.Boolean _tweenEnabled
    // Size: 0x1
    // Offset: 0xE8
    bool tweenEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: tweenEnabled and: tweenStart
    char __padding21[0x3] = {};
    // protected System.Single _tweenStart
    // Size: 0x4
    // Offset: 0xEC
    float tweenStart;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Boolean _constantEnabled
    // Size: 0x1
    // Offset: 0xF0
    bool constantEnabled;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: constantEnabled and: constantStart
    char __padding23[0x3] = {};
    // protected System.Single _constantStart
    // Size: 0x4
    // Offset: 0xF4
    float constantStart;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // protected System.Single _constantDuration
    // Size: 0x4
    // Offset: 0xF8
    float constantDuration;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: constantDuration and: flashingColorKeys
    char __padding25[0x4] = {};
    // private UnityEngine.GradientColorKey[] flashingColorKeys
    // Size: 0x8
    // Offset: 0x100
    ::ArrayW<::UnityEngine::GradientColorKey> flashingColorKeys;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GradientColorKey>) == 0x8);
    // private UnityEngine.GradientAlphaKey[] flashingAlphaKeys
    // Size: 0x8
    // Offset: 0x108
    ::ArrayW<::UnityEngine::GradientAlphaKey> flashingAlphaKeys;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::GradientAlphaKey>) == 0x8);
    public:
    // static field const value: static protected System.Single HALFPI
    static constexpr const float HALFPI = 1.5707964;
    // Get static field: static protected System.Single HALFPI
    static float _get_HALFPI();
    // Set static field: static protected System.Single HALFPI
    static void _set_HALFPI(float value);
    // Get instance field reference: protected System.Boolean _overlay
    [[deprecated("Use field access instead!")]] bool& dyn__overlay();
    // Get instance field reference: protected System.Boolean _occluder
    [[deprecated("Use field access instead!")]] bool& dyn__occluder();
    // Get instance field reference: protected UnityEngine.Color _hoverColor
    [[deprecated("Use field access instead!")]] ::UnityEngine::Color& dyn__hoverColor();
