// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: HighlightingSystem.HighlighterMode
#include "HighlightingSystem/HighlighterMode.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: HighlightingSystem
namespace HighlightingSystem {
  // Forward declaring type: HighlighterRenderer
  class HighlighterRenderer;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Renderer
  class Renderer;
  // Forward declaring type: Shader
  class Shader;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: Stack`1<T>
  template<typename T>
  class Stack_1;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: String
  class String;
}
// Forward declaring namespace: System::Collections::ObjectModel
namespace System::Collections::ObjectModel {
  // Forward declaring type: ReadOnlyCollection`1<T>
  template<typename T>
  class ReadOnlyCollection_1;
}
// Forward declaring namespace: UnityEngine::Rendering
namespace UnityEngine::Rendering {
  // Forward declaring type: CommandBuffer
  class CommandBuffer;
}
// Completed forward declares
// Type namespace: HighlightingSystem
namespace HighlightingSystem {
  // Forward declaring type: HighlighterCore
  class HighlighterCore;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::HighlightingSystem::HighlighterCore);
DEFINE_IL2CPP_ARG_TYPE(::HighlightingSystem::HighlighterCore*, "HighlightingSystem", "HighlighterCore");
// Type namespace: HighlightingSystem
namespace HighlightingSystem {
  // Size: 0x78
  #pragma pack(push, 1)
  // Autogenerated type: HighlightingSystem.HighlighterCore
  // [TokenAttribute] Offset: FFFFFFFF
  // [DisallowMultipleComponent] Offset: FFFFFFFF
  class HighlighterCore : public ::UnityEngine::MonoBehaviour {
    public:
    // Nested type: ::HighlightingSystem::HighlighterCore::RendererData
    class RendererData;
    // Nested type: ::HighlightingSystem::HighlighterCore::RendererFilter
    class RendererFilter;
    public:
    // private readonly UnityEngine.Color occluderColor
    // Size: 0x10
    // Offset: 0x18
    ::UnityEngine::Color occluderColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // public HighlightingSystem.HighlighterMode mode
    // Size: 0x4
    // Offset: 0x28
    ::HighlightingSystem::HighlighterMode mode;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::HighlighterMode) == 0x4);
    // public System.Boolean forceRender
    // Size: 0x1
    // Offset: 0x2C
    bool forceRender;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: forceRender and: color
    char __padding2[0x3] = {};
    // public UnityEngine.Color color
    // Size: 0x10
    // Offset: 0x30
    ::UnityEngine::Color color;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private UnityEngine.Transform tr
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Transform* tr;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private System.Collections.Generic.List`1<HighlightingSystem.HighlighterRenderer> highlightableRenderers
    // Size: 0x8
    // Offset: 0x48
    ::System::Collections::Generic::List_1<::HighlightingSystem::HighlighterRenderer*>* highlightableRenderers;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::HighlightingSystem::HighlighterRenderer*>*) == 0x8);
    // private System.Boolean isDirty
    // Size: 0x1
    // Offset: 0x50
    bool isDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // private System.Boolean cachedOverlay
    // Size: 0x1
    // Offset: 0x51
    bool cachedOverlay;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: cachedOverlay and: cachedColor
    char __padding7[0x2] = {};
    // private UnityEngine.Color cachedColor
    // Size: 0x10
    // Offset: 0x54
    ::UnityEngine::Color cachedColor;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: cachedColor and: opaqueMaterial
    char __padding8[0x4] = {};
    // private UnityEngine.Material _opaqueMaterial
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::Material* opaqueMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private HighlightingSystem.HighlighterCore/RendererFilter _rendererFilter
    // Size: 0x8
    // Offset: 0x70
    ::HighlightingSystem::HighlighterCore::RendererFilter* rendererFilter;
    // Field size check
    static_assert(sizeof(::HighlightingSystem::HighlighterCore::RendererFilter*) == 0x8);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.String keywordOverlay
    static constexpr const char* keywordOverlay = "HIGHLIGHTING_OVERLAY";
    // Get static field: static public System.String keywordOverlay
    static ::StringW _get_keywordOverlay();
    // Set static field: static public System.String keywordOverlay
    static void _set_keywordOverlay(::StringW value);
    // Get static field: static private readonly HighlightingSystem.HighlighterMode[] renderingOrder
    static ::ArrayW<::HighlightingSystem::HighlighterMode> _get_renderingOrder();
