// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Forward declaring type: IVRInput
  struct IVRInput;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::IVRInput, "Valve.VR", "IVRInput");
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0xC0
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRInput
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRInput/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Valve::VR::IVRInput::_SetActionManifestPath
    class _SetActionManifestPath;
    // Nested type: ::Valve::VR::IVRInput::_GetActionSetHandle
    class _GetActionSetHandle;
    // Nested type: ::Valve::VR::IVRInput::_GetActionHandle
    class _GetActionHandle;
    // Nested type: ::Valve::VR::IVRInput::_GetInputSourceHandle
    class _GetInputSourceHandle;
    // Nested type: ::Valve::VR::IVRInput::_UpdateActionState
    class _UpdateActionState;
    // Nested type: ::Valve::VR::IVRInput::_GetDigitalActionData
    class _GetDigitalActionData;
    // Nested type: ::Valve::VR::IVRInput::_GetAnalogActionData
    class _GetAnalogActionData;
    // Nested type: ::Valve::VR::IVRInput::_GetPoseActionData
    class _GetPoseActionData;
    // Nested type: ::Valve::VR::IVRInput::_GetSkeletalActionData
    class _GetSkeletalActionData;
    // Nested type: ::Valve::VR::IVRInput::_GetBoneCount
    class _GetBoneCount;
    // Nested type: ::Valve::VR::IVRInput::_GetBoneHierarchy
    class _GetBoneHierarchy;
    // Nested type: ::Valve::VR::IVRInput::_GetBoneName
    class _GetBoneName;
    // Nested type: ::Valve::VR::IVRInput::_GetSkeletalReferenceTransforms
    class _GetSkeletalReferenceTransforms;
    // Nested type: ::Valve::VR::IVRInput::_GetSkeletalTrackingLevel
    class _GetSkeletalTrackingLevel;
    // Nested type: ::Valve::VR::IVRInput::_GetSkeletalBoneData
    class _GetSkeletalBoneData;
    // Nested type: ::Valve::VR::IVRInput::_GetSkeletalSummaryData
    class _GetSkeletalSummaryData;
    // Nested type: ::Valve::VR::IVRInput::_GetSkeletalBoneDataCompressed
    class _GetSkeletalBoneDataCompressed;
    // Nested type: ::Valve::VR::IVRInput::_DecompressSkeletalBoneData
    class _DecompressSkeletalBoneData;
    // Nested type: ::Valve::VR::IVRInput::_TriggerHapticVibrationAction
    class _TriggerHapticVibrationAction;
    // Nested type: ::Valve::VR::IVRInput::_GetActionOrigins
    class _GetActionOrigins;
    // Nested type: ::Valve::VR::IVRInput::_GetOriginLocalizedName
    class _GetOriginLocalizedName;
    // Nested type: ::Valve::VR::IVRInput::_GetOriginTrackedDeviceInfo
    class _GetOriginTrackedDeviceInfo;
    // Nested type: ::Valve::VR::IVRInput::_ShowActionOrigins
    class _ShowActionOrigins;
    // Nested type: ::Valve::VR::IVRInput::_ShowBindingsForActionSet
    class _ShowBindingsForActionSet;
    public:
    // Valve.VR.IVRInput/_SetActionManifestPath SetActionManifestPath
    // Size: 0x8
    // Offset: 0x0
    ::Valve::VR::IVRInput::_SetActionManifestPath* SetActionManifestPath;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_SetActionManifestPath*) == 0x8);
    // Valve.VR.IVRInput/_GetActionSetHandle GetActionSetHandle
    // Size: 0x8
    // Offset: 0x8
    ::Valve::VR::IVRInput::_GetActionSetHandle* GetActionSetHandle;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetActionSetHandle*) == 0x8);
    // Valve.VR.IVRInput/_GetActionHandle GetActionHandle
    // Size: 0x8
    // Offset: 0x10
    ::Valve::VR::IVRInput::_GetActionHandle* GetActionHandle;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetActionHandle*) == 0x8);
    // Valve.VR.IVRInput/_GetInputSourceHandle GetInputSourceHandle
    // Size: 0x8
    // Offset: 0x18
    ::Valve::VR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetInputSourceHandle*) == 0x8);
    // Valve.VR.IVRInput/_UpdateActionState UpdateActionState
    // Size: 0x8
    // Offset: 0x20
    ::Valve::VR::IVRInput::_UpdateActionState* UpdateActionState;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_UpdateActionState*) == 0x8);
    // Valve.VR.IVRInput/_GetDigitalActionData GetDigitalActionData
    // Size: 0x8
    // Offset: 0x28
    ::Valve::VR::IVRInput::_GetDigitalActionData* GetDigitalActionData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetDigitalActionData*) == 0x8);
    // Valve.VR.IVRInput/_GetAnalogActionData GetAnalogActionData
    // Size: 0x8
    // Offset: 0x30
    ::Valve::VR::IVRInput::_GetAnalogActionData* GetAnalogActionData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetAnalogActionData*) == 0x8);
    // Valve.VR.IVRInput/_GetPoseActionData GetPoseActionData
    // Size: 0x8
    // Offset: 0x38
    ::Valve::VR::IVRInput::_GetPoseActionData* GetPoseActionData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetPoseActionData*) == 0x8);
    // Valve.VR.IVRInput/_GetSkeletalActionData GetSkeletalActionData
    // Size: 0x8
    // Offset: 0x40
    ::Valve::VR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetSkeletalActionData*) == 0x8);
    // Valve.VR.IVRInput/_GetBoneCount GetBoneCount
    // Size: 0x8
    // Offset: 0x48
    ::Valve::VR::IVRInput::_GetBoneCount* GetBoneCount;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetBoneCount*) == 0x8);
    // Valve.VR.IVRInput/_GetBoneHierarchy GetBoneHierarchy
    // Size: 0x8
    // Offset: 0x50
    ::Valve::VR::IVRInput::_GetBoneHierarchy* GetBoneHierarchy;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetBoneHierarchy*) == 0x8);
    // Valve.VR.IVRInput/_GetBoneName GetBoneName
    // Size: 0x8
    // Offset: 0x58
    ::Valve::VR::IVRInput::_GetBoneName* GetBoneName;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetBoneName*) == 0x8);
    // Valve.VR.IVRInput/_GetSkeletalReferenceTransforms GetSkeletalReferenceTransforms
    // Size: 0x8
    // Offset: 0x60
    ::Valve::VR::IVRInput::_GetSkeletalReferenceTransforms* GetSkeletalReferenceTransforms;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetSkeletalReferenceTransforms*) == 0x8);
    // Valve.VR.IVRInput/_GetSkeletalTrackingLevel GetSkeletalTrackingLevel
    // Size: 0x8
    // Offset: 0x68
    ::Valve::VR::IVRInput::_GetSkeletalTrackingLevel* GetSkeletalTrackingLevel;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetSkeletalTrackingLevel*) == 0x8);
    // Valve.VR.IVRInput/_GetSkeletalBoneData GetSkeletalBoneData
    // Size: 0x8
    // Offset: 0x70
    ::Valve::VR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetSkeletalBoneData*) == 0x8);
    // Valve.VR.IVRInput/_GetSkeletalSummaryData GetSkeletalSummaryData
    // Size: 0x8
    // Offset: 0x78
    ::Valve::VR::IVRInput::_GetSkeletalSummaryData* GetSkeletalSummaryData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetSkeletalSummaryData*) == 0x8);
    // Valve.VR.IVRInput/_GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    // Size: 0x8
    // Offset: 0x80
    ::Valve::VR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetSkeletalBoneDataCompressed*) == 0x8);
    // Valve.VR.IVRInput/_DecompressSkeletalBoneData DecompressSkeletalBoneData
    // Size: 0x8
    // Offset: 0x88
    ::Valve::VR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_DecompressSkeletalBoneData*) == 0x8);
    // Valve.VR.IVRInput/_TriggerHapticVibrationAction TriggerHapticVibrationAction
    // Size: 0x8
    // Offset: 0x90
    ::Valve::VR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_TriggerHapticVibrationAction*) == 0x8);
    // Valve.VR.IVRInput/_GetActionOrigins GetActionOrigins
    // Size: 0x8
    // Offset: 0x98
    ::Valve::VR::IVRInput::_GetActionOrigins* GetActionOrigins;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetActionOrigins*) == 0x8);
    // Valve.VR.IVRInput/_GetOriginLocalizedName GetOriginLocalizedName
    // Size: 0x8
    // Offset: 0xA0
    ::Valve::VR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetOriginLocalizedName*) == 0x8);
    // Valve.VR.IVRInput/_GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    // Size: 0x8
    // Offset: 0xA8
    ::Valve::VR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_GetOriginTrackedDeviceInfo*) == 0x8);
    // Valve.VR.IVRInput/_ShowActionOrigins ShowActionOrigins
    // Size: 0x8
    // Offset: 0xB0
    ::Valve::VR::IVRInput::_ShowActionOrigins* ShowActionOrigins;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_ShowActionOrigins*) == 0x8);
    // Valve.VR.IVRInput/_ShowBindingsForActionSet ShowBindingsForActionSet
    // Size: 0x8
    // Offset: 0xB8
    ::Valve::VR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRInput::_ShowBindingsForActionSet*) == 0x8);
    public:
    // Creating value type constructor for type: IVRInput
    constexpr IVRInput(::Valve::VR::IVRInput::_SetActionManifestPath* SetActionManifestPath_ = {}, ::Valve::VR::IVRInput::_GetActionSetHandle* GetActionSetHandle_ = {}, ::Valve::VR::IVRInput::_GetActionHandle* GetActionHandle_ = {}, ::Valve::VR::IVRInput::_GetInputSourceHandle* GetInputSourceHandle_ = {}, ::Valve::VR::IVRInput::_UpdateActionState* UpdateActionState_ = {}, ::Valve::VR::IVRInput::_GetDigitalActionData* GetDigitalActionData_ = {}, ::Valve::VR::IVRInput::_GetAnalogActionData* GetAnalogActionData_ = {}, ::Valve::VR::IVRInput::_GetPoseActionData* GetPoseActionData_ = {}, ::Valve::VR::IVRInput::_GetSkeletalActionData* GetSkeletalActionData_ = {}, ::Valve::VR::IVRInput::_GetBoneCount* GetBoneCount_ = {}, ::Valve::VR::IVRInput::_GetBoneHierarchy* GetBoneHierarchy_ = {}, ::Valve::VR::IVRInput::_GetBoneName* GetBoneName_ = {}, ::Valve::VR::IVRInput::_GetSkeletalReferenceTransforms* GetSkeletalReferenceTransforms_ = {}, ::Valve::VR::IVRInput::_GetSkeletalTrackingLevel* GetSkeletalTrackingLevel_ = {}, ::Valve::VR::IVRInput::_GetSkeletalBoneData* GetSkeletalBoneData_ = {}, ::Valve::VR::IVRInput::_GetSkeletalSummaryData* GetSkeletalSummaryData_ = {}, ::Valve::VR::IVRInput::_GetSkeletalBoneDataCompressed* GetSkeletalBoneDataCompressed_ = {}, ::Valve::VR::IVRInput::_DecompressSkeletalBoneData* DecompressSkeletalBoneData_ = {}, ::Valve::VR::IVRInput::_TriggerHapticVibrationAction* TriggerHapticVibrationAction_ = {}, ::Valve::VR::IVRInput::_GetActionOrigins* GetActionOrigins_ = {}, ::Valve::VR::IVRInput::_GetOriginLocalizedName* GetOriginLocalizedName_ = {}, ::Valve::VR::IVRInput::_GetOriginTrackedDeviceInfo* GetOriginTrackedDeviceInfo_ = {}, ::Valve::VR::IVRInput::_ShowActionOrigins* ShowActionOrigins_ = {}, ::Valve::VR::IVRInput::_ShowBindingsForActionSet* ShowBindingsForActionSet_ = {}) noexcept : SetActionManifestPath{SetActionManifestPath_}, GetActionSetHandle{GetActionSetHandle_}, GetActionHandle{GetActionHandle_}, GetInputSourceHandle{GetInputSourceHandle_}, UpdateActionState{UpdateActionState_}, GetDigitalActionData{GetDigitalActionData_}, GetAnalogActionData{GetAnalogActionData_}, GetPoseActionData{GetPoseActionData_}, GetSkeletalActionData{GetSkeletalActionData_}, GetBoneCount{GetBoneCount_}, GetBoneHierarchy{GetBoneHierarchy_}, GetBoneName{GetBoneName_}, GetSkeletalReferenceTransforms{GetSkeletalReferenceTransforms_}, GetSkeletalTrackingLevel{GetSkeletalTrackingLevel_}, GetSkeletalBoneData{GetSkeletalBoneData_}, GetSkeletalSummaryData{GetSkeletalSummaryData_}, GetSkeletalBoneDataCompressed{GetSkeletalBoneDataCompressed_}, DecompressSkeletalBoneData{DecompressSkeletalBoneData_}, TriggerHapticVibrationAction{TriggerHapticVibrationAction_}, GetActionOrigins{GetActionOrigins_}, GetOriginLocalizedName{GetOriginLocalizedName_}, GetOriginTrackedDeviceInfo{GetOriginTrackedDeviceInfo_}, ShowActionOrigins{ShowActionOrigins_}, ShowBindingsForActionSet{ShowBindingsForActionSet_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: Valve.VR.IVRInput/_SetActionManifestPath SetActionManifestPath
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_SetActionManifestPath*& dyn_SetActionManifestPath();
    // Get instance field reference: Valve.VR.IVRInput/_GetActionSetHandle GetActionSetHandle
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetActionSetHandle*& dyn_GetActionSetHandle();
    // Get instance field reference: Valve.VR.IVRInput/_GetActionHandle GetActionHandle
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetActionHandle*& dyn_GetActionHandle();
    // Get instance field reference: Valve.VR.IVRInput/_GetInputSourceHandle GetInputSourceHandle
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetInputSourceHandle*& dyn_GetInputSourceHandle();
    // Get instance field reference: Valve.VR.IVRInput/_UpdateActionState UpdateActionState
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_UpdateActionState*& dyn_UpdateActionState();
    // Get instance field reference: Valve.VR.IVRInput/_GetDigitalActionData GetDigitalActionData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetDigitalActionData*& dyn_GetDigitalActionData();
    // Get instance field reference: Valve.VR.IVRInput/_GetAnalogActionData GetAnalogActionData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetAnalogActionData*& dyn_GetAnalogActionData();
    // Get instance field reference: Valve.VR.IVRInput/_GetPoseActionData GetPoseActionData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetPoseActionData*& dyn_GetPoseActionData();
    // Get instance field reference: Valve.VR.IVRInput/_GetSkeletalActionData GetSkeletalActionData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetSkeletalActionData*& dyn_GetSkeletalActionData();
    // Get instance field reference: Valve.VR.IVRInput/_GetBoneCount GetBoneCount
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetBoneCount*& dyn_GetBoneCount();
    // Get instance field reference: Valve.VR.IVRInput/_GetBoneHierarchy GetBoneHierarchy
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetBoneHierarchy*& dyn_GetBoneHierarchy();
    // Get instance field reference: Valve.VR.IVRInput/_GetBoneName GetBoneName
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetBoneName*& dyn_GetBoneName();
    // Get instance field reference: Valve.VR.IVRInput/_GetSkeletalReferenceTransforms GetSkeletalReferenceTransforms
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetSkeletalReferenceTransforms*& dyn_GetSkeletalReferenceTransforms();
    // Get instance field reference: Valve.VR.IVRInput/_GetSkeletalTrackingLevel GetSkeletalTrackingLevel
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetSkeletalTrackingLevel*& dyn_GetSkeletalTrackingLevel();
    // Get instance field reference: Valve.VR.IVRInput/_GetSkeletalBoneData GetSkeletalBoneData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetSkeletalBoneData*& dyn_GetSkeletalBoneData();
    // Get instance field reference: Valve.VR.IVRInput/_GetSkeletalSummaryData GetSkeletalSummaryData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetSkeletalSummaryData*& dyn_GetSkeletalSummaryData();
    // Get instance field reference: Valve.VR.IVRInput/_GetSkeletalBoneDataCompressed GetSkeletalBoneDataCompressed
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetSkeletalBoneDataCompressed*& dyn_GetSkeletalBoneDataCompressed();
    // Get instance field reference: Valve.VR.IVRInput/_DecompressSkeletalBoneData DecompressSkeletalBoneData
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_DecompressSkeletalBoneData*& dyn_DecompressSkeletalBoneData();
    // Get instance field reference: Valve.VR.IVRInput/_TriggerHapticVibrationAction TriggerHapticVibrationAction
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_TriggerHapticVibrationAction*& dyn_TriggerHapticVibrationAction();
    // Get instance field reference: Valve.VR.IVRInput/_GetActionOrigins GetActionOrigins
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetActionOrigins*& dyn_GetActionOrigins();
    // Get instance field reference: Valve.VR.IVRInput/_GetOriginLocalizedName GetOriginLocalizedName
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetOriginLocalizedName*& dyn_GetOriginLocalizedName();
    // Get instance field reference: Valve.VR.IVRInput/_GetOriginTrackedDeviceInfo GetOriginTrackedDeviceInfo
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_GetOriginTrackedDeviceInfo*& dyn_GetOriginTrackedDeviceInfo();
    // Get instance field reference: Valve.VR.IVRInput/_ShowActionOrigins ShowActionOrigins
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_ShowActionOrigins*& dyn_ShowActionOrigins();
    // Get instance field reference: Valve.VR.IVRInput/_ShowBindingsForActionSet ShowBindingsForActionSet
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRInput::_ShowBindingsForActionSet*& dyn_ShowBindingsForActionSet();
  }; // Valve.VR.IVRInput
  #pragma pack(pop)
  static check_size<sizeof(IVRInput), 184 + sizeof(::Valve::VR::IVRInput::_ShowBindingsForActionSet*)> __Valve_VR_IVRInputSizeCheck;
  static_assert(sizeof(IVRInput) == 0xC0);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
