// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: Valve::VR
namespace Valve::VR {
}
// Completed forward declares
// Type namespace: Valve.VR
namespace Valve::VR {
  // Forward declaring type: IVRSpatialAnchors
  struct IVRSpatialAnchors;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::Valve::VR::IVRSpatialAnchors, "Valve.VR", "IVRSpatialAnchors");
// Type namespace: Valve.VR
namespace Valve::VR {
  // Size: 0x20
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: Valve.VR.IVRSpatialAnchors
  // [TokenAttribute] Offset: FFFFFFFF
  struct IVRSpatialAnchors/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromDescriptor
    class _CreateSpatialAnchorFromDescriptor;
    // Nested type: ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromPose
    class _CreateSpatialAnchorFromPose;
    // Nested type: ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorPose
    class _GetSpatialAnchorPose;
    // Nested type: ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorDescriptor
    class _GetSpatialAnchorDescriptor;
    public:
    // Valve.VR.IVRSpatialAnchors/_CreateSpatialAnchorFromDescriptor CreateSpatialAnchorFromDescriptor
    // Size: 0x8
    // Offset: 0x0
    ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromDescriptor* CreateSpatialAnchorFromDescriptor;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromDescriptor*) == 0x8);
    // Valve.VR.IVRSpatialAnchors/_CreateSpatialAnchorFromPose CreateSpatialAnchorFromPose
    // Size: 0x8
    // Offset: 0x8
    ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromPose* CreateSpatialAnchorFromPose;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromPose*) == 0x8);
    // Valve.VR.IVRSpatialAnchors/_GetSpatialAnchorPose GetSpatialAnchorPose
    // Size: 0x8
    // Offset: 0x10
    ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorPose* GetSpatialAnchorPose;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorPose*) == 0x8);
    // Valve.VR.IVRSpatialAnchors/_GetSpatialAnchorDescriptor GetSpatialAnchorDescriptor
    // Size: 0x8
    // Offset: 0x18
    ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorDescriptor* GetSpatialAnchorDescriptor;
    // Field size check
    static_assert(sizeof(::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorDescriptor*) == 0x8);
    public:
    // Creating value type constructor for type: IVRSpatialAnchors
    constexpr IVRSpatialAnchors(::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromDescriptor* CreateSpatialAnchorFromDescriptor_ = {}, ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromPose* CreateSpatialAnchorFromPose_ = {}, ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorPose* GetSpatialAnchorPose_ = {}, ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorDescriptor* GetSpatialAnchorDescriptor_ = {}) noexcept : CreateSpatialAnchorFromDescriptor{CreateSpatialAnchorFromDescriptor_}, CreateSpatialAnchorFromPose{CreateSpatialAnchorFromPose_}, GetSpatialAnchorPose{GetSpatialAnchorPose_}, GetSpatialAnchorDescriptor{GetSpatialAnchorDescriptor_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get instance field reference: Valve.VR.IVRSpatialAnchors/_CreateSpatialAnchorFromDescriptor CreateSpatialAnchorFromDescriptor
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromDescriptor*& dyn_CreateSpatialAnchorFromDescriptor();
    // Get instance field reference: Valve.VR.IVRSpatialAnchors/_CreateSpatialAnchorFromPose CreateSpatialAnchorFromPose
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRSpatialAnchors::_CreateSpatialAnchorFromPose*& dyn_CreateSpatialAnchorFromPose();
    // Get instance field reference: Valve.VR.IVRSpatialAnchors/_GetSpatialAnchorPose GetSpatialAnchorPose
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorPose*& dyn_GetSpatialAnchorPose();
    // Get instance field reference: Valve.VR.IVRSpatialAnchors/_GetSpatialAnchorDescriptor GetSpatialAnchorDescriptor
    [[deprecated("Use field access instead!")]] ::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorDescriptor*& dyn_GetSpatialAnchorDescriptor();
  }; // Valve.VR.IVRSpatialAnchors
  #pragma pack(pop)
  static check_size<sizeof(IVRSpatialAnchors), 24 + sizeof(::Valve::VR::IVRSpatialAnchors::_GetSpatialAnchorDescriptor*)> __Valve_VR_IVRSpatialAnchorsSizeCheck;
  static_assert(sizeof(IVRSpatialAnchors) == 0x20);
}
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
