// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.ValueType
#include "System/ValueType.hpp"
// Including type: UnityEngine.Vector3
#include "UnityEngine/Vector3.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: CodeStage::AntiCheat::ObscuredTypes
namespace CodeStage::AntiCheat::ObscuredTypes {
  // Skipping declaration: RawEncryptedVector3 because it is already included!
}
// Completed forward declares
// Type namespace: CodeStage.AntiCheat.ObscuredTypes
namespace CodeStage::AntiCheat::ObscuredTypes {
  // Forward declaring type: ObscuredVector3
  struct ObscuredVector3;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
DEFINE_IL2CPP_ARG_TYPE(::CodeStage::AntiCheat::ObscuredTypes::ObscuredVector3, "CodeStage.AntiCheat.ObscuredTypes", "ObscuredVector3");
// Type namespace: CodeStage.AntiCheat.ObscuredTypes
namespace CodeStage::AntiCheat::ObscuredTypes {
  // Size: 0x21
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: CodeStage.AntiCheat.ObscuredTypes.ObscuredVector3
  // [TokenAttribute] Offset: FFFFFFFF
  // [DefaultMemberAttribute] Offset: AC21E4
  struct ObscuredVector3/*, public ::System::ValueType*/ {
    public:
    // Nested type: ::CodeStage::AntiCheat::ObscuredTypes::ObscuredVector3::RawEncryptedVector3
    struct RawEncryptedVector3;
    // Size: 0xC
    #pragma pack(push, 1)
    // WARNING Layout: Sequential may not be correctly taken into account!
    // Autogenerated type: CodeStage.AntiCheat.ObscuredTypes.ObscuredVector3/RawEncryptedVector3
    // [TokenAttribute] Offset: FFFFFFFF
    struct RawEncryptedVector3/*, public ::System::ValueType*/ {
      public:
      public:
      // public System.Int32 x
      // Size: 0x4
      // Offset: 0x0
      int x;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 y
      // Size: 0x4
      // Offset: 0x4
      int y;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      // public System.Int32 z
      // Size: 0x4
      // Offset: 0x8
      int z;
      // Field size check
      static_assert(sizeof(int) == 0x4);
      public:
      // Creating value type constructor for type: RawEncryptedVector3
      constexpr RawEncryptedVector3(int x_ = {}, int y_ = {}, int z_ = {}) noexcept : x{x_}, y{y_}, z{z_} {}
      // Creating interface conversion operator: operator ::System::ValueType
      operator ::System::ValueType() noexcept {
        return *reinterpret_cast<::System::ValueType*>(this);
      }
      // Get instance field reference: public System.Int32 x
      [[deprecated("Use field access instead!")]] int& dyn_x();
      // Get instance field reference: public System.Int32 y
      [[deprecated("Use field access instead!")]] int& dyn_y();
      // Get instance field reference: public System.Int32 z
      [[deprecated("Use field access instead!")]] int& dyn_z();
    }; // CodeStage.AntiCheat.ObscuredTypes.ObscuredVector3/RawEncryptedVector3
    #pragma pack(pop)
    static check_size<sizeof(ObscuredVector3::RawEncryptedVector3), 8 + sizeof(int)> __CodeStage_AntiCheat_ObscuredTypes_ObscuredVector3_RawEncryptedVector3SizeCheck;
    static_assert(sizeof(ObscuredVector3::RawEncryptedVector3) == 0xC);
    public:
    // private System.Int32 currentCryptoKey
    // Size: 0x4
    // Offset: 0x0
    int currentCryptoKey;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private CodeStage.AntiCheat.ObscuredTypes.ObscuredVector3/RawEncryptedVector3 hiddenValue
    // Size: 0xC
    // Offset: 0x4
    ::CodeStage::AntiCheat::ObscuredTypes::ObscuredVector3::RawEncryptedVector3 hiddenValue;
    // Field size check
    static_assert(sizeof(::CodeStage::AntiCheat::ObscuredTypes::ObscuredVector3::RawEncryptedVector3) == 0xC);
    // private System.Boolean inited
    // Size: 0x1
    // Offset: 0x10
    bool inited;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: inited and: fakeValue
    char __padding2[0x3] = {};
    // private UnityEngine.Vector3 fakeValue
    // Size: 0xC
    // Offset: 0x14
    ::UnityEngine::Vector3 fakeValue;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector3) == 0xC);
    // private System.Boolean fakeValueActive
    // Size: 0x1
    // Offset: 0x20
    bool fakeValueActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating value type constructor for type: ObscuredVector3
    constexpr ObscuredVector3(int currentCryptoKey_ = {}, ::CodeStage::AntiCheat::ObscuredTypes::ObscuredVector3::RawEncryptedVector3 hiddenValue_ = {}, bool inited_ = {}, ::UnityEngine::Vector3 fakeValue_ = {}, bool fakeValueActive_ = {}) noexcept : currentCryptoKey{currentCryptoKey_}, hiddenValue{hiddenValue_}, inited{inited_}, fakeValue{fakeValue_}, fakeValueActive{fakeValueActive_} {}
    // Creating interface conversion operator: operator ::System::ValueType
    operator ::System::ValueType() noexcept {
      return *reinterpret_cast<::System::ValueType*>(this);
    }
    // Get static field: static private System.Int32 cryptoKey
    static int _get_cryptoKey();
    // Set static field: static private System.Int32 cryptoKey
    static void _set_cryptoKey(int value);
