// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.Networking.ConnectionAcksType
#include "UnityEngine/Networking/ConnectionAcksType.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
  // Forward declaring type: IList`1<T>
  template<typename T>
  class IList_1;
}
// Forward declaring namespace: UnityEngine::Networking
namespace UnityEngine::Networking {
  // Forward declaring type: ChannelQOS
  class ChannelQOS;
  // Forward declaring type: QosType
  struct QosType;
}
// Completed forward declares
// Type namespace: UnityEngine.Networking
namespace UnityEngine::Networking {
  // Forward declaring type: ConnectionConfig
  class ConnectionConfig;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Networking::ConnectionConfig);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Networking::ConnectionConfig*, "UnityEngine.Networking", "ConnectionConfig");
// Type namespace: UnityEngine.Networking
namespace UnityEngine::Networking {
  // Size: 0x88
  #pragma pack(push, 1)
  // Autogenerated type: UnityEngine.Networking.ConnectionConfig
  // [TokenAttribute] Offset: FFFFFFFF
  // [ObsoleteAttribute] Offset: AA581C
  class ConnectionConfig : public ::Il2CppObject {
    public:
    public:
    // private System.UInt16 m_PacketSize
    // Size: 0x2
    // Offset: 0x10
    uint16_t m_PacketSize;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_FragmentSize
    // Size: 0x2
    // Offset: 0x12
    uint16_t m_FragmentSize;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt32 m_ResendTimeout
    // Size: 0x4
    // Offset: 0x14
    uint m_ResendTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_DisconnectTimeout
    // Size: 0x4
    // Offset: 0x18
    uint m_DisconnectTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_ConnectTimeout
    // Size: 0x4
    // Offset: 0x1C
    uint m_ConnectTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_MinUpdateTimeout
    // Size: 0x4
    // Offset: 0x20
    uint m_MinUpdateTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_PingTimeout
    // Size: 0x4
    // Offset: 0x24
    uint m_PingTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_ReducedPingTimeout
    // Size: 0x4
    // Offset: 0x28
    uint m_ReducedPingTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_AllCostTimeout
    // Size: 0x4
    // Offset: 0x2C
    uint m_AllCostTimeout;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Byte m_NetworkDropThreshold
    // Size: 0x1
    // Offset: 0x30
    uint8_t m_NetworkDropThreshold;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_OverflowDropThreshold
    // Size: 0x1
    // Offset: 0x31
    uint8_t m_OverflowDropThreshold;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // private System.Byte m_MaxConnectionAttempt
    // Size: 0x1
    // Offset: 0x32
    uint8_t m_MaxConnectionAttempt;
    // Field size check
    static_assert(sizeof(uint8_t) == 0x1);
    // Padding between fields: m_MaxConnectionAttempt and: m_AckDelay
    char __padding11[0x1] = {};
    // private System.UInt32 m_AckDelay
    // Size: 0x4
    // Offset: 0x34
    uint m_AckDelay;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt32 m_SendDelay
    // Size: 0x4
    // Offset: 0x38
    uint m_SendDelay;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.UInt16 m_MaxCombinedReliableMessageSize
    // Size: 0x2
    // Offset: 0x3C
    uint16_t m_MaxCombinedReliableMessageSize;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_MaxCombinedReliableMessageCount
    // Size: 0x2
    // Offset: 0x3E
    uint16_t m_MaxCombinedReliableMessageCount;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // private System.UInt16 m_MaxSentMessageQueueSize
    // Size: 0x2
    // Offset: 0x40
    uint16_t m_MaxSentMessageQueueSize;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: m_MaxSentMessageQueueSize and: m_AcksType
    char __padding16[0x2] = {};
    // private UnityEngine.Networking.ConnectionAcksType m_AcksType
    // Size: 0x4
    // Offset: 0x44
    ::UnityEngine::Networking::ConnectionAcksType m_AcksType;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::ConnectionAcksType) == 0x4);
    // private System.Boolean m_UsePlatformSpecificProtocols
    // Size: 0x1
    // Offset: 0x48
    bool m_UsePlatformSpecificProtocols;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_UsePlatformSpecificProtocols and: m_InitialBandwidth
    char __padding18[0x3] = {};
    // private System.UInt32 m_InitialBandwidth
    // Size: 0x4
    // Offset: 0x4C
    uint m_InitialBandwidth;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // private System.Single m_BandwidthPeakFactor
    // Size: 0x4
    // Offset: 0x50
    float m_BandwidthPeakFactor;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.UInt16 m_WebSocketReceiveBufferMaxSize
    // Size: 0x2
    // Offset: 0x54
    uint16_t m_WebSocketReceiveBufferMaxSize;
    // Field size check
    static_assert(sizeof(uint16_t) == 0x2);
    // Padding between fields: m_WebSocketReceiveBufferMaxSize and: m_UdpSocketReceiveBufferMaxSize
    char __padding21[0x2] = {};
    // private System.UInt32 m_UdpSocketReceiveBufferMaxSize
    // Size: 0x4
    // Offset: 0x58
    uint m_UdpSocketReceiveBufferMaxSize;
    // Field size check
    static_assert(sizeof(uint) == 0x4);
    // Padding between fields: m_UdpSocketReceiveBufferMaxSize and: m_SSLCertFilePath
    char __padding22[0x4] = {};
    // private System.String m_SSLCertFilePath
    // Size: 0x8
    // Offset: 0x60
    ::StringW m_SSLCertFilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_SSLPrivateKeyFilePath
    // Size: 0x8
    // Offset: 0x68
    ::StringW m_SSLPrivateKeyFilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // private System.String m_SSLCAFilePath
    // Size: 0x8
    // Offset: 0x70
    ::StringW m_SSLCAFilePath;
    // Field size check
    static_assert(sizeof(::StringW) == 0x8);
    // System.Collections.Generic.List`1<UnityEngine.Networking.ChannelQOS> m_Channels
    // Size: 0x8
    // Offset: 0x78
    ::System::Collections::Generic::List_1<::UnityEngine::Networking::ChannelQOS*>* m_Channels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::UnityEngine::Networking::ChannelQOS*>*) == 0x8);
    // System.Collections.Generic.List`1<System.Collections.Generic.List`1<System.Byte>> m_SharedOrderChannels
    // Size: 0x8
    // Offset: 0x80
    ::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<uint8_t>*>* m_SharedOrderChannels;
    // Field size check
    static_assert(sizeof(::System::Collections::Generic::List_1<::System::Collections::Generic::List_1<uint8_t>*>*) == 0x8);
    public:
    // Get instance field reference: private System.UInt16 m_PacketSize
    [[deprecated("Use field access instead!")]] uint16_t& dyn_m_PacketSize();
    // Get instance field reference: private System.UInt16 m_FragmentSize
    [[deprecated("Use field access instead!")]] uint16_t& dyn_m_FragmentSize();
    // Get instance field reference: private System.UInt32 m_ResendTimeout
    [[deprecated("Use field access instead!")]] uint& dyn_m_ResendTimeout();
    // Get instance field reference: private System.UInt32 m_DisconnectTimeout
    [[deprecated("Use field access instead!")]] uint& dyn_m_DisconnectTimeout();
    // Get instance field reference: private System.UInt32 m_ConnectTimeout
