// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: System.IDisposable
#include "System/IDisposable.hpp"
// Including type: System.IntPtr
#include "System/IntPtr.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
#include "beatsaber-hook/shared/utils/typedefs-string.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine::Networking
namespace UnityEngine::Networking {
  // Forward declaring type: DownloadHandler
  class DownloadHandler;
  // Forward declaring type: UploadHandler
  class UploadHandler;
  // Forward declaring type: CertificateHandler
  class CertificateHandler;
  // Forward declaring type: UnityWebRequestAsyncOperation
  class UnityWebRequestAsyncOperation;
  // Forward declaring type: IMultipartFormSection
  class IMultipartFormSection;
}
// Forward declaring namespace: System
namespace System {
  // Forward declaring type: Uri
  class Uri;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: AsyncOperation
  class AsyncOperation;
  // Forward declaring type: WWWForm
  class WWWForm;
}
// Forward declaring namespace: System::Collections::Generic
namespace System::Collections::Generic {
  // Forward declaring type: Dictionary`2<TKey, TValue>
  template<typename TKey, typename TValue>
  class Dictionary_2;
  // Forward declaring type: List`1<T>
  template<typename T>
  class List_1;
}
// Completed forward declares
// Type namespace: UnityEngine.Networking
namespace UnityEngine::Networking {
  // Forward declaring type: UnityWebRequest
  class UnityWebRequest;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::UnityEngine::Networking::UnityWebRequest);
DEFINE_IL2CPP_ARG_TYPE(::UnityEngine::Networking::UnityWebRequest*, "UnityEngine.Networking", "UnityWebRequest");
// Type namespace: UnityEngine.Networking
namespace UnityEngine::Networking {
  // Size: 0x3B
  #pragma pack(push, 1)
  // WARNING Layout: Sequential may not be correctly taken into account!
  // Autogenerated type: UnityEngine.Networking.UnityWebRequest
  // [TokenAttribute] Offset: FFFFFFFF
  // [NativeHeaderAttribute] Offset: A8CFC4
  class UnityWebRequest : public ::Il2CppObject/*, public ::System::IDisposable*/ {
    public:
    // Nested type: ::UnityEngine::Networking::UnityWebRequest::UnityWebRequestMethod
    struct UnityWebRequestMethod;
    // Nested type: ::UnityEngine::Networking::UnityWebRequest::UnityWebRequestError
    struct UnityWebRequestError;
    public:
    // System.IntPtr m_Ptr
    // Size: 0x8
    // Offset: 0x10
    ::System::IntPtr m_Ptr;
    // Field size check
    static_assert(sizeof(::System::IntPtr) == 0x8);
    // UnityEngine.Networking.DownloadHandler m_DownloadHandler
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Networking::DownloadHandler* m_DownloadHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::DownloadHandler*) == 0x8);
    // UnityEngine.Networking.UploadHandler m_UploadHandler
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::Networking::UploadHandler* m_UploadHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::UploadHandler*) == 0x8);
    // UnityEngine.Networking.CertificateHandler m_CertificateHandler
    // Size: 0x8
    // Offset: 0x28
    ::UnityEngine::Networking::CertificateHandler* m_CertificateHandler;
    // Field size check
    static_assert(sizeof(::UnityEngine::Networking::CertificateHandler*) == 0x8);
    // System.Uri m_Uri
    // Size: 0x8
    // Offset: 0x30
    ::System::Uri* m_Uri;
    // Field size check
    static_assert(sizeof(::System::Uri*) == 0x8);
    // [DebuggerBrowsableAttribute] Offset: 0xA8D1C8
    // [CompilerGeneratedAttribute] Offset: 0xA8D1C8
    // private System.Boolean <disposeCertificateHandlerOnDispose>k__BackingField
    // Size: 0x1
    // Offset: 0x38
    bool disposeCertificateHandlerOnDispose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [DebuggerBrowsableAttribute] Offset: 0xA8D204
    // [CompilerGeneratedAttribute] Offset: 0xA8D204
    // private System.Boolean <disposeDownloadHandlerOnDispose>k__BackingField
    // Size: 0x1
    // Offset: 0x39
    bool disposeDownloadHandlerOnDispose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // [DebuggerBrowsableAttribute] Offset: 0xA8D240
    // [CompilerGeneratedAttribute] Offset: 0xA8D240
    // private System.Boolean <disposeUploadHandlerOnDispose>k__BackingField
    // Size: 0x1
    // Offset: 0x3A
    bool disposeUploadHandlerOnDispose;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Creating interface conversion operator: operator ::System::IDisposable
    operator ::System::IDisposable() noexcept {
      return *reinterpret_cast<::System::IDisposable*>(this);
    }
    // Get instance field reference: System.IntPtr m_Ptr
    [[deprecated("Use field access instead!")]] ::System::IntPtr& dyn_m_Ptr();
    // Get instance field reference: UnityEngine.Networking.DownloadHandler m_DownloadHandler
    [[deprecated("Use field access instead!")]] ::UnityEngine::Networking::DownloadHandler*& dyn_m_DownloadHandler();
    // Get instance field reference: UnityEngine.Networking.UploadHandler m_UploadHandler
    [[deprecated("Use field access instead!")]] ::UnityEngine::Networking::UploadHandler*& dyn_m_UploadHandler();
    // Get instance field reference: UnityEngine.Networking.CertificateHandler m_CertificateHandler
