// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: AmplifyBloom.IAmplifyItem
#include "AmplifyBloom/IAmplifyItem.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: AmplifyBloom.GlareLibType
#include "AmplifyBloom/GlareLibType.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: AmplifyBloom
namespace AmplifyBloom {
  // Forward declaring type: GlareDefData
  class GlareDefData;
  // Forward declaring type: StarDefData
  class StarDefData;
  // Forward declaring type: AmplifyGlareCache
  class AmplifyGlareCache;
}
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: AmplifyBloom
namespace AmplifyBloom {
  // Forward declaring type: AmplifyGlare
  class AmplifyGlare;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AmplifyBloom::AmplifyGlare);
DEFINE_IL2CPP_ARG_TYPE(::AmplifyBloom::AmplifyGlare*, "AmplifyBloom", "AmplifyGlare");
// Type namespace: AmplifyBloom
namespace AmplifyBloom {
  // Size: 0xB0
  #pragma pack(push, 1)
  // Autogenerated type: AmplifyBloom.AmplifyGlare
  // [TokenAttribute] Offset: FFFFFFFF
  class AmplifyGlare : public ::Il2CppObject/*, public ::AmplifyBloom::IAmplifyItem*/ {
    public:
    public:
    // private AmplifyBloom.GlareDefData[] m_customGlareDef
    // Size: 0x8
    // Offset: 0x10
    ::ArrayW<::AmplifyBloom::GlareDefData*> m_customGlareDef;
    // Field size check
    static_assert(sizeof(::ArrayW<::AmplifyBloom::GlareDefData*>) == 0x8);
    // private System.Int32 m_customGlareDefIdx
    // Size: 0x4
    // Offset: 0x18
    int m_customGlareDefIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_customGlareDefAmount
    // Size: 0x4
    // Offset: 0x1C
    int m_customGlareDefAmount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Boolean m_applyGlare
    // Size: 0x1
    // Offset: 0x20
    bool m_applyGlare;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_applyGlare and: overallTint
    char __padding3[0x3] = {};
    // private UnityEngine.Color _overallTint
    // Size: 0x10
    // Offset: 0x24
    ::UnityEngine::Color overallTint;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // Padding between fields: overallTint and: m_cromaticAberrationGrad
    char __padding4[0x4] = {};
    // private UnityEngine.Gradient m_cromaticAberrationGrad
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Gradient* m_cromaticAberrationGrad;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private System.Int32 m_glareMaxPassCount
    // Size: 0x4
    // Offset: 0x40
    int m_glareMaxPassCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // Padding between fields: m_glareMaxPassCount and: m_starDefArr
    char __padding6[0x4] = {};
    // private AmplifyBloom.StarDefData[] m_starDefArr
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::AmplifyBloom::StarDefData*> m_starDefArr;
    // Field size check
    static_assert(sizeof(::ArrayW<::AmplifyBloom::StarDefData*>) == 0x8);
    // private AmplifyBloom.GlareDefData[] m_glareDefArr
    // Size: 0x8
    // Offset: 0x50
    ::ArrayW<::AmplifyBloom::GlareDefData*> m_glareDefArr;
    // Field size check
    static_assert(sizeof(::ArrayW<::AmplifyBloom::GlareDefData*>) == 0x8);
    // private UnityEngine.Matrix4x4[] m_weigthsMat
    // Size: 0x8
    // Offset: 0x58
    ::ArrayW<::UnityEngine::Matrix4x4> m_weigthsMat;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private UnityEngine.Matrix4x4[] m_offsetsMat
    // Size: 0x8
    // Offset: 0x60
    ::ArrayW<::UnityEngine::Matrix4x4> m_offsetsMat;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Matrix4x4>) == 0x8);
    // private UnityEngine.Color m_whiteReference
    // Size: 0x10
    // Offset: 0x68
    ::UnityEngine::Color m_whiteReference;
    // Field size check
    static_assert(sizeof(::UnityEngine::Color) == 0x10);
    // private System.Single m_aTanFoV
    // Size: 0x4
    // Offset: 0x78
    float m_aTanFoV;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_aTanFoV and: m_amplifyGlareCache
    char __padding12[0x4] = {};
    // private AmplifyBloom.AmplifyGlareCache m_amplifyGlareCache
    // Size: 0x8
    // Offset: 0x80
    ::AmplifyBloom::AmplifyGlareCache* m_amplifyGlareCache;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::AmplifyGlareCache*) == 0x8);
    // private System.Int32 m_currentWidth
    // Size: 0x4
    // Offset: 0x88
    int m_currentWidth;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Int32 m_currentHeight
    // Size: 0x4
    // Offset: 0x8C
    int m_currentHeight;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private AmplifyBloom.GlareLibType m_currentGlareType
    // Size: 0x4
    // Offset: 0x90
    ::AmplifyBloom::GlareLibType m_currentGlareType;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::GlareLibType) == 0x4);
    // private System.Int32 m_currentGlareIdx
    // Size: 0x4
    // Offset: 0x94
    int m_currentGlareIdx;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private System.Single m_perPassDisplacement
    // Size: 0x4
    // Offset: 0x98
    float m_perPassDisplacement;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_intensity
    // Size: 0x4
    // Offset: 0x9C
    float m_intensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_overallStreakScale
    // Size: 0x4
    // Offset: 0xA0
    float m_overallStreakScale;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_isDirty
    // Size: 0x1
    // Offset: 0xA4
    bool m_isDirty;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_isDirty and: rtBuffer
    char __padding21[0x3] = {};
    // private UnityEngine.RenderTexture[] _rtBuffer
    // Size: 0x8
    // Offset: 0xA8
    ::ArrayW<::UnityEngine::RenderTexture*> rtBuffer;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RenderTexture*>) == 0x8);
    public:
    // Creating interface conversion operator: operator ::AmplifyBloom::IAmplifyItem
    operator ::AmplifyBloom::IAmplifyItem() noexcept {
      return *reinterpret_cast<::AmplifyBloom::IAmplifyItem*>(this);
    }
    // static field const value: static public System.Int32 MaxLineSamples
    static constexpr const int MaxLineSamples = 8;
    // Get static field: static public System.Int32 MaxLineSamples
    static int _get_MaxLineSamples();
    // Set static field: static public System.Int32 MaxLineSamples
    static void _set_MaxLineSamples(int value);
    // static field const value: static public System.Int32 MaxTotalSamples
    static constexpr const int MaxTotalSamples = 16;
    // Get static field: static public System.Int32 MaxTotalSamples
    static int _get_MaxTotalSamples();
