// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: AmplifyBloom.IAmplifyItem
#include "AmplifyBloom/IAmplifyItem.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: UnityEngine.Color
#include "UnityEngine/Color.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Gradient
  class Gradient;
  // Forward declaring type: Texture2D
  class Texture2D;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: Material
  class Material;
}
// Completed forward declares
// Type namespace: AmplifyBloom
namespace AmplifyBloom {
  // Forward declaring type: AmplifyLensFlare
  class AmplifyLensFlare;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AmplifyBloom::AmplifyLensFlare);
DEFINE_IL2CPP_ARG_TYPE(::AmplifyBloom::AmplifyLensFlare*, "AmplifyBloom", "AmplifyLensFlare");
// Type namespace: AmplifyBloom
namespace AmplifyBloom {
  // Size: 0x68
  #pragma pack(push, 1)
  // Autogenerated type: AmplifyBloom.AmplifyLensFlare
  // [TokenAttribute] Offset: FFFFFFFF
  class AmplifyLensFlare : public ::Il2CppObject/*, public ::AmplifyBloom::IAmplifyItem*/ {
    public:
    public:
    // private System.Single m_overallIntensity
    // Size: 0x4
    // Offset: 0x10
    float m_overallIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_normalizedGhostIntensity
    // Size: 0x4
    // Offset: 0x14
    float m_normalizedGhostIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Single m_normalizedHaloIntensity
    // Size: 0x4
    // Offset: 0x18
    float m_normalizedHaloIntensity;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Boolean m_applyLensFlare
    // Size: 0x1
    // Offset: 0x1C
    bool m_applyLensFlare;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_applyLensFlare and: m_lensFlareGhostAmount
    char __padding3[0x3] = {};
    // private System.Int32 m_lensFlareGhostAmount
    // Size: 0x4
    // Offset: 0x20
    int m_lensFlareGhostAmount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.Vector4 m_lensFlareGhostsParams
    // Size: 0x10
    // Offset: 0x24
    ::UnityEngine::Vector4 m_lensFlareGhostsParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Single m_lensFlareGhostChrDistortion
    // Size: 0x4
    // Offset: 0x34
    float m_lensFlareGhostChrDistortion;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Gradient m_lensGradient
    // Size: 0x8
    // Offset: 0x38
    ::UnityEngine::Gradient* m_lensGradient;
    // Field size check
    static_assert(sizeof(::UnityEngine::Gradient*) == 0x8);
    // private UnityEngine.Texture2D m_lensFlareGradTexture
    // Size: 0x8
    // Offset: 0x40
    ::UnityEngine::Texture2D* m_lensFlareGradTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture2D*) == 0x8);
    // private UnityEngine.Color[] m_lensFlareGradColor
    // Size: 0x8
    // Offset: 0x48
    ::ArrayW<::UnityEngine::Color> m_lensFlareGradColor;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Color>) == 0x8);
    // private UnityEngine.Vector4 m_lensFlareHaloParams
    // Size: 0x10
    // Offset: 0x50
    ::UnityEngine::Vector4 m_lensFlareHaloParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Single m_lensFlareHaloChrDistortion
    // Size: 0x4
    // Offset: 0x60
    float m_lensFlareHaloChrDistortion;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_lensFlareGaussianBlurAmount
    // Size: 0x4
    // Offset: 0x64
    int m_lensFlareGaussianBlurAmount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    public:
    // Creating interface conversion operator: operator ::AmplifyBloom::IAmplifyItem
    operator ::AmplifyBloom::IAmplifyItem() noexcept {
      return *reinterpret_cast<::AmplifyBloom::IAmplifyItem*>(this);
    }
    // static field const value: static private System.Int32 LUTTextureWidth
    static constexpr const int LUTTextureWidth = 256;
    // Get static field: static private System.Int32 LUTTextureWidth
    static int _get_LUTTextureWidth();
    // Set static field: static private System.Int32 LUTTextureWidth
    static void _set_LUTTextureWidth(int value);
    // Get instance field reference: private System.Single m_overallIntensity
    [[deprecated("Use field access instead!")]] float& dyn_m_overallIntensity();
    // Get instance field reference: private System.Single m_normalizedGhostIntensity
