// Autogenerated from CppHeaderCreator
// Created by Sc2ad
// =========================================================================
#pragma once
// Begin includes
#include "beatsaber-hook/shared/utils/typedefs.h"
#include "beatsaber-hook/shared/utils/byref.hpp"
// Including type: UnityEngine.MonoBehaviour
#include "UnityEngine/MonoBehaviour.hpp"
// Including type: AmplifyBloom.DebugToScreenEnum
#include "AmplifyBloom/DebugToScreenEnum.hpp"
// Including type: UnityEngine.Vector4
#include "UnityEngine/Vector4.hpp"
// Including type: AmplifyBloom.UpscaleQualityEnum
#include "AmplifyBloom/UpscaleQualityEnum.hpp"
// Including type: AmplifyBloom.MainThresholdSizeEnum
#include "AmplifyBloom/MainThresholdSizeEnum.hpp"
// Including type: UnityEngine.Matrix4x4
#include "UnityEngine/Matrix4x4.hpp"
// Including type: UnityEngine.Vector2
#include "UnityEngine/Vector2.hpp"
// Including type: System.Int32
#include "System/Int32.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-methods.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-properties.hpp"
#include "beatsaber-hook/shared/utils/il2cpp-utils-fields.hpp"
#include "beatsaber-hook/shared/utils/utils.h"
#include "beatsaber-hook/shared/utils/typedefs-array.hpp"
// Completed includes
// Begin forward declares
// Forward declaring namespace: UnityEngine
namespace UnityEngine {
  // Forward declaring type: Texture
  class Texture;
  // Forward declaring type: RenderTexture
  class RenderTexture;
  // Forward declaring type: AnimationCurve
  class AnimationCurve;
  // Forward declaring type: Transform
  class Transform;
  // Forward declaring type: Shader
  class Shader;
  // Forward declaring type: Material
  class Material;
  // Forward declaring type: Camera
  class Camera;
}
// Forward declaring namespace: AmplifyBloom
namespace AmplifyBloom {
  // Forward declaring type: AmplifyLensFlare
  class AmplifyLensFlare;
  // Forward declaring type: AmplifyGlare
  class AmplifyGlare;
  // Forward declaring type: AmplifyBokeh
  class AmplifyBokeh;
  // Forward declaring type: PrecisionModes
  struct PrecisionModes;
}
// Completed forward declares
// Type namespace: AmplifyBloom
namespace AmplifyBloom {
  // Forward declaring type: AmplifyBloomBase
  class AmplifyBloomBase;
}
#include "beatsaber-hook/shared/utils/il2cpp-type-check.hpp"
NEED_NO_BOX(::AmplifyBloom::AmplifyBloomBase);
DEFINE_IL2CPP_ARG_TYPE(::AmplifyBloom::AmplifyBloomBase*, "AmplifyBloom", "AmplifyBloomBase");
// Type namespace: AmplifyBloom
namespace AmplifyBloom {
  // Size: 0x189
  #pragma pack(push, 1)
  // Autogenerated type: AmplifyBloom.AmplifyBloomBase
  // [TokenAttribute] Offset: FFFFFFFF
  // [AddComponentMenu] Offset: AD8770
  class AmplifyBloomBase : public ::UnityEngine::MonoBehaviour {
    public:
    public:
    // private UnityEngine.Texture m_maskTexture
    // Size: 0x8
    // Offset: 0x18
    ::UnityEngine::Texture* m_maskTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private UnityEngine.RenderTexture m_targetTexture
    // Size: 0x8
    // Offset: 0x20
    ::UnityEngine::RenderTexture* m_targetTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private System.Boolean m_showDebugMessages
    // Size: 0x1
    // Offset: 0x28
    bool m_showDebugMessages;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_showDebugMessages and: m_softMaxdownscales
    char __padding2[0x3] = {};
    // private System.Int32 m_softMaxdownscales
    // Size: 0x4
    // Offset: 0x2C
    int m_softMaxdownscales;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private AmplifyBloom.DebugToScreenEnum m_debugToScreen
    // Size: 0x4
    // Offset: 0x30
    ::AmplifyBloom::DebugToScreenEnum m_debugToScreen;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::DebugToScreenEnum) == 0x4);
    // private System.Boolean m_highPrecision
    // Size: 0x1
    // Offset: 0x34
    bool m_highPrecision;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_highPrecision and: m_bloomRange
    char __padding5[0x3] = {};
    // private UnityEngine.Vector4 m_bloomRange
    // Size: 0x10
    // Offset: 0x38
    ::UnityEngine::Vector4 m_bloomRange;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Single m_overallThreshold
    // Size: 0x4
    // Offset: 0x48
    float m_overallThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Vector4 m_bloomParams
    // Size: 0x10
    // Offset: 0x4C
    ::UnityEngine::Vector4 m_bloomParams;
    // Field size check
    static_assert(sizeof(::UnityEngine::Vector4) == 0x10);
    // private System.Boolean m_temporalFilteringActive
    // Size: 0x1
    // Offset: 0x5C
    bool m_temporalFilteringActive;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_temporalFilteringActive and: m_temporalFilteringValue
    char __padding9[0x3] = {};
    // private System.Single m_temporalFilteringValue
    // Size: 0x4
    // Offset: 0x60
    float m_temporalFilteringValue;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private System.Int32 m_bloomDownsampleCount
    // Size: 0x4
    // Offset: 0x64
    int m_bloomDownsampleCount;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private UnityEngine.AnimationCurve m_temporalFilteringCurve
    // Size: 0x8
    // Offset: 0x68
    ::UnityEngine::AnimationCurve* m_temporalFilteringCurve;
    // Field size check
    static_assert(sizeof(::UnityEngine::AnimationCurve*) == 0x8);
    // private System.Boolean m_separateFeaturesThreshold
    // Size: 0x1
    // Offset: 0x70
    bool m_separateFeaturesThreshold;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_separateFeaturesThreshold and: m_featuresThreshold
    char __padding13[0x3] = {};
    // private System.Single m_featuresThreshold
    // Size: 0x4
    // Offset: 0x74
    float m_featuresThreshold;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private AmplifyBloom.AmplifyLensFlare m_lensFlare
    // Size: 0x8
    // Offset: 0x78
    ::AmplifyBloom::AmplifyLensFlare* m_lensFlare;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::AmplifyLensFlare*) == 0x8);
    // private System.Boolean m_applyLensDirt
    // Size: 0x1
    // Offset: 0x80
    bool m_applyLensDirt;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_applyLensDirt and: m_lensDirtStrength
    char __padding16[0x3] = {};
    // private System.Single m_lensDirtStrength
    // Size: 0x4
    // Offset: 0x84
    float m_lensDirtStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // private UnityEngine.Texture m_lensDirtTexture
    // Size: 0x8
    // Offset: 0x88
    ::UnityEngine::Texture* m_lensDirtTexture;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Boolean m_applyLensStardurst
    // Size: 0x1
    // Offset: 0x90
    bool m_applyLensStardurst;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    // Padding between fields: m_applyLensStardurst and: m_lensStardurstTex
    char __padding19[0x7] = {};
    // private UnityEngine.Texture m_lensStardurstTex
    // Size: 0x8
    // Offset: 0x98
    ::UnityEngine::Texture* m_lensStardurstTex;
    // Field size check
    static_assert(sizeof(::UnityEngine::Texture*) == 0x8);
    // private System.Single m_lensStarburstStrength
    // Size: 0x4
    // Offset: 0xA0
    float m_lensStarburstStrength;
    // Field size check
    static_assert(sizeof(float) == 0x4);
    // Padding between fields: m_lensStarburstStrength and: m_anamorphicGlare
    char __padding21[0x4] = {};
    // private AmplifyBloom.AmplifyGlare m_anamorphicGlare
    // Size: 0x8
    // Offset: 0xA8
    ::AmplifyBloom::AmplifyGlare* m_anamorphicGlare;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::AmplifyGlare*) == 0x8);
    // private AmplifyBloom.AmplifyBokeh m_bokehFilter
    // Size: 0x8
    // Offset: 0xB0
    ::AmplifyBloom::AmplifyBokeh* m_bokehFilter;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::AmplifyBokeh*) == 0x8);
    // private System.Single[] m_upscaleWeights
    // Size: 0x8
    // Offset: 0xB8
    ::ArrayW<float> m_upscaleWeights;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] m_gaussianRadius
    // Size: 0x8
    // Offset: 0xC0
    ::ArrayW<float> m_gaussianRadius;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Int32[] m_gaussianSteps
    // Size: 0x8
    // Offset: 0xC8
    ::ArrayW<int> m_gaussianSteps;
    // Field size check
    static_assert(sizeof(::ArrayW<int>) == 0x8);
    // private System.Single[] m_lensDirtWeights
    // Size: 0x8
    // Offset: 0xD0
    ::ArrayW<float> m_lensDirtWeights;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Single[] m_lensStarburstWeights
    // Size: 0x8
    // Offset: 0xD8
    ::ArrayW<float> m_lensStarburstWeights;
    // Field size check
    static_assert(sizeof(::ArrayW<float>) == 0x8);
    // private System.Boolean[] m_downscaleSettingsFoldout
    // Size: 0x8
    // Offset: 0xE0
    ::ArrayW<bool> m_downscaleSettingsFoldout;
    // Field size check
    static_assert(sizeof(::ArrayW<bool>) == 0x8);
    // private System.Int32 m_featuresSourceId
    // Size: 0x4
    // Offset: 0xE8
    int m_featuresSourceId;
    // Field size check
    static_assert(sizeof(int) == 0x4);
    // private AmplifyBloom.UpscaleQualityEnum m_upscaleQuality
    // Size: 0x4
    // Offset: 0xEC
    ::AmplifyBloom::UpscaleQualityEnum m_upscaleQuality;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::UpscaleQualityEnum) == 0x4);
    // private AmplifyBloom.MainThresholdSizeEnum m_mainThresholdSize
    // Size: 0x4
    // Offset: 0xF0
    ::AmplifyBloom::MainThresholdSizeEnum m_mainThresholdSize;
    // Field size check
    static_assert(sizeof(::AmplifyBloom::MainThresholdSizeEnum) == 0x4);
    // Padding between fields: m_mainThresholdSize and: m_cameraTransform
    char __padding32[0x4] = {};
    // private UnityEngine.Transform m_cameraTransform
    // Size: 0x8
    // Offset: 0xF8
    ::UnityEngine::Transform* m_cameraTransform;
    // Field size check
    static_assert(sizeof(::UnityEngine::Transform*) == 0x8);
    // private UnityEngine.Matrix4x4 m_starburstMat
    // Size: 0x40
    // Offset: 0x100
    ::UnityEngine::Matrix4x4 m_starburstMat;
    // Field size check
    static_assert(sizeof(::UnityEngine::Matrix4x4) == 0x40);
    // private UnityEngine.Shader m_bloomShader
    // Size: 0x8
    // Offset: 0x140
    ::UnityEngine::Shader* m_bloomShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Material m_bloomMaterial
    // Size: 0x8
    // Offset: 0x148
    ::UnityEngine::Material* m_bloomMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.Shader m_finalCompositionShader
    // Size: 0x8
    // Offset: 0x150
    ::UnityEngine::Shader* m_finalCompositionShader;
    // Field size check
    static_assert(sizeof(::UnityEngine::Shader*) == 0x8);
    // private UnityEngine.Material m_finalCompositionMaterial
    // Size: 0x8
    // Offset: 0x158
    ::UnityEngine::Material* m_finalCompositionMaterial;
    // Field size check
    static_assert(sizeof(::UnityEngine::Material*) == 0x8);
    // private UnityEngine.RenderTexture m_tempFilterBuffer
    // Size: 0x8
    // Offset: 0x160
    ::UnityEngine::RenderTexture* m_tempFilterBuffer;
    // Field size check
    static_assert(sizeof(::UnityEngine::RenderTexture*) == 0x8);
    // private UnityEngine.Camera m_camera
    // Size: 0x8
    // Offset: 0x168
    ::UnityEngine::Camera* m_camera;
    // Field size check
    static_assert(sizeof(::UnityEngine::Camera*) == 0x8);
    // private UnityEngine.RenderTexture[] m_tempUpscaleRTs
    // Size: 0x8
    // Offset: 0x170
    ::ArrayW<::UnityEngine::RenderTexture*> m_tempUpscaleRTs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RenderTexture*>) == 0x8);
    // private UnityEngine.RenderTexture[] m_tempAuxDownsampleRTs
    // Size: 0x8
    // Offset: 0x178
    ::ArrayW<::UnityEngine::RenderTexture*> m_tempAuxDownsampleRTs;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::RenderTexture*>) == 0x8);
    // private UnityEngine.Vector2[] m_tempDownsamplesSizes
    // Size: 0x8
    // Offset: 0x180
    ::ArrayW<::UnityEngine::Vector2> m_tempDownsamplesSizes;
    // Field size check
    static_assert(sizeof(::ArrayW<::UnityEngine::Vector2>) == 0x8);
    // private System.Boolean silentError
    // Size: 0x1
    // Offset: 0x188
    bool silentError;
    // Field size check
    static_assert(sizeof(bool) == 0x1);
    public:
    // Deleting conversion operator: operator ::System::IntPtr
    constexpr operator ::System::IntPtr() const noexcept = delete;
    // static field const value: static public System.Int32 MaxGhosts
    static constexpr const int MaxGhosts = 5;
    // Get static field: static public System.Int32 MaxGhosts
    static int _get_MaxGhosts();
    // Set static field: static public System.Int32 MaxGhosts
    static void _set_MaxGhosts(int value);
    // static field const value: static public System.Int32 MinDownscales
    static constexpr const int MinDownscales = 1;
    // Get static field: static public System.Int32 MinDownscales
    static int _get_MinDownscales();
    // Set static field: static public System.Int32 MinDownscales
    static void _set_MinDownscales(int value);
    // static field const value: static public System.Int32 MaxDownscales
